#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Valet_GasPumpIndicatorManagerV2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Valet_GasPumpIndicatorManagerV2.Valet_GasPumpIndicatorManagerV2_C.AddGasPump
// 0x0110 (0x0110 - 0x0000)
struct Valet_GasPumpIndicatorManagerV2_C_AddGasPump final
{
public:
	class UB_GasPump_Valet_Component_C*           Gas_Pump;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundNearbyFuelIndicator;                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFuelIndicator_C*                       K2Node_DynamicCast_AsFuel_Indicator;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFuelIndicator_C*                       CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance2DSquared_ReturnValue;     // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump) == 0x000010, "Wrong alignment on Valet_GasPumpIndicatorManagerV2_C_AddGasPump");
static_assert(sizeof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump) == 0x000110, "Wrong size on Valet_GasPumpIndicatorManagerV2_C_AddGasPump");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, Gas_Pump) == 0x000000, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::Gas_Pump' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, FoundNearbyFuelIndicator) == 0x000008, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::FoundNearbyFuelIndicator' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, Temp_bool_True_if_break_was_hit_Variable) == 0x000009, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_Not_PreBool_ReturnValue) == 0x000098, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, Temp_int_Array_Index_Variable) == 0x00009C, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A8, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B0, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, K2Node_DynamicCast_AsFuel_Indicator) == 0x0000B8, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::K2Node_DynamicCast_AsFuel_Indicator' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_IsValid_ReturnValue_1) == 0x0000C1, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_Array_Add_ReturnValue) == 0x0000C4, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_Array_AddUnique_ReturnValue) == 0x0000D0, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000D8, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_IsValid_ReturnValue_2) == 0x0000F0, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_Vector_Distance2DSquared_ReturnValue) == 0x0000F4, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_Vector_Distance2DSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000F8, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_Array_Length_ReturnValue) == 0x0000FC, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_AddGasPump, CallFunc_BooleanAND_ReturnValue) == 0x000101, "Member 'Valet_GasPumpIndicatorManagerV2_C_AddGasPump::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Valet_GasPumpIndicatorManagerV2.Valet_GasPumpIndicatorManagerV2_C.RemoveGasPump
// 0x00D8 (0x00D8 - 0x0000)
struct Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump final
{
public:
	class UB_GasPump_Valet_Component_C*           Gas_Pump;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundNearbyGasPump;                                // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFuelIndicator_C*>               RemovalList;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFuelIndicator_C*                       CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UB_GasPump_Valet_Component_C*           CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFuelIndicator_C*                       CallFunc_Array_Get_Item_2;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2DSquared_ReturnValue;     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump) == 0x000008, "Wrong alignment on Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump");
static_assert(sizeof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump) == 0x0000D8, "Wrong size on Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, Gas_Pump) == 0x000000, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::Gas_Pump' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, FoundNearbyGasPump) == 0x000008, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::FoundNearbyGasPump' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, RemovalList) == 0x000010, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::RemovalList' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, Temp_int_Array_Index_Variable) == 0x000020, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, Temp_bool_True_if_break_was_hit_Variable) == 0x000034, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, Temp_int_Array_Index_Variable_2) == 0x000038, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Not_PreBool_ReturnValue) == 0x00003C, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Array_Get_Item) == 0x000048, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, Temp_int_Loop_Counter_Variable_2) == 0x00005C, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Array_RemoveItem_ReturnValue) == 0x000060, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Add_IntInt_ReturnValue_2) == 0x000064, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Array_Get_Item_2) == 0x000070, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_GetOwner_ReturnValue) == 0x000078, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_IsValid_ReturnValue_1) == 0x000084, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_IsValid_ReturnValue_2) == 0x0000A0, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A8, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Vector_Distance2DSquared_ReturnValue) == 0x0000C0, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Vector_Distance2DSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Array_Length_ReturnValue_1) == 0x0000C4, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000C8, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C9, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Array_Length_ReturnValue_2) == 0x0000CC, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000D0, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x0000D1, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump, CallFunc_BooleanAND_ReturnValue) == 0x0000D2, "Member 'Valet_GasPumpIndicatorManagerV2_C_RemoveGasPump::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

