#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VariantScript_Pickaxe_BistroAstronaut_Color

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_0_structs.hpp"


namespace SDK::Params
{

// Function VariantScript_Pickaxe_BistroAstronaut_Color.VariantScript_Pickaxe_BistroAstronaut_Color_C.DetermineVariantSelection
// 0x0178 (0x0178 - 0x0000)
struct VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection final
{
public:
	struct FFortAthenaLoadout                     Loadout;                                           // 0x0000(0x0168)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ReturnValue;                                       // 0x0168(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetActiveVariantForSoftItemAndChannel_ReturnValue; // 0x016C(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetActiveVariantForSoftItemAndChannel_ReturnValue_1; // 0x0170(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemInLoadout_ReturnValue;              // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection) == 0x000008, "Wrong alignment on VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection");
static_assert(sizeof(VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection) == 0x000178, "Wrong size on VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection");
static_assert(offsetof(VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection, Loadout) == 0x000000, "Member 'VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection::Loadout' has a wrong offset!");
static_assert(offsetof(VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection, ReturnValue) == 0x000168, "Member 'VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection::ReturnValue' has a wrong offset!");
static_assert(offsetof(VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection, CallFunc_GetActiveVariantForSoftItemAndChannel_ReturnValue) == 0x00016C, "Member 'VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection::CallFunc_GetActiveVariantForSoftItemAndChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection, CallFunc_GetActiveVariantForSoftItemAndChannel_ReturnValue_1) == 0x000170, "Member 'VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection::CallFunc_GetActiveVariantForSoftItemAndChannel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000174, "Member 'VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection, CallFunc_IsItemInLoadout_ReturnValue) == 0x000175, "Member 'VariantScript_Pickaxe_BistroAstronaut_Color_C_DetermineVariantSelection::CallFunc_IsItemInLoadout_ReturnValue' has a wrong offset!");

}

