#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultCharacterLightingBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function VaultCharacterLightingBP.VaultCharacterLightingBP_C.SwitchPCLighting
// 0x0001 (0x0001 - 0x0000)
struct VaultCharacterLightingBP_C_SwitchPCLighting final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultCharacterLightingBP_C_SwitchPCLighting) == 0x000001, "Wrong alignment on VaultCharacterLightingBP_C_SwitchPCLighting");
static_assert(sizeof(VaultCharacterLightingBP_C_SwitchPCLighting) == 0x000001, "Wrong size on VaultCharacterLightingBP_C_SwitchPCLighting");
static_assert(offsetof(VaultCharacterLightingBP_C_SwitchPCLighting, Visibility) == 0x000000, "Member 'VaultCharacterLightingBP_C_SwitchPCLighting::Visibility' has a wrong offset!");

// Function VaultCharacterLightingBP.VaultCharacterLightingBP_C.SwitchMobileLighting
// 0x0001 (0x0001 - 0x0000)
struct VaultCharacterLightingBP_C_SwitchMobileLighting final
{
public:
	bool                                          Visibilty;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultCharacterLightingBP_C_SwitchMobileLighting) == 0x000001, "Wrong alignment on VaultCharacterLightingBP_C_SwitchMobileLighting");
static_assert(sizeof(VaultCharacterLightingBP_C_SwitchMobileLighting) == 0x000001, "Wrong size on VaultCharacterLightingBP_C_SwitchMobileLighting");
static_assert(offsetof(VaultCharacterLightingBP_C_SwitchMobileLighting, Visibilty) == 0x000000, "Member 'VaultCharacterLightingBP_C_SwitchMobileLighting::Visibilty' has a wrong offset!");

// Function VaultCharacterLightingBP.VaultCharacterLightingBP_C.LightControl
// 0x0001 (0x0001 - 0x0000)
struct VaultCharacterLightingBP_C_LightControl final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultCharacterLightingBP_C_LightControl) == 0x000001, "Wrong alignment on VaultCharacterLightingBP_C_LightControl");
static_assert(sizeof(VaultCharacterLightingBP_C_LightControl) == 0x000001, "Wrong size on VaultCharacterLightingBP_C_LightControl");
static_assert(offsetof(VaultCharacterLightingBP_C_LightControl, NewParam) == 0x000000, "Member 'VaultCharacterLightingBP_C_LightControl::NewParam' has a wrong offset!");

// Function VaultCharacterLightingBP.VaultCharacterLightingBP_C.ExecuteUbergraph_VaultCharacterLightingBP
// 0x0038 (0x0038 - 0x0000)
struct VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue_1;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue_1;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewParam;                       // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue_1;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue_2;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP) == 0x000008, "Wrong alignment on VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP");
static_assert(sizeof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP) == 0x000038, "Wrong size on VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, EntryPoint) == 0x000000, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_IsErebus_ReturnValue) == 0x000004, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_IsErebus_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_IsMobilePlatform_ReturnValue) == 0x000005, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_GetShadowQuality_ReturnValue) == 0x000010, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_IsMobilePlatform_ReturnValue_1) == 0x000014, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_IsMobilePlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000015, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_BooleanOR_ReturnValue) == 0x000016, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_BooleanOR_ReturnValue_1) == 0x000017, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000018, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_GetShadowQuality_ReturnValue_1) == 0x000020, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_GetShadowQuality_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000024, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_BooleanOR_ReturnValue_2) == 0x000025, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, K2Node_CustomEvent_NewParam) == 0x000026, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_IsErebus_ReturnValue_1) == 0x000034, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_IsErebus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_BooleanOR_ReturnValue_3) == 0x000035, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_IsErebus_ReturnValue_2) == 0x000036, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_IsErebus_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP, CallFunc_BooleanOR_ReturnValue_4) == 0x000037, "Member 'VaultCharacterLightingBP_C_ExecuteUbergraph_VaultCharacterLightingBP::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");

// Function VaultCharacterLightingBP.VaultCharacterLightingBP_C.SwitchPCLighting_LOWDetail
// 0x0001 (0x0001 - 0x0000)
struct VaultCharacterLightingBP_C_SwitchPCLighting_LOWDetail final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultCharacterLightingBP_C_SwitchPCLighting_LOWDetail) == 0x000001, "Wrong alignment on VaultCharacterLightingBP_C_SwitchPCLighting_LOWDetail");
static_assert(sizeof(VaultCharacterLightingBP_C_SwitchPCLighting_LOWDetail) == 0x000001, "Wrong size on VaultCharacterLightingBP_C_SwitchPCLighting_LOWDetail");
static_assert(offsetof(VaultCharacterLightingBP_C_SwitchPCLighting_LOWDetail, Visibility) == 0x000000, "Member 'VaultCharacterLightingBP_C_SwitchPCLighting_LOWDetail::Visibility' has a wrong offset!");

}

