#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultCharacterPlacementHelper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass VaultCharacterPlacementHelper.VaultCharacterPlacementHelper_C
// 0x00D0 (0x0340 - 0x0270)
class AVaultCharacterPlacementHelper_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Floor;                                             // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CharacterPlacement;                                // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             OriginalTransform;                                 // 0x0290(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                OffsetTranslate;                                   // 0x02F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OffsetRotate;                                      // 0x0308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Athena;                                            // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(float CurrentZoomLevel)> OnZoomLevelUpdated;                                // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UserConstructionScript();
	void OnFrontEndCameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void ExecuteUbergraph_VaultCharacterPlacementHelper(int32 EntryPoint);
	void UpdatePosition_For_Camera(EFrontEndCamera FrontEndCamera);
	void SubGameChanged_Event_0(ESubGame SubGame);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VaultCharacterPlacementHelper_C">();
	}
	static class AVaultCharacterPlacementHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVaultCharacterPlacementHelper_C>();
	}
};
static_assert(alignof(AVaultCharacterPlacementHelper_C) == 0x000010, "Wrong alignment on AVaultCharacterPlacementHelper_C");
static_assert(sizeof(AVaultCharacterPlacementHelper_C) == 0x000340, "Wrong size on AVaultCharacterPlacementHelper_C");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, UberGraphFrame) == 0x000270, "Member 'AVaultCharacterPlacementHelper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, Floor) == 0x000278, "Member 'AVaultCharacterPlacementHelper_C::Floor' has a wrong offset!");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, CharacterPlacement) == 0x000280, "Member 'AVaultCharacterPlacementHelper_C::CharacterPlacement' has a wrong offset!");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, Root) == 0x000288, "Member 'AVaultCharacterPlacementHelper_C::Root' has a wrong offset!");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, OriginalTransform) == 0x000290, "Member 'AVaultCharacterPlacementHelper_C::OriginalTransform' has a wrong offset!");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, OffsetTranslate) == 0x0002F0, "Member 'AVaultCharacterPlacementHelper_C::OffsetTranslate' has a wrong offset!");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, OffsetRotate) == 0x000308, "Member 'AVaultCharacterPlacementHelper_C::OffsetRotate' has a wrong offset!");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, Athena) == 0x000320, "Member 'AVaultCharacterPlacementHelper_C::Athena' has a wrong offset!");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, OnZoomLevelUpdated) == 0x000328, "Member 'AVaultCharacterPlacementHelper_C::OnZoomLevelUpdated' has a wrong offset!");

}

