#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleInfoIndicator

#include "Basic.hpp"


namespace SDK::Params
{

// Function VehicleInfoIndicator.VehicleInfoIndicator_C.ExecuteUbergraph_VehicleInfoIndicator
// 0x0100 (0x0100 - 0x0000)
struct VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_CustomEvent_PlayerPawn;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_NewVehicle;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OldVehicle;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowVehicleHealthBarOnPlayerHUD_ReturnValue; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortPlayerPawn* PlayerPawn, class AActor* NewVehicle, class AActor* OldVehicle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_2;     // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_3;     // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowVehicleHealthBarOnPlayerHUD_ReturnValue_1; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetControlledPawn_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetVehicleActor_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_4;     // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActorPtr_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator) == 0x000008, "Wrong alignment on VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator");
static_assert(sizeof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator) == 0x000100, "Wrong size on VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, EntryPoint) == 0x000000, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000008, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_GetHealth_ReturnValue) == 0x00001C, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_Less_FloatFloat_ReturnValue) == 0x000020, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_CustomEvent_PlayerPawn) == 0x000028, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_CustomEvent_PlayerPawn' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_CustomEvent_NewVehicle) == 0x000030, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_CustomEvent_NewVehicle' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_CustomEvent_OldVehicle) == 0x000038, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_CustomEvent_OldVehicle' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_AsFort_Vehicle_Interface_1) == 0x000040, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_AsFort_Vehicle_Interface_1' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_ShowVehicleHealthBarOnPlayerHUD_ReturnValue) == 0x000051, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_ShowVehicleHealthBarOnPlayerHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_AsFort_Vehicle_Interface_2) == 0x000060, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_AsFort_Vehicle_Interface_2' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_AsFort_Vehicle_Interface_3) == 0x000078, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_AsFort_Vehicle_Interface_3' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_ShowVehicleHealthBarOnPlayerHUD_ReturnValue_1) == 0x000089, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_ShowVehicleHealthBarOnPlayerHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_GetHealth_ReturnValue_1) == 0x00008C, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_GetHealth_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000090, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_GetMaxHealth_ReturnValue) == 0x000094, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_Not_PreBool_ReturnValue) == 0x000098, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, Temp_float_Variable) == 0x00009C, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, Temp_bool_Variable) == 0x0000A0, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_GetControlledPawn_ReturnValue) == 0x0000A8, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000B0, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_bSuccess_4) == 0x0000B8, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_Select_Default) == 0x0000BC, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_GetVehicleActor_ReturnValue) == 0x0000C0, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_GetVehicleActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000C8, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_AsFort_Vehicle_Interface_4) == 0x0000D0, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_AsFort_Vehicle_Interface_4' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, K2Node_DynamicCast_bSuccess_5) == 0x0000E0, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_GetVehicleActorPtr_ReturnValue) == 0x0000E8, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_GetVehicleActorPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_GetContext_ReturnValue) == 0x0000F0, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x0000F8, "Member 'VehicleInfoIndicator_C_ExecuteUbergraph_VehicleInfoIndicator::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function VehicleInfoIndicator.VehicleInfoIndicator_C.OnPlayerVehicleStateChanged_Event
// 0x0018 (0x0018 - 0x0000)
struct VehicleInfoIndicator_C_OnPlayerVehicleStateChanged_Event final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 NewVehicle;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OldVehicle;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VehicleInfoIndicator_C_OnPlayerVehicleStateChanged_Event) == 0x000008, "Wrong alignment on VehicleInfoIndicator_C_OnPlayerVehicleStateChanged_Event");
static_assert(sizeof(VehicleInfoIndicator_C_OnPlayerVehicleStateChanged_Event) == 0x000018, "Wrong size on VehicleInfoIndicator_C_OnPlayerVehicleStateChanged_Event");
static_assert(offsetof(VehicleInfoIndicator_C_OnPlayerVehicleStateChanged_Event, PlayerPawn) == 0x000000, "Member 'VehicleInfoIndicator_C_OnPlayerVehicleStateChanged_Event::PlayerPawn' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_OnPlayerVehicleStateChanged_Event, NewVehicle) == 0x000008, "Member 'VehicleInfoIndicator_C_OnPlayerVehicleStateChanged_Event::NewVehicle' has a wrong offset!");
static_assert(offsetof(VehicleInfoIndicator_C_OnPlayerVehicleStateChanged_Event, OldVehicle) == 0x000010, "Member 'VehicleInfoIndicator_C_OnPlayerVehicleStateChanged_Event::OldVehicle' has a wrong offset!");

}

