#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehiclePassengerLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct VehiclePassengerLayerAnimBP.VehiclePassengerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x011F (0x0120 - 0x0001)
struct VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_74;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_75;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_76;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_77;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_78;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_79;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_80;                                   // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_81;                                   // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_82;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_83;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_84;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_85;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_86;                                 // 0x003D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_87;                                 // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_88;                                   // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_89;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_90;                                 // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_91;                                 // 0x0052(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_92;                                // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_93;                               // 0x0068(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_94;                                 // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_95;                                 // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0088(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0108(0x0018)()
};
static_assert(alignof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000120, "Wrong size on VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_74) == 0x000004, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_74' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_75) == 0x000008, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_75' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_76) == 0x00000C, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_76' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_77) == 0x000010, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_77' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_78) == 0x000014, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_78' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_79) == 0x000018, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_79' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_80) == 0x000020, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_80' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_81) == 0x000028, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_81' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_82) == 0x000030, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_82' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_83) == 0x000034, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_83' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_84) == 0x000038, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_84' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_85) == 0x00003C, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_85' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_86) == 0x00003D, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_86' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_87) == 0x000040, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_87' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_88) == 0x000048, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_88' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_89) == 0x000050, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_89' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_90) == 0x000051, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_90' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_91) == 0x000052, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_91' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_92) == 0x000058, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_92' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_93) == 0x000068, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_93' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x000080, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x000084, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000088, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000108, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct VehiclePassengerLayerAnimBP.VehiclePassengerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x000014, "Member 'VehiclePassengerLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");

}

