#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VendingMachineMaterialStyle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct VendingMachineMaterialStyle.VendingMachineMaterialStyle
// 0x0050 (0x0050 - 0x0000)
struct FVendingMachineMaterialStyle final
{
public:
	class UTexture*                               Texture_3_114BA7BA459752BB759266A2C7DFAE22;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BGColor1_10_158F7A5F4E78B4BF2649E5A046672ED2;      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BGColor2_11_FE5C46E543BB4CA35915B794884E9D29;      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TransitionTimeline_14_4015721F44F75FDE5A0980929BFDFE02; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CloudandRainbow_17_81D2450D40A82032545405A9A31688DD; // 0x002C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UseBlink_21_03C1119F421027EDD25FECA30481BB78;      // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UseLaugh_23_7F967ACC46F5050FCAEDE8AC8C6B6FC2;      // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             OnTriggeredSound_30_F893DF0D4E55A6E55A6DE9954603D3B1; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FVendingMachineMaterialStyle) == 0x000008, "Wrong alignment on FVendingMachineMaterialStyle");
static_assert(sizeof(FVendingMachineMaterialStyle) == 0x000050, "Wrong size on FVendingMachineMaterialStyle");
static_assert(offsetof(FVendingMachineMaterialStyle, Texture_3_114BA7BA459752BB759266A2C7DFAE22) == 0x000000, "Member 'FVendingMachineMaterialStyle::Texture_3_114BA7BA459752BB759266A2C7DFAE22' has a wrong offset!");
static_assert(offsetof(FVendingMachineMaterialStyle, BGColor1_10_158F7A5F4E78B4BF2649E5A046672ED2) == 0x000008, "Member 'FVendingMachineMaterialStyle::BGColor1_10_158F7A5F4E78B4BF2649E5A046672ED2' has a wrong offset!");
static_assert(offsetof(FVendingMachineMaterialStyle, BGColor2_11_FE5C46E543BB4CA35915B794884E9D29) == 0x000018, "Member 'FVendingMachineMaterialStyle::BGColor2_11_FE5C46E543BB4CA35915B794884E9D29' has a wrong offset!");
static_assert(offsetof(FVendingMachineMaterialStyle, TransitionTimeline_14_4015721F44F75FDE5A0980929BFDFE02) == 0x000028, "Member 'FVendingMachineMaterialStyle::TransitionTimeline_14_4015721F44F75FDE5A0980929BFDFE02' has a wrong offset!");
static_assert(offsetof(FVendingMachineMaterialStyle, CloudandRainbow_17_81D2450D40A82032545405A9A31688DD) == 0x00002C, "Member 'FVendingMachineMaterialStyle::CloudandRainbow_17_81D2450D40A82032545405A9A31688DD' has a wrong offset!");
static_assert(offsetof(FVendingMachineMaterialStyle, UseBlink_21_03C1119F421027EDD25FECA30481BB78) == 0x00003C, "Member 'FVendingMachineMaterialStyle::UseBlink_21_03C1119F421027EDD25FECA30481BB78' has a wrong offset!");
static_assert(offsetof(FVendingMachineMaterialStyle, UseLaugh_23_7F967ACC46F5050FCAEDE8AC8C6B6FC2) == 0x000040, "Member 'FVendingMachineMaterialStyle::UseLaugh_23_7F967ACC46F5050FCAEDE8AC8C6B6FC2' has a wrong offset!");
static_assert(offsetof(FVendingMachineMaterialStyle, OnTriggeredSound_30_F893DF0D4E55A6E55A6DE9954603D3B1) == 0x000048, "Member 'FVendingMachineMaterialStyle::OnTriggeredSound_30_F893DF0D4E55A6E55A6DE9954603D3B1' has a wrong offset!");

}

