#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseBasicGameplay

#include "Basic.hpp"

#include "SolarisInterop_0_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseEngine_0_structs.hpp"
#include "VGameplayRst_0_structs.hpp"
#include "VerseBasicGameplay_structs.hpp"
#include "VerseGameplay_structs.hpp"
#include "VersePlayspace_structs.hpp"
#include "Verse_0_structs.hpp"
#include "Verse_structs.hpp"


namespace SDK
{

// SolarisGeneratedClass VerseBasicGameplay.GameObjects
// 0x0000 (0x0028 - 0x0028)
class UGameObjects final : public UObject
{
public:
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateImmutableModel_L_Nentity__v_M_N_Ksubtype_Lcomponent_R_R(const struct Ftuple_Lentity__v_M_Ksubtype_Lcomponent_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateImmutableModel_L_Nentity__v_R(class Uentity_v* __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateImmutableModel_L_Ngameplay__tag_R(class Ugameplay_tag* __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lcomponent_R_M_Ntransform__v_M_N_Kchar_M_Nstatic__mesh_M_Nmaterial__v_R(const struct Ftuple_L_Ksubtype_Lcomponent_R_Mtransform__v_M_Kchar_Mstatic__mesh_Mmaterial__v_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lcomponent_R_M_Ntransform__v_M_N_Kchar_M_Nstatic__mesh_R(const struct Ftuple_L_Ksubtype_Lcomponent_R_Mtransform__v_M_Kchar_Mstatic__mesh_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lcomponent_R_M_Nvector3_M_Nrotation_M_Nvector3_M_N_Kchar_M_Nstatic__mesh_M_Nmaterial__v_R(const struct Ftuple_L_Ksubtype_Lcomponent_R_Mvector3_Mrotation_Mvector3_M_Kchar_Mstatic__mesh_Mmaterial__v_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateModel_L_Nentity__v_M_N_Ksubtype_Lcomponent_R_R(const struct Ftuple_Lentity__v_M_Ksubtype_Lcomponent_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateModel_L_Nentity__v_R(class Uentity_v* __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateModel_L_Ngameplay__tag_R(class Ugameplay_tag* __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateModel_L_Ntransform__v_M_N_Kchar_M_Nstatic__mesh_M_Nmaterial__v_R(const struct Ftuple_Ltransform__v_M_Kchar_Mstatic__mesh_Mmaterial__v_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateModel_L_Ntransform__v_M_N_Kchar_M_Nstatic__mesh_R(const struct Ftuple_Ltransform__v_M_Kchar_Mstatic__mesh_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateModel_L_Nvector3_M_N_Kchar_M_Nstatic__mesh_M_Nmaterial__v_R(const struct Ftuple_Lvector3_M_Kchar_Mstatic__mesh_Mmaterial__v_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateModel_L_Nvector3_M_Nrotation_M_N_Kchar_M_Nstatic__mesh_M_Nmaterial__v_R(const struct Ftuple_Lvector3_Mrotation_M_Kchar_Mstatic__mesh_Mmaterial__v_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateModel_L_Nvector3_M_Nrotation_M_Nvector3_M_N_Kchar_M_Nstatic__mesh_M_Nmaterial__v_R(const struct Ftuple_Lvector3_Mrotation_Mvector3_M_Kchar_Mstatic__mesh_Mmaterial__v_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateWorldAnchor_L_Nentity__v_R(class Uentity_v* __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateWorldAnchor_L_Ngameplay__tag_R(class Ugameplay_tag* __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateWorldAnchor_L_Nvector3_M_N_Kchar_R(const struct VerseBasicGameplay::Ftuple_Lvector3_M_Kchar_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_N_RCreateWorldAnchor_L_Nvector3_R(const struct Fvector3& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameObjects">();
	}
	static class UGameObjects* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameObjects>();
	}
};
static_assert(alignof(UGameObjects) == 0x000008, "Wrong alignment on UGameObjects");
static_assert(sizeof(UGameObjects) == 0x000028, "Wrong size on UGameObjects");

// SolarisGeneratedClass VerseBasicGameplay.Context_basic_player_manager$_L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded
// 0x0078 (0x01A8 - 0x0130)
class UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded final : public Utask
{
public:
	class Ubasic_player_manager*                  _Self;                                             // 0x0130(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0138(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerHandle                          _RetVal;                                           // 0x0140(0x0028)(Parm, OutParm, ReturnParm)
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> _TEMP_0;                                           // 0x0168(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Uplayer_component*                      _TEMP_1;                                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Utask*                                  _TEMP_2;                                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> _TEMP_3;                                           // 0x0188(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _TEMP_4;                                           // 0x0194(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _TEMP_5;                                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _TEMP_6;                                           // 0x01A0(0x0001)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_basic_player_manager$_L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded">();
	}
	static class UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded>();
	}
};
static_assert(alignof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded) == 0x000008, "Wrong alignment on UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded");
static_assert(sizeof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded) == 0x0001A8, "Wrong size on UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded, _Self) == 0x000130, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded::_Self' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded, __verse_0xB2CDDD72_Argument) == 0x000138, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded, _RetVal) == 0x000140, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded::_RetVal' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded, _TEMP_0) == 0x000168, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded::_TEMP_0' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded, _TEMP_1) == 0x000178, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded::_TEMP_1' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded, _TEMP_2) == 0x000180, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded::_TEMP_2' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded, _TEMP_3) == 0x000188, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded::_TEMP_3' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded, _TEMP_4) == 0x000194, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded::_TEMP_4' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded, _TEMP_5) == 0x000198, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded::_TEMP_5' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded, _TEMP_6) == 0x0001A0, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded::_TEMP_6' has a wrong offset!");

// SolarisGeneratedClass VerseBasicGameplay.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseBasicGameplay::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SolarisGeneratedClass VerseBasicGameplay.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseBasicGameplay::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseBasicGameplay::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseBasicGameplay::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseBasicGameplay::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseBasicGameplay::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseBasicGameplay::U_SolarisSignatureFunctionOuter");

// SolarisGeneratedClass VerseBasicGameplay.basic_player_manager
// 0x0098 (0x00C0 - 0x0028)
class Ubasic_player_manager final : public UObject
{
public:
	class Uplayspace_component*                   __verse_0xBC454097_ThePlayspace;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uplayer_multicast_delegate*             __verse_0xA550C71E_PlayerAddedCallbacks;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uplayer_multicast_delegate*             __verse_0x8089736E_PlayerRemovedCallbacks;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xC76D30F0_WaitingForAdded : 1;            // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_40_1 : 7;                                   // 0x0040(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x72B2A9EB_WaitingForRemoved : 1;          // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x820B209A__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayerCount; // 0x0044(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x8AFFE1BF__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayers; // 0x0050(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TDelegate<void(const struct FPlayerHandle& __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument)> __verse_0x2D357B89__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RSubscribePlayerAdded_L_Nplayer__handle_Tvoid_R; // 0x005C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TDelegate<void(const struct FPlayerHandle& __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument)> __verse_0xE4ACDDD4__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RSubscribePlayerRemoved_L_Nplayer__handle_Tvoid_R; // 0x0068(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument)> __verse_0xB426C68C__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RUnsubscribePlayerAdded_L_Ndelegate__handle_R; // 0x0074(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument)> __verse_0x7F1B3551__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RUnsubscribePlayerRemoved_L_Ndelegate__handle_R; // 0x0080(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xDFF0A593__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded; // 0x008C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x23B5E197__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral; // 0x0098(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x7D05D159__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved; // 0x00A4(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x2811ADC8__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral; // 0x00B0(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void _InitCDO();
	void _InitInstance();
	int64 _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayerCount(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TArray<struct FPlayerHandle> _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayers(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Fdelegate_handle _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RSubscribePlayerAdded_L_Nplayer__handle_Tvoid_R(TDelegate<void(const struct FPlayerHandle& __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument);
	struct Fdelegate_handle _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RSubscribePlayerRemoved_L_Nplayer__handle_Tvoid_R(TDelegate<void(const struct FPlayerHandle& __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RUnsubscribePlayerAdded_L_Ndelegate__handle_R(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RUnsubscribePlayerRemoved_L_Ndelegate__handle_R(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument);
	class Utask* _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"basic_player_manager">();
	}
	static class Ubasic_player_manager* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubasic_player_manager>();
	}
};
static_assert(alignof(Ubasic_player_manager) == 0x000008, "Wrong alignment on Ubasic_player_manager");
static_assert(sizeof(Ubasic_player_manager) == 0x0000C0, "Wrong size on Ubasic_player_manager");
static_assert(offsetof(Ubasic_player_manager, __verse_0xBC454097_ThePlayspace) == 0x000028, "Member 'Ubasic_player_manager::__verse_0xBC454097_ThePlayspace' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0xA550C71E_PlayerAddedCallbacks) == 0x000030, "Member 'Ubasic_player_manager::__verse_0xA550C71E_PlayerAddedCallbacks' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0x8089736E_PlayerRemovedCallbacks) == 0x000038, "Member 'Ubasic_player_manager::__verse_0x8089736E_PlayerRemovedCallbacks' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0x820B209A__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayerCount) == 0x000044, "Member 'Ubasic_player_manager::__verse_0x820B209A__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayerCount' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0x8AFFE1BF__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayers) == 0x000050, "Member 'Ubasic_player_manager::__verse_0x8AFFE1BF__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayers' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0x2D357B89__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RSubscribePlayerAdded_L_Nplayer__handle_Tvoid_R) == 0x00005C, "Member 'Ubasic_player_manager::__verse_0x2D357B89__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RSubscribePlayerAdded_L_Nplayer__handle_Tvoid_R' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0xE4ACDDD4__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RSubscribePlayerRemoved_L_Nplayer__handle_Tvoid_R) == 0x000068, "Member 'Ubasic_player_manager::__verse_0xE4ACDDD4__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RSubscribePlayerRemoved_L_Nplayer__handle_Tvoid_R' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0xB426C68C__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RUnsubscribePlayerAdded_L_Ndelegate__handle_R) == 0x000074, "Member 'Ubasic_player_manager::__verse_0xB426C68C__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RUnsubscribePlayerAdded_L_Ndelegate__handle_R' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0x7F1B3551__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RUnsubscribePlayerRemoved_L_Ndelegate__handle_R) == 0x000080, "Member 'Ubasic_player_manager::__verse_0x7F1B3551__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RUnsubscribePlayerRemoved_L_Ndelegate__handle_R' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0xDFF0A593__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded) == 0x00008C, "Member 'Ubasic_player_manager::__verse_0xDFF0A593__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAdded' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0x23B5E197__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral) == 0x000098, "Member 'Ubasic_player_manager::__verse_0x23B5E197__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0x7D05D159__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved) == 0x0000A4, "Member 'Ubasic_player_manager::__verse_0x7D05D159__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved' has a wrong offset!");
static_assert(offsetof(Ubasic_player_manager, __verse_0x2811ADC8__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral) == 0x0000B0, "Member 'Ubasic_player_manager::__verse_0x2811ADC8__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral' has a wrong offset!");

// SolarisGeneratedClass VerseBasicGameplay.Context_basic_player_manager$_L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral
// 0x0080 (0x01B0 - 0x0130)
class UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral final : public Utask
{
public:
	class Ubasic_player_manager*                  _Self;                                             // 0x0130(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0138(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerHandle                          __verse_0x31268F5C_PlayerAdded_1;                  // 0x0140(0x0028)()
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> _TEMP_0;                                           // 0x0168(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Uplayer_component*                      _TEMP_1;                                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Utask*                                  _TEMP_2;                                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> _TEMP_3;                                           // 0x0188(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _TEMP_4;                                           // 0x0194(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _TEMP_5;                                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _TEMP_6;                                           // 0x01A0(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayerHandle& __verse_0xB2CDDD72_Argument)> _TEMP_7;                                           // 0x01A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_basic_player_manager$_L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral">();
	}
	static class UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral>();
	}
};
static_assert(alignof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral) == 0x000008, "Wrong alignment on UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral");
static_assert(sizeof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral) == 0x0001B0, "Wrong size on UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral, _Self) == 0x000130, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral::_Self' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral, __verse_0xB2CDDD72_Argument) == 0x000138, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral, __verse_0x31268F5C_PlayerAdded_1) == 0x000140, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral::__verse_0x31268F5C_PlayerAdded_1' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral, _TEMP_0) == 0x000168, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral::_TEMP_0' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral, _TEMP_1) == 0x000178, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral::_TEMP_1' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral, _TEMP_2) == 0x000180, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral::_TEMP_2' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral, _TEMP_3) == 0x000188, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral::_TEMP_3' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral, _TEMP_4) == 0x000194, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral::_TEMP_4' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral, _TEMP_5) == 0x000198, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral::_TEMP_5' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral, _TEMP_6) == 0x0001A0, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral::_TEMP_6' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral, _TEMP_7) == 0x0001A4, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerAddedInteral::_TEMP_7' has a wrong offset!");

// SolarisGeneratedClass VerseBasicGameplay.immutable_model
// 0x0090 (0x00B8 - 0x0028)
class Uimmutable_model final : public UObject
{
public:
	class Uentity_v*                              __verse_0xC79F2B5D_InternalObject;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ucollision_component*                   __verse_0x42159B8D_CollisionComp;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ufixed_mesh_component*                  __verse_0xA6788863_MeshComp;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uposition_component*                    __verse_0x325D2C22_PositionComp;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Urotation_component*                    __verse_0xF3C6D2D3_RotationComp;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uscale_component*                       __verse_0x1A7B631A_ScaleComp;                      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xAECA563B__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_2fimmutable__model_N_RGetTransform; // 0x0058(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x8304E9BD__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_2fimmutable__model_N_RIsVisible; // 0x0064(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x03717667__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition; // 0x0070(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xB949A9F7__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector; // 0x007C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x8320D012__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector; // 0x0088(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x9112A39D__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRotation; // 0x0094(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x9DD169CD__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector; // 0x00A0(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x44D08A7C__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale; // 0x00AC(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void _InitCDO();
	void _InitInstance();
	struct Ftransform_v _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_2fimmutable__model_N_RGetTransform(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_2fimmutable__model_N_RIsVisible(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Fvector3 _L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Fvector3 _L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Fvector3 _L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FVerseRotation _L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRotation(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Fvector3 _L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Fvector3 _L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"immutable_model">();
	}
	static class Uimmutable_model* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uimmutable_model>();
	}
};
static_assert(alignof(Uimmutable_model) == 0x000008, "Wrong alignment on Uimmutable_model");
static_assert(sizeof(Uimmutable_model) == 0x0000B8, "Wrong size on Uimmutable_model");
static_assert(offsetof(Uimmutable_model, __verse_0xC79F2B5D_InternalObject) == 0x000028, "Member 'Uimmutable_model::__verse_0xC79F2B5D_InternalObject' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0x42159B8D_CollisionComp) == 0x000030, "Member 'Uimmutable_model::__verse_0x42159B8D_CollisionComp' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0xA6788863_MeshComp) == 0x000038, "Member 'Uimmutable_model::__verse_0xA6788863_MeshComp' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0x325D2C22_PositionComp) == 0x000040, "Member 'Uimmutable_model::__verse_0x325D2C22_PositionComp' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0xF3C6D2D3_RotationComp) == 0x000048, "Member 'Uimmutable_model::__verse_0xF3C6D2D3_RotationComp' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0x1A7B631A_ScaleComp) == 0x000050, "Member 'Uimmutable_model::__verse_0x1A7B631A_ScaleComp' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0xAECA563B__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_2fimmutable__model_N_RGetTransform) == 0x000058, "Member 'Uimmutable_model::__verse_0xAECA563B__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_2fimmutable__model_N_RGetTransform' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0x8304E9BD__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_2fimmutable__model_N_RIsVisible) == 0x000064, "Member 'Uimmutable_model::__verse_0x8304E9BD__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fGameObjects_2fimmutable__model_N_RIsVisible' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0x03717667__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition) == 0x000070, "Member 'Uimmutable_model::__verse_0x03717667__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0xB949A9F7__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector) == 0x00007C, "Member 'Uimmutable_model::__verse_0xB949A9F7__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0x8320D012__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector) == 0x000088, "Member 'Uimmutable_model::__verse_0x8320D012__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0x9112A39D__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRotation) == 0x000094, "Member 'Uimmutable_model::__verse_0x9112A39D__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRotation' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0x9DD169CD__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector) == 0x0000A0, "Member 'Uimmutable_model::__verse_0x9DD169CD__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector' has a wrong offset!");
static_assert(offsetof(Uimmutable_model, __verse_0x44D08A7C__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale) == 0x0000AC, "Member 'Uimmutable_model::__verse_0x44D08A7C__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale' has a wrong offset!");

// SolarisGeneratedClass VerseBasicGameplay.Context_basic_player_manager$_L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved
// 0x0078 (0x01A8 - 0x0130)
class UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved final : public Utask
{
public:
	class Ubasic_player_manager*                  _Self;                                             // 0x0130(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0138(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerHandle                          _RetVal;                                           // 0x0140(0x0028)(Parm, OutParm, ReturnParm)
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> _TEMP_0;                                           // 0x0168(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Uplayer_component*                      _TEMP_1;                                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Utask*                                  _TEMP_2;                                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> _TEMP_3;                                           // 0x0188(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _TEMP_4;                                           // 0x0194(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _TEMP_5;                                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _TEMP_6;                                           // 0x01A0(0x0001)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_basic_player_manager$_L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved">();
	}
	static class UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved>();
	}
};
static_assert(alignof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved) == 0x000008, "Wrong alignment on UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved");
static_assert(sizeof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved) == 0x0001A8, "Wrong size on UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved, _Self) == 0x000130, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved::_Self' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved, __verse_0xB2CDDD72_Argument) == 0x000138, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved, _RetVal) == 0x000140, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved::_RetVal' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved, _TEMP_0) == 0x000168, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved::_TEMP_0' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved, _TEMP_1) == 0x000178, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved::_TEMP_1' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved, _TEMP_2) == 0x000180, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved::_TEMP_2' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved, _TEMP_3) == 0x000188, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved::_TEMP_3' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved, _TEMP_4) == 0x000194, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved::_TEMP_4' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved, _TEMP_5) == 0x000198, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved::_TEMP_5' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved, _TEMP_6) == 0x0001A0, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemoved::_TEMP_6' has a wrong offset!");

// SolarisGeneratedClass VerseBasicGameplay.PlayerManager
// 0x0000 (0x0028 - 0x0028)
class UPlayerManager final : public UObject
{
public:
	static FOptionProperty_ _L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_N_RGetPlayerManagerForLocation_L_Nvector3_R(const struct Fvector3& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerManager">();
	}
	static class UPlayerManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerManager>();
	}
};
static_assert(alignof(UPlayerManager) == 0x000008, "Wrong alignment on UPlayerManager");
static_assert(sizeof(UPlayerManager) == 0x000028, "Wrong size on UPlayerManager");

// SolarisGeneratedClass VerseBasicGameplay.Context_basic_player_manager$_L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral
// 0x0080 (0x01B0 - 0x0130)
class UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral final : public Utask
{
public:
	class Ubasic_player_manager*                  _Self;                                             // 0x0130(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0138(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerHandle                          __verse_0x0B5DEACA_PlayerRemoved_1;                // 0x0140(0x0028)()
	TDelegate<void(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> _TEMP_0;                                           // 0x0168(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Uplayer_component*                      _TEMP_1;                                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Utask*                                  _TEMP_2;                                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> _TEMP_3;                                           // 0x0188(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _TEMP_4;                                           // 0x0194(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _TEMP_5;                                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _TEMP_6;                                           // 0x01A0(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayerHandle& __verse_0xB2CDDD72_Argument)> _TEMP_7;                                           // 0x01A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_basic_player_manager$_L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral">();
	}
	static class UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral>();
	}
};
static_assert(alignof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral) == 0x000008, "Wrong alignment on UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral");
static_assert(sizeof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral) == 0x0001B0, "Wrong size on UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral, _Self) == 0x000130, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral::_Self' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral, __verse_0xB2CDDD72_Argument) == 0x000138, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral, __verse_0x0B5DEACA_PlayerRemoved_1) == 0x000140, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral::__verse_0x0B5DEACA_PlayerRemoved_1' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral, _TEMP_0) == 0x000168, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral::_TEMP_0' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral, _TEMP_1) == 0x000178, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral::_TEMP_1' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral, _TEMP_2) == 0x000180, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral::_TEMP_2' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral, _TEMP_3) == 0x000188, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral::_TEMP_3' has a wrong offset!");
static_assert(offsetof(UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral, _TEMP_4) == 0x000194, "Member 'UContext_basic_player_manager__L_2fUnrealEngine_2ecom_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RWaitForPlayerRemovedInteral::_TEMP_4' has a wrong offset!");
