#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseDevices_0

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK
{

// ScriptStruct VerseDevices.PlaylistOptionScriptValue
// 0x0008 (0x0050 - 0x0048)
struct FPlaylistOptionScriptValue final : public FPlaylistOptionValue
{
public:
	TSubclassOf<class UVerseDeviceScript>         Value;                                             // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlaylistOptionScriptValue) == 0x000008, "Wrong alignment on FPlaylistOptionScriptValue");
static_assert(sizeof(FPlaylistOptionScriptValue) == 0x000050, "Wrong size on FPlaylistOptionScriptValue");
static_assert(offsetof(FPlaylistOptionScriptValue, Value) == 0x000048, "Member 'FPlaylistOptionScriptValue::Value' has a wrong offset!");

// ScriptStruct VerseDevices.VerseDeviceFunctionPayload
// 0x0008 (0x0008 - 0x0000)
struct FVerseDeviceFunctionPayload final
{
public:
	class AController*                            Instigator;                                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVerseDeviceFunctionPayload) == 0x000008, "Wrong alignment on FVerseDeviceFunctionPayload");
static_assert(sizeof(FVerseDeviceFunctionPayload) == 0x000008, "Wrong size on FVerseDeviceFunctionPayload");
static_assert(offsetof(FVerseDeviceFunctionPayload, Instigator) == 0x000000, "Member 'FVerseDeviceFunctionPayload::Instigator' has a wrong offset!");

}

