#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteDynamicUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function VerseFortniteDynamicUI.VerseFortniteDynamicUIDirector.HandleWidgetCreatedAddGhost
// 0x0018 (0x0018 - 0x0000)
struct VerseFortniteDynamicUIDirector_HandleWidgetCreatedAddGhost final
{
public:
	class FString                                 WidgetID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            WidgetPtr;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseFortniteDynamicUIDirector_HandleWidgetCreatedAddGhost) == 0x000008, "Wrong alignment on VerseFortniteDynamicUIDirector_HandleWidgetCreatedAddGhost");
static_assert(sizeof(VerseFortniteDynamicUIDirector_HandleWidgetCreatedAddGhost) == 0x000018, "Wrong size on VerseFortniteDynamicUIDirector_HandleWidgetCreatedAddGhost");
static_assert(offsetof(VerseFortniteDynamicUIDirector_HandleWidgetCreatedAddGhost, WidgetID) == 0x000000, "Member 'VerseFortniteDynamicUIDirector_HandleWidgetCreatedAddGhost::WidgetID' has a wrong offset!");
static_assert(offsetof(VerseFortniteDynamicUIDirector_HandleWidgetCreatedAddGhost, WidgetPtr) == 0x000010, "Member 'VerseFortniteDynamicUIDirector_HandleWidgetCreatedAddGhost::WidgetPtr' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseFortniteDynamicUIDirector.HandleWidgetDestroyedRemoveGhost
// 0x0018 (0x0018 - 0x0000)
struct VerseFortniteDynamicUIDirector_HandleWidgetDestroyedRemoveGhost final
{
public:
	class FString                                 WidgetID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            WidgetPtr;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseFortniteDynamicUIDirector_HandleWidgetDestroyedRemoveGhost) == 0x000008, "Wrong alignment on VerseFortniteDynamicUIDirector_HandleWidgetDestroyedRemoveGhost");
static_assert(sizeof(VerseFortniteDynamicUIDirector_HandleWidgetDestroyedRemoveGhost) == 0x000018, "Wrong size on VerseFortniteDynamicUIDirector_HandleWidgetDestroyedRemoveGhost");
static_assert(offsetof(VerseFortniteDynamicUIDirector_HandleWidgetDestroyedRemoveGhost, WidgetID) == 0x000000, "Member 'VerseFortniteDynamicUIDirector_HandleWidgetDestroyedRemoveGhost::WidgetID' has a wrong offset!");
static_assert(offsetof(VerseFortniteDynamicUIDirector_HandleWidgetDestroyedRemoveGhost, WidgetPtr) == 0x000010, "Member 'VerseFortniteDynamicUIDirector_HandleWidgetDestroyedRemoveGhost::WidgetPtr' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseFortniteDynamicUIDirector.LoadSceneCatalog
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteDynamicUIDirector_LoadSceneCatalog final
{
public:
	class FString                                 InSceneCatalogName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseFortniteDynamicUIDirector_LoadSceneCatalog) == 0x000008, "Wrong alignment on VerseFortniteDynamicUIDirector_LoadSceneCatalog");
static_assert(sizeof(VerseFortniteDynamicUIDirector_LoadSceneCatalog) == 0x000010, "Wrong size on VerseFortniteDynamicUIDirector_LoadSceneCatalog");
static_assert(offsetof(VerseFortniteDynamicUIDirector_LoadSceneCatalog, InSceneCatalogName) == 0x000000, "Member 'VerseFortniteDynamicUIDirector_LoadSceneCatalog::InSceneCatalogName' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseFortniteDynamicUIDirector.LoadWidgetCatalog
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteDynamicUIDirector_LoadWidgetCatalog final
{
public:
	class FString                                 InWidgetCatalogName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseFortniteDynamicUIDirector_LoadWidgetCatalog) == 0x000008, "Wrong alignment on VerseFortniteDynamicUIDirector_LoadWidgetCatalog");
static_assert(sizeof(VerseFortniteDynamicUIDirector_LoadWidgetCatalog) == 0x000010, "Wrong size on VerseFortniteDynamicUIDirector_LoadWidgetCatalog");
static_assert(offsetof(VerseFortniteDynamicUIDirector_LoadWidgetCatalog, InWidgetCatalogName) == 0x000000, "Member 'VerseFortniteDynamicUIDirector_LoadWidgetCatalog::InWidgetCatalogName' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseDHUDGhostWidgetBase.SetDesiredSize
// 0x0010 (0x0010 - 0x0000)
struct VerseDHUDGhostWidgetBase_SetDesiredSize final
{
public:
	struct FVector2D                              DesiredSize;                                       // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseDHUDGhostWidgetBase_SetDesiredSize) == 0x000008, "Wrong alignment on VerseDHUDGhostWidgetBase_SetDesiredSize");
static_assert(sizeof(VerseDHUDGhostWidgetBase_SetDesiredSize) == 0x000010, "Wrong size on VerseDHUDGhostWidgetBase_SetDesiredSize");
static_assert(offsetof(VerseDHUDGhostWidgetBase_SetDesiredSize, DesiredSize) == 0x000000, "Member 'VerseDHUDGhostWidgetBase_SetDesiredSize::DesiredSize' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseFortniteDynamicUISceneCatalog.AppendToBaseCatalog
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteDynamicUISceneCatalog_AppendToBaseCatalog final
{
public:
	class UVerseFortniteDynamicUISceneCatalog*    NewCatalog;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseFortniteDynamicUISceneCatalog_AppendToBaseCatalog) == 0x000008, "Wrong alignment on VerseFortniteDynamicUISceneCatalog_AppendToBaseCatalog");
static_assert(sizeof(VerseFortniteDynamicUISceneCatalog_AppendToBaseCatalog) == 0x000008, "Wrong size on VerseFortniteDynamicUISceneCatalog_AppendToBaseCatalog");
static_assert(offsetof(VerseFortniteDynamicUISceneCatalog_AppendToBaseCatalog, NewCatalog) == 0x000000, "Member 'VerseFortniteDynamicUISceneCatalog_AppendToBaseCatalog::NewCatalog' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseDHUDPanelBase.CallServerWithMessage
// 0x0020 (0x0020 - 0x0000)
struct VerseDHUDPanelBase_CallServerWithMessage final
{
public:
	class FString                                 MessageID;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MessageData;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseDHUDPanelBase_CallServerWithMessage) == 0x000008, "Wrong alignment on VerseDHUDPanelBase_CallServerWithMessage");
static_assert(sizeof(VerseDHUDPanelBase_CallServerWithMessage) == 0x000020, "Wrong size on VerseDHUDPanelBase_CallServerWithMessage");
static_assert(offsetof(VerseDHUDPanelBase_CallServerWithMessage, MessageID) == 0x000000, "Member 'VerseDHUDPanelBase_CallServerWithMessage::MessageID' has a wrong offset!");
static_assert(offsetof(VerseDHUDPanelBase_CallServerWithMessage, MessageData) == 0x000010, "Member 'VerseDHUDPanelBase_CallServerWithMessage::MessageData' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseDHUDPanelBase.DoesDataStoreValueExist
// 0x0008 (0x0008 - 0x0000)
struct VerseDHUDPanelBase_DoesDataStoreValueExist final
{
public:
	class FName                                   VarName;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VerseDHUDPanelBase_DoesDataStoreValueExist) == 0x000004, "Wrong alignment on VerseDHUDPanelBase_DoesDataStoreValueExist");
static_assert(sizeof(VerseDHUDPanelBase_DoesDataStoreValueExist) == 0x000008, "Wrong size on VerseDHUDPanelBase_DoesDataStoreValueExist");
static_assert(offsetof(VerseDHUDPanelBase_DoesDataStoreValueExist, VarName) == 0x000000, "Member 'VerseDHUDPanelBase_DoesDataStoreValueExist::VarName' has a wrong offset!");
static_assert(offsetof(VerseDHUDPanelBase_DoesDataStoreValueExist, ReturnValue) == 0x000004, "Member 'VerseDHUDPanelBase_DoesDataStoreValueExist::ReturnValue' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseDHUDPanelBase.GetDataStoreValue
// 0x0018 (0x0018 - 0x0000)
struct VerseDHUDPanelBase_GetDataStoreValue final
{
public:
	class FName                                   VarName;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseDHUDPanelBase_GetDataStoreValue) == 0x000008, "Wrong alignment on VerseDHUDPanelBase_GetDataStoreValue");
static_assert(sizeof(VerseDHUDPanelBase_GetDataStoreValue) == 0x000018, "Wrong size on VerseDHUDPanelBase_GetDataStoreValue");
static_assert(offsetof(VerseDHUDPanelBase_GetDataStoreValue, VarName) == 0x000000, "Member 'VerseDHUDPanelBase_GetDataStoreValue::VarName' has a wrong offset!");
static_assert(offsetof(VerseDHUDPanelBase_GetDataStoreValue, ReturnValue) == 0x000008, "Member 'VerseDHUDPanelBase_GetDataStoreValue::ReturnValue' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseFortniteDynamicUIWidgetCatalog.AppendToBaseWidgetCatalog
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteDynamicUIWidgetCatalog_AppendToBaseWidgetCatalog final
{
public:
	class UVerseFortniteDynamicUIWidgetCatalog*   NewWidgetCatalog;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseFortniteDynamicUIWidgetCatalog_AppendToBaseWidgetCatalog) == 0x000008, "Wrong alignment on VerseFortniteDynamicUIWidgetCatalog_AppendToBaseWidgetCatalog");
static_assert(sizeof(VerseFortniteDynamicUIWidgetCatalog_AppendToBaseWidgetCatalog) == 0x000008, "Wrong size on VerseFortniteDynamicUIWidgetCatalog_AppendToBaseWidgetCatalog");
static_assert(offsetof(VerseFortniteDynamicUIWidgetCatalog_AppendToBaseWidgetCatalog, NewWidgetCatalog) == 0x000000, "Member 'VerseFortniteDynamicUIWidgetCatalog_AppendToBaseWidgetCatalog::NewWidgetCatalog' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseDHUDWidgetBase.CallServerWithMessage
// 0x0020 (0x0020 - 0x0000)
struct VerseDHUDWidgetBase_CallServerWithMessage final
{
public:
	class FString                                 MessageID;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MessageData;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseDHUDWidgetBase_CallServerWithMessage) == 0x000008, "Wrong alignment on VerseDHUDWidgetBase_CallServerWithMessage");
static_assert(sizeof(VerseDHUDWidgetBase_CallServerWithMessage) == 0x000020, "Wrong size on VerseDHUDWidgetBase_CallServerWithMessage");
static_assert(offsetof(VerseDHUDWidgetBase_CallServerWithMessage, MessageID) == 0x000000, "Member 'VerseDHUDWidgetBase_CallServerWithMessage::MessageID' has a wrong offset!");
static_assert(offsetof(VerseDHUDWidgetBase_CallServerWithMessage, MessageData) == 0x000010, "Member 'VerseDHUDWidgetBase_CallServerWithMessage::MessageData' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseDHUDWidgetBase.DoesDataStoreValueExist
// 0x0008 (0x0008 - 0x0000)
struct VerseDHUDWidgetBase_DoesDataStoreValueExist final
{
public:
	class FName                                   VarName;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VerseDHUDWidgetBase_DoesDataStoreValueExist) == 0x000004, "Wrong alignment on VerseDHUDWidgetBase_DoesDataStoreValueExist");
static_assert(sizeof(VerseDHUDWidgetBase_DoesDataStoreValueExist) == 0x000008, "Wrong size on VerseDHUDWidgetBase_DoesDataStoreValueExist");
static_assert(offsetof(VerseDHUDWidgetBase_DoesDataStoreValueExist, VarName) == 0x000000, "Member 'VerseDHUDWidgetBase_DoesDataStoreValueExist::VarName' has a wrong offset!");
static_assert(offsetof(VerseDHUDWidgetBase_DoesDataStoreValueExist, ReturnValue) == 0x000004, "Member 'VerseDHUDWidgetBase_DoesDataStoreValueExist::ReturnValue' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseDHUDWidgetBase.GetDataStoreValue
// 0x0018 (0x0018 - 0x0000)
struct VerseDHUDWidgetBase_GetDataStoreValue final
{
public:
	class FName                                   VarName;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseDHUDWidgetBase_GetDataStoreValue) == 0x000008, "Wrong alignment on VerseDHUDWidgetBase_GetDataStoreValue");
static_assert(sizeof(VerseDHUDWidgetBase_GetDataStoreValue) == 0x000018, "Wrong size on VerseDHUDWidgetBase_GetDataStoreValue");
static_assert(offsetof(VerseDHUDWidgetBase_GetDataStoreValue, VarName) == 0x000000, "Member 'VerseDHUDWidgetBase_GetDataStoreValue::VarName' has a wrong offset!");
static_assert(offsetof(VerseDHUDWidgetBase_GetDataStoreValue, ReturnValue) == 0x000008, "Member 'VerseDHUDWidgetBase_GetDataStoreValue::ReturnValue' has a wrong offset!");

// Function VerseFortniteDynamicUI.VerseDHUDWidgetDatastoreInterface.ReceiveDataStoreValue
// 0x0018 (0x0018 - 0x0000)
struct VerseDHUDWidgetDatastoreInterface_ReceiveDataStoreValue final
{
public:
	class FName                                   VarName;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseDHUDWidgetDatastoreInterface_ReceiveDataStoreValue) == 0x000008, "Wrong alignment on VerseDHUDWidgetDatastoreInterface_ReceiveDataStoreValue");
static_assert(sizeof(VerseDHUDWidgetDatastoreInterface_ReceiveDataStoreValue) == 0x000018, "Wrong size on VerseDHUDWidgetDatastoreInterface_ReceiveDataStoreValue");
static_assert(offsetof(VerseDHUDWidgetDatastoreInterface_ReceiveDataStoreValue, VarName) == 0x000000, "Member 'VerseDHUDWidgetDatastoreInterface_ReceiveDataStoreValue::VarName' has a wrong offset!");
static_assert(offsetof(VerseDHUDWidgetDatastoreInterface_ReceiveDataStoreValue, Value) == 0x000008, "Member 'VerseDHUDWidgetDatastoreInterface_ReceiveDataStoreValue::Value' has a wrong offset!");

}

