#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseGameplay

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class VerseGameplay.VerseGameplayTagBase
// 0x0000 (0x0028 - 0x0028)
class UVerseGameplayTagBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseGameplayTagBase">();
	}
	static class UVerseGameplayTagBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseGameplayTagBase>();
	}
};
static_assert(alignof(UVerseGameplayTagBase) == 0x000008, "Wrong alignment on UVerseGameplayTagBase");
static_assert(sizeof(UVerseGameplayTagBase) == 0x000028, "Wrong size on UVerseGameplayTagBase");

// Class VerseGameplay.VerseGameplayTagContainerBase
// 0x0010 (0x0038 - 0x0028)
class UVerseGameplayTagContainerBase : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseGameplayTagContainerBase">();
	}
	static class UVerseGameplayTagContainerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseGameplayTagContainerBase>();
	}
};
static_assert(alignof(UVerseGameplayTagContainerBase) == 0x000008, "Wrong alignment on UVerseGameplayTagContainerBase");
static_assert(sizeof(UVerseGameplayTagContainerBase) == 0x000038, "Wrong size on UVerseGameplayTagContainerBase");

// Class VerseGameplay.TagRegistrationHandler
// 0x0040 (0x0068 - 0x0028)
class UTagRegistrationHandler final : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TagRegistrationHandler">();
	}
	static class UTagRegistrationHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTagRegistrationHandler>();
	}
};
static_assert(alignof(UTagRegistrationHandler) == 0x000008, "Wrong alignment on UTagRegistrationHandler");
static_assert(sizeof(UTagRegistrationHandler) == 0x000068, "Wrong size on UTagRegistrationHandler");

// Class VerseGameplay.VerseGameplayTagAssetInterface
// 0x0000 (0x0028 - 0x0028)
class IVerseGameplayTagAssetInterface final : public IInterface
{
public:
	void GetOwnedGameplayTags(struct FVerseGameplayTagContainer* TagContainer) const;
	bool HasAllMatchingGameplayTags(const struct FVerseGameplayTagContainer& TagContainer) const;
	bool HasAnyMatchingGameplayTags(const struct FVerseGameplayTagContainer& TagContainer) const;
	bool HasMatchingGameplayTag(const struct FVerseGameplayTag& TagToCheck) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseGameplayTagAssetInterface">();
	}
	static class IVerseGameplayTagAssetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IVerseGameplayTagAssetInterface>();
	}
};
static_assert(alignof(IVerseGameplayTagAssetInterface) == 0x000008, "Wrong alignment on IVerseGameplayTagAssetInterface");
static_assert(sizeof(IVerseGameplayTagAssetInterface) == 0x000028, "Wrong size on IVerseGameplayTagAssetInterface");

}

