#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseGameplay

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct VerseGameplay.PlayerHandle
// 0x0028 (0x0028 - 0x0000)
struct FPlayerHandle final
{
public:
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0000(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlayerHandle) == 0x000008, "Wrong alignment on FPlayerHandle");
static_assert(sizeof(FPlayerHandle) == 0x000028, "Wrong size on FPlayerHandle");
static_assert(offsetof(FPlayerHandle, PlayerId) == 0x000000, "Member 'FPlayerHandle::PlayerId' has a wrong offset!");

// ScriptStruct VerseGameplay.VerseGameplayTag
// 0x0008 (0x0008 - 0x0000)
struct FVerseGameplayTag final
{
public:
	TSubclassOf<class UVerseGameplayTagBase>      InternalTag;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FVerseGameplayTag) == 0x000008, "Wrong alignment on FVerseGameplayTag");
static_assert(sizeof(FVerseGameplayTag) == 0x000008, "Wrong size on FVerseGameplayTag");
static_assert(offsetof(FVerseGameplayTag, InternalTag) == 0x000000, "Member 'FVerseGameplayTag::InternalTag' has a wrong offset!");

// ScriptStruct VerseGameplay.VerseGameplayTagContainer
// 0x0010 (0x0010 - 0x0000)
struct FVerseGameplayTagContainer final
{
public:
	TArray<struct FVerseGameplayTag>              InternalTags;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FVerseGameplayTagContainer) == 0x000008, "Wrong alignment on FVerseGameplayTagContainer");
static_assert(sizeof(FVerseGameplayTagContainer) == 0x000010, "Wrong size on FVerseGameplayTagContainer");
static_assert(offsetof(FVerseGameplayTagContainer, InternalTags) == 0x000000, "Member 'FVerseGameplayTagContainer::InternalTags' has a wrong offset!");

}

