#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Verse_0

#include "Basic.hpp"

#include "SolarisInterop_structs.hpp"
#include "Verse_0_structs.hpp"
#include "Verse_structs.hpp"


namespace SDK::Params
{

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2_M_Nfloat_R
// 0x0028 (0x0028 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector2_Mfloat_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct Fvector2                               RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2_M_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2_M_Nfloat_R) == 0x000028, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2_M_Nfloat_R, RetVal) == 0x000018, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2i_M_Nint_R
// 0x0028 (0x0028 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2i_M_Nint_R final
{
public:
	struct Ftuple_Lvector2i_Mint_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct Fvector2i                              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2i_M_Nint_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2i_M_Nint_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2i_M_Nint_R) == 0x000028, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2i_M_Nint_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2i_M_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2i_M_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2i_M_Nint_R, RetVal) == 0x000018, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector2i_M_Nint_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector3_M_Nfloat_R
// 0x0038 (0x0038 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector3_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector3_Mfloat_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct Fvector3                               RetVal;                                            // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector3_M_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector3_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector3_M_Nfloat_R) == 0x000038, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector3_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector3_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector3_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector3_M_Nfloat_R, RetVal) == 0x000020, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector3_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector4__v_M_Nfloat_R
// 0x0058 (0x0058 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector4__v_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector4__v_Mfloat_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct Fvector4_v                             RetVal;                                            // 0x0030(0x0028)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector4__v_M_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector4__v_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector4__v_M_Nfloat_R) == 0x000058, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector4__v_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector4__v_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector4__v_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector4__v_M_Nfloat_R, RetVal) == 0x000030, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RAddScalar_L_Nvector4__v_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyPitch_L_Nrotation_M_Nfloat_R
// 0x0050 (0x0050 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyPitch_L_Nrotation_M_Nfloat_R final
{
public:
	struct Ftuple_Lrotation_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyPitch_L_Nrotation_M_Nfloat_R) == 0x000010, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyPitch_L_Nrotation_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyPitch_L_Nrotation_M_Nfloat_R) == 0x000050, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyPitch_L_Nrotation_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyPitch_L_Nrotation_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyPitch_L_Nrotation_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyPitch_L_Nrotation_M_Nfloat_R, RetVal) == 0x000030, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyPitch_L_Nrotation_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyRoll_L_Nrotation_M_Nfloat_R
// 0x0050 (0x0050 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyRoll_L_Nrotation_M_Nfloat_R final
{
public:
	struct Ftuple_Lrotation_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyRoll_L_Nrotation_M_Nfloat_R) == 0x000010, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyRoll_L_Nrotation_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyRoll_L_Nrotation_M_Nfloat_R) == 0x000050, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyRoll_L_Nrotation_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyRoll_L_Nrotation_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyRoll_L_Nrotation_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyRoll_L_Nrotation_M_Nfloat_R, RetVal) == 0x000030, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyRoll_L_Nrotation_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationX_L_Nrotation_M_Nfloat_R
// 0x0050 (0x0050 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationX_L_Nrotation_M_Nfloat_R final
{
public:
	struct Ftuple_Lrotation_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationX_L_Nrotation_M_Nfloat_R) == 0x000010, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationX_L_Nrotation_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationX_L_Nrotation_M_Nfloat_R) == 0x000050, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationX_L_Nrotation_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationX_L_Nrotation_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationX_L_Nrotation_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationX_L_Nrotation_M_Nfloat_R, RetVal) == 0x000030, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationX_L_Nrotation_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationY_L_Nrotation_M_Nfloat_R
// 0x0050 (0x0050 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationY_L_Nrotation_M_Nfloat_R final
{
public:
	struct Ftuple_Lrotation_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationY_L_Nrotation_M_Nfloat_R) == 0x000010, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationY_L_Nrotation_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationY_L_Nrotation_M_Nfloat_R) == 0x000050, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationY_L_Nrotation_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationY_L_Nrotation_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationY_L_Nrotation_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationY_L_Nrotation_M_Nfloat_R, RetVal) == 0x000030, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationY_L_Nrotation_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationZ_L_Nrotation_M_Nfloat_R
// 0x0050 (0x0050 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationZ_L_Nrotation_M_Nfloat_R final
{
public:
	struct Ftuple_Lrotation_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationZ_L_Nrotation_M_Nfloat_R) == 0x000010, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationZ_L_Nrotation_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationZ_L_Nrotation_M_Nfloat_R) == 0x000050, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationZ_L_Nrotation_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationZ_L_Nrotation_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationZ_L_Nrotation_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationZ_L_Nrotation_M_Nfloat_R, RetVal) == 0x000030, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyWorldRotationZ_L_Nrotation_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyYaw_L_Nrotation_M_Nfloat_R
// 0x0050 (0x0050 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyYaw_L_Nrotation_M_Nfloat_R final
{
public:
	struct Ftuple_Lrotation_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyYaw_L_Nrotation_M_Nfloat_R) == 0x000010, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyYaw_L_Nrotation_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyYaw_L_Nrotation_M_Nfloat_R) == 0x000050, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyYaw_L_Nrotation_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyYaw_L_Nrotation_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyYaw_L_Nrotation_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyYaw_L_Nrotation_M_Nfloat_R, RetVal) == 0x000030, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RApplyYaw_L_Nrotation_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RArcCos_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcCos_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcCos_L_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcCos_L_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcCos_L_Nfloat_R) == 0x000010, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcCos_L_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcCos_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcCos_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcCos_L_Nfloat_R, RetVal) == 0x000008, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcCos_L_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RArCosh_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArCosh_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArCosh_L_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArCosh_L_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArCosh_L_Nfloat_R) == 0x000010, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArCosh_L_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArCosh_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArCosh_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArCosh_L_Nfloat_R, RetVal) == 0x000008, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArCosh_L_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RArcSin_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcSin_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcSin_L_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcSin_L_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcSin_L_Nfloat_R) == 0x000010, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcSin_L_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcSin_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcSin_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcSin_L_Nfloat_R, RetVal) == 0x000008, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcSin_L_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_M_Nfloat_R
// 0x0018 (0x0018 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_M_Nfloat_R final
{
public:
	struct Verse_0::Ftuple_Lfloat_Mfloat_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_M_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_M_Nfloat_R) == 0x000018, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_M_Nfloat_R, RetVal) == 0x000010, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_R) == 0x000010, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_R, RetVal) == 0x000008, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArcTan_L_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RArSinh_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArSinh_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArSinh_L_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArSinh_L_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArSinh_L_Nfloat_R) == 0x000010, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArSinh_L_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArSinh_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArSinh_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArSinh_L_Nfloat_R, RetVal) == 0x000008, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArSinh_L_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RArTanh_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArTanh_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArTanh_L_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArTanh_L_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArTanh_L_Nfloat_R) == 0x000010, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArTanh_L_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArTanh_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArTanh_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArTanh_L_Nfloat_R, RetVal) == 0x000008, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RArTanh_L_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nfloat_R) == 0x000010, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nfloat_R, RetVal) == 0x000008, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nvector2r_R
// 0x0030 (0x0030 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nvector2r_R final
{
public:
	struct Fvector2r                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct Fvector2i                              RetVal;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nvector2r_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nvector2r_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nvector2r_R) == 0x000030, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nvector2r_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nvector2r_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nvector2r_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nvector2r_R, RetVal) == 0x000020, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCeil_L_Nvector2r_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R
// 0x0020 (0x0020 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R final
{
public:
	struct Ftuple_Lfloat_Mfloat_Mfloat_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000020, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R, RetVal) == 0x000018, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nint_M_Nint_M_Nint_R
// 0x0020 (0x0020 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nint_M_Nint_M_Nint_R final
{
public:
	struct Verse_0::Ftuple_Lint_Mint_Mint_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nint_M_Nint_M_Nint_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nint_M_Nint_M_Nint_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nint_M_Nint_M_Nint_R) == 0x000020, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nint_M_Nint_M_Nint_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nint_M_Nint_M_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nint_M_Nint_M_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nint_M_Nint_M_Nint_R, RetVal) == 0x000018, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RClamp_L_Nint_M_Nint_M_Nint_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCos_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCos_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCos_L_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCos_L_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCos_L_Nfloat_R) == 0x000010, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCos_L_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCos_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCos_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCos_L_Nfloat_R, RetVal) == 0x000008, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCos_L_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCosh_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCosh_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCosh_L_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCosh_L_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCosh_L_Nfloat_R) == 0x000010, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCosh_L_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCosh_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCosh_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCosh_L_Nfloat_R, RetVal) == 0x000008, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCosh_L_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromColorTemperature_L_Nfloat_R
// 0x0030 (0x0030 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromColorTemperature_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0021)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromColorTemperature_L_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromColorTemperature_L_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromColorTemperature_L_Nfloat_R) == 0x000030, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromColorTemperature_L_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromColorTemperature_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromColorTemperature_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromColorTemperature_L_Nfloat_R, RetVal) == 0x000008, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromColorTemperature_L_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHex_L_N_Kchar_R
// 0x0030 (0x0030 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHex_L_N_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	struct Fcolor_v                               RetVal;                                            // 0x0010(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHex_L_N_Kchar_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHex_L_N_Kchar_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHex_L_N_Kchar_R) == 0x000030, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHex_L_N_Kchar_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHex_L_N_Kchar_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHex_L_N_Kchar_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHex_L_N_Kchar_R, RetVal) == 0x000010, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHex_L_N_Kchar_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R
// 0x0040 (0x0040 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R final
{
public:
	struct Ftuple_Lfloat_Mfloat_Mfloat_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0018(0x0021)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000040, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R, RetVal) == 0x000018, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromLinear_L_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R
// 0x0040 (0x0040 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromLinear_L_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R final
{
public:
	struct Ftuple_Lfloat_Mfloat_Mfloat_Mfloat_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct Fcolor_v                               RetVal;                                            // 0x0020(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromLinear_L_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromLinear_L_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromLinear_L_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000040, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromLinear_L_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromLinear_L_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromLinear_L_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromLinear_L_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R, RetVal) == 0x000020, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromLinear_L_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromNamed_L_Nnamed__color_R
// 0x0028 (0x0028 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromNamed_L_Nnamed__color_R final
{
public:
	Enamed_color                                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct Fcolor_v                               RetVal;                                            // 0x0008(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromNamed_L_Nnamed__color_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromNamed_L_Nnamed__color_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromNamed_L_Nnamed__color_R) == 0x000028, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromNamed_L_Nnamed__color_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromNamed_L_Nnamed__color_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromNamed_L_Nnamed__color_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromNamed_L_Nnamed__color_R, RetVal) == 0x000008, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromNamed_L_Nnamed__color_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromValues_L_Nint_M_Nint_M_Nint_M_Nint_R
// 0x0040 (0x0040 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromValues_L_Nint_M_Nint_M_Nint_M_Nint_R final
{
public:
	struct Ftuple_Lint_Mint_Mint_Mint_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct Fcolor_v                               RetVal;                                            // 0x0020(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromValues_L_Nint_M_Nint_M_Nint_M_Nint_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromValues_L_Nint_M_Nint_M_Nint_M_Nint_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromValues_L_Nint_M_Nint_M_Nint_M_Nint_R) == 0x000040, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromValues_L_Nint_M_Nint_M_Nint_M_Nint_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromValues_L_Nint_M_Nint_M_Nint_M_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromValues_L_Nint_M_Nint_M_Nint_M_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromValues_L_Nint_M_Nint_M_Nint_M_Nint_R, RetVal) == 0x000020, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateFromValues_L_Nint_M_Nint_M_Nint_M_Nint_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_M_Nvector3_R
// 0x0078 (0x0078 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_M_Nvector3_R final
{
public:
	struct Ftuple_Lvector3_Mvector3_Mvector3_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0048)(Parm, HasGetValueTypeHash)
	struct Fplane4                                RetVal;                                            // 0x0048(0x0030)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_M_Nvector3_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_M_Nvector3_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_M_Nvector3_R) == 0x000078, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_M_Nvector3_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_M_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_M_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_M_Nvector3_R, RetVal) == 0x000048, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_M_Nvector3_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_R
// 0x0060 (0x0060 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_R final
{
public:
	struct Verse_0::Ftuple_Lvector3_Mvector3_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct Fplane4                                RetVal;                                            // 0x0030(0x0030)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_R) == 0x000060, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_R, RetVal) == 0x000030, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreatePlane4Native_L_Nvector3_M_Nvector3_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R
// 0x0040 (0x0040 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R final
{
public:
	struct Ftuple_Lfloat_Mfloat_Mfloat_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         RetVal;                                            // 0x0020(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000010, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000040, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R, RetVal) == 0x000020, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nrotation_M_Nrotation_R
// 0x0060 (0x0060 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nrotation_M_Nrotation_R final
{
public:
	struct Ftuple_Lrotation_Mrotation_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0040)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0040(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nrotation_M_Nrotation_R) == 0x000010, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nrotation_M_Nrotation_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nrotation_M_Nrotation_R) == 0x000060, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nrotation_M_Nrotation_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nrotation_M_Nrotation_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nrotation_M_Nrotation_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nrotation_M_Nrotation_R, RetVal) == 0x000040, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nrotation_M_Nrotation_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nvector3_M_Nvector3_R
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x10) Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nvector3_M_Nvector3_R final
{
public:
	struct Verse_0::Ftuple_Lvector3_Mvector3_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0030(0x0021)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nvector3_M_Nvector3_R) == 0x000010, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nvector3_M_Nvector3_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nvector3_M_Nvector3_R) == 0x000060, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nvector3_M_Nvector3_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nvector3_M_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nvector3_M_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nvector3_M_Nvector3_R, RetVal) == 0x000030, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateShortestRotationBetween_L_Nvector3_M_Nvector3_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateWithAlpha_L_Ncolor__v_M_Nfloat_R
// 0x0048 (0x0048 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateWithAlpha_L_Ncolor__v_M_Nfloat_R final
{
public:
	struct Ftuple_Lcolor__v_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
	struct Fcolor_v                               RetVal;                                            // 0x0028(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateWithAlpha_L_Ncolor__v_M_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateWithAlpha_L_Ncolor__v_M_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateWithAlpha_L_Ncolor__v_M_Nfloat_R) == 0x000048, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateWithAlpha_L_Ncolor__v_M_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateWithAlpha_L_Ncolor__v_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateWithAlpha_L_Ncolor__v_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateWithAlpha_L_Ncolor__v_M_Nfloat_R, RetVal) == 0x000028, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCreateWithAlpha_L_Ncolor__v_M_Nfloat_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2_M_Nvector2_R
// 0x0028 (0x0028 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2_M_Nvector2_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2_M_Nvector2_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2_M_Nvector2_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2_M_Nvector2_R) == 0x000028, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2_M_Nvector2_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2_M_Nvector2_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2_M_Nvector2_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2_M_Nvector2_R, RetVal) == 0x000020, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2_M_Nvector2_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2i_M_Nvector2i_R
// 0x0028 (0x0028 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2i_M_Nvector2i_R final
{
public:
	struct Ftuple_Lvector2i_Mvector2i_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2i_M_Nvector2i_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2i_M_Nvector2i_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2i_M_Nvector2i_R) == 0x000028, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2i_M_Nvector2i_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2i_M_Nvector2i_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2i_M_Nvector2i_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2i_M_Nvector2i_R, RetVal) == 0x000020, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector2i_M_Nvector2i_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R
// 0x0048 (0x0048 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R final
{
public:
	struct Verse_0::Ftuple_Lvector3_Mvector3_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct Fvector3                               RetVal;                                            // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R) == 0x000048, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R, RetVal) == 0x000030, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector4__v_M_Nvector4__v_R
// 0x0078 (0x0078 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector4__v_M_Nvector4__v_R final
{
public:
	struct Ftuple_Lvector4__v_Mvector4__v_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0050)(Parm, HasGetValueTypeHash)
	struct Fvector4_v                             RetVal;                                            // 0x0050(0x0028)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector4__v_M_Nvector4__v_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector4__v_M_Nvector4__v_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector4__v_M_Nvector4__v_R) == 0x000078, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector4__v_M_Nvector4__v_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector4__v_M_Nvector4__v_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector4__v_M_Nvector4__v_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector4__v_M_Nvector4__v_R, RetVal) == 0x000050, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RCrossProduct_L_Nvector4__v_M_Nvector4__v_R::RetVal' has a wrong offset!");

// Function Verse.Math._L_2fVerse_2eorg_2fVerse_2fMath_N_RDegreesToRadians_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RDegreesToRadians_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RDegreesToRadians_L_Nfloat_R) == 0x000008, "Wrong alignment on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RDegreesToRadians_L_Nfloat_R");
static_assert(sizeof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RDegreesToRadians_L_Nfloat_R) == 0x000010, "Wrong size on Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RDegreesToRadians_L_Nfloat_R");
static_assert(offsetof(Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RDegreesToRadians_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Math__L_2fVerse_2eorg_2fVerse_2fMath_N_RDegreesToRadians_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
