#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_0

#include "Basic.hpp"

#include "Verse_0_structs.hpp"
#include "VerseGameplay_structs.hpp"


namespace SDK
{

// SolarisGeneratedEnum VerseFortnite.DynamicHUD_Anchor
// NumValues: 0x0009
enum class EDynamicHUD_Anchor : uint8
{
	TopLeft                                  = 0,
	TopCenter                                = 1,
	TopRight                                 = 2,
	CenterLeft                               = 3,
	CenterCenter                             = 4,
	CenterRight                              = 5,
	BottomLeft                               = 6,
	BottomCenter                             = 7,
	BottomRight                              = 8,
};

// SolarisGeneratedEnum VerseFortnite.player_status_type
// NumValues: 0x0007
enum class Eplayer_status_type : uint8
{
	OnGround                                 = 0,
	Skydiving                                = 1,
	UsingGlider                              = 2,
	InVehicle                                = 3,
	Shooting                                 = 4,
	AimingDownSights                         = 5,
	InStasis                                 = 6,
};

// SolarisGeneratedEnum VerseFortnite.PlayerAttribute
// NumValues: 0x0006
enum class EPlayerAttribute : uint8
{
	CurrentHealth                            = 0,
	CurrentShield                            = 1,
	InitialHealth                            = 2,
	InitialShield                            = 3,
	Damage                                   = 4,
	ShieldDamage                             = 5,
};

// SolarisGeneratedEnum VerseFortnite.PlayerAttributeOperation
// NumValues: 0x0006
enum class EPlayerAttributeOperation : uint8
{
	Add                                      = 0,
	Multiply                                 = 1,
	Divide                                   = 2,
	Override                                 = 3,
	SetMax                                   = 4,
	SetMin                                   = 5,
};

// SolarisGeneratedEnum VerseFortnite.PlayerSettingState
// NumValues: 0x0003
enum class EPlayerSettingState : uint8
{
	PlayerDefault                            = 0,
	PlayerAllow                              = 1,
	PlayerDisallow                           = 2,
};

// SolarisGeneratedEnum VerseFortnite.verse_target_shape
// NumValues: 0x0006
enum class Everse_target_shape : uint8
{
	TargetShapeSphere                        = 0,
	TargetShapeCone                          = 1,
	TargetShapeBox                           = 2,
	TargetShapeCapsule                       = 3,
	TargetShapeLine                          = 4,
	TargetShapeCylinder                      = 5,
};

// SolarisGeneratedEnum VerseFortnite.verse_target_source
// NumValues: 0x0005
enum class Everse_target_source : uint8
{
	TargetSourceCamera                       = 0,
	TargetSourcePawnForward                  = 1,
	TargetSourcePawnTowardsFocus             = 2,
	TargetSourceWeaponForward                = 3,
	TargetSourceWeaponTowardsFocus           = 4,
};

// SolarisGeneratedEnum VerseFortnite.verse_target_type
// NumValues: 0x0009
enum class Everse_target_type : uint8
{
	Damageable                               = 0,
	Everything                               = 1,
	Pawns                                    = 2,
	Buildings                                = 3,
	Walls                                    = 4,
	Traps                                    = 5,
	Players                                  = 6,
	AIPawns                                  = 7,
	Instigator                               = 8,
};

// SolarisGeneratedStruct VerseFortnite.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseFortnite_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseFortnite_0::Ftuple_L_R) == 0x000001, "Wrong alignment on VerseFortnite_0::Ftuple_L_R");
static_assert(sizeof(VerseFortnite_0::Ftuple_L_R) == 0x000001, "Wrong size on VerseFortnite_0::Ftuple_L_R");
static_assert(offsetof(VerseFortnite_0::Ftuple_L_R, _StructPaddingDummy) == 0x000000, "Member 'VerseFortnite_0::Ftuple_L_R::_StructPaddingDummy' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lability__component_Msubtype_Lplayer__component_R_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lability__component_Msubtype_Lplayer__component_R_R final
{
public:
	class Uability_component*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lability__component_Msubtype_Lplayer__component_R_R) == 0x000008, "Wrong alignment on Ftuple_Lability__component_Msubtype_Lplayer__component_R_R");
static_assert(sizeof(Ftuple_Lability__component_Msubtype_Lplayer__component_R_R) == 0x000010, "Wrong size on Ftuple_Lability__component_Msubtype_Lplayer__component_R_R");
static_assert(offsetof(Ftuple_Lability__component_Msubtype_Lplayer__component_R_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lability__component_Msubtype_Lplayer__component_R_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lability__component_Msubtype_Lplayer__component_R_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lability__component_Msubtype_Lplayer__component_R_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R final
{
public:
	class Uability_target_data*                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ugameplay_effect_asset*                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R) == 0x000008, "Wrong alignment on Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R");
static_assert(sizeof(Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R) == 0x000018, "Wrong size on Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R");
static_assert(offsetof(Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R, __verse_0x932BF92E_Elem2) == 0x000010, "Member 'Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lcomponent_M_K_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lcomponent_M_K_Kchar_R final
{
public:
	class UEntityComponent*                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseStringProperty_>                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference)
};
static_assert(alignof(Ftuple_Lcomponent_M_K_Kchar_R) == 0x000008, "Wrong alignment on Ftuple_Lcomponent_M_K_Kchar_R");
static_assert(sizeof(Ftuple_Lcomponent_M_K_Kchar_R) == 0x000018, "Wrong size on Ftuple_Lcomponent_M_K_Kchar_R");
static_assert(offsetof(Ftuple_Lcomponent_M_K_Kchar_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lcomponent_M_K_Kchar_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lcomponent_M_K_Kchar_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lcomponent_M_K_Kchar_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R
// 0x0030 (0x0030 - 0x0000)
struct Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R final
{
public:
	class UEntityComponent*                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ufort_item_definition*                  __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Fvector3                               __verse_0xF64C4596_Elem3;                          // 0x0018(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R) == 0x000008, "Wrong alignment on Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R");
static_assert(sizeof(Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R) == 0x000030, "Wrong size on Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R");
static_assert(offsetof(Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R, __verse_0x932BF92E_Elem2) == 0x000010, "Member 'Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R::__verse_0x932BF92E_Elem2' has a wrong offset!");
static_assert(offsetof(Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R, __verse_0xF64C4596_Elem3) == 0x000018, "Member 'Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R::__verse_0xF64C4596_Elem3' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lcomponent_Mint_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lcomponent_Mint_R final
{
public:
	class UEntityComponent*                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lcomponent_Mint_R) == 0x000008, "Wrong alignment on Ftuple_Lcomponent_Mint_R");
static_assert(sizeof(Ftuple_Lcomponent_Mint_R) == 0x000010, "Wrong size on Ftuple_Lcomponent_Mint_R");
static_assert(offsetof(Ftuple_Lcomponent_Mint_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lcomponent_Mint_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lcomponent_Mint_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lcomponent_Mint_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lcomponent_Mlogic_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lcomponent_Mlogic_R final
{
public:
	class UEntityComponent*                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Ftuple_Lcomponent_Mlogic_R) == 0x000008, "Wrong alignment on Ftuple_Lcomponent_Mlogic_R");
static_assert(sizeof(Ftuple_Lcomponent_Mlogic_R) == 0x000010, "Wrong size on Ftuple_Lcomponent_Mlogic_R");
static_assert(offsetof(Ftuple_Lcomponent_Mlogic_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lcomponent_Mlogic_R::__verse_0x18E3F084_Elem0' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lcomponent_Msubtype_Lcomponent_R_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lcomponent_Msubtype_Lcomponent_R_R final
{
public:
	class UEntityComponent*                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lcomponent_Msubtype_Lcomponent_R_R) == 0x000008, "Wrong alignment on Ftuple_Lcomponent_Msubtype_Lcomponent_R_R");
static_assert(sizeof(Ftuple_Lcomponent_Msubtype_Lcomponent_R_R) == 0x000010, "Wrong size on Ftuple_Lcomponent_Msubtype_Lcomponent_R_R");
static_assert(offsetof(Ftuple_Lcomponent_Msubtype_Lcomponent_R_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lcomponent_Msubtype_Lcomponent_R_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lcomponent_Msubtype_Lcomponent_R_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lcomponent_Msubtype_Lcomponent_R_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lcomponent_Mtype_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lcomponent_Mtype_R final
{
public:
	class UEntityComponent*                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseFortnite_0::Ftuple_Lcomponent_Mtype_R) == 0x000008, "Wrong alignment on VerseFortnite_0::Ftuple_Lcomponent_Mtype_R");
static_assert(sizeof(VerseFortnite_0::Ftuple_Lcomponent_Mtype_R) == 0x000010, "Wrong size on VerseFortnite_0::Ftuple_Lcomponent_Mtype_R");
static_assert(offsetof(VerseFortnite_0::Ftuple_Lcomponent_Mtype_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'VerseFortnite_0::Ftuple_Lcomponent_Mtype_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(VerseFortnite_0::Ftuple_Lcomponent_Mtype_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'VerseFortnite_0::Ftuple_Lcomponent_Mtype_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lgameplay__effect__asset_Mfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lgameplay__effect__asset_Mfloat_R final
{
public:
	class Ugameplay_effect_asset*                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lgameplay__effect__asset_Mfloat_R) == 0x000008, "Wrong alignment on Ftuple_Lgameplay__effect__asset_Mfloat_R");
static_assert(sizeof(Ftuple_Lgameplay__effect__asset_Mfloat_R) == 0x000010, "Wrong size on Ftuple_Lgameplay__effect__asset_Mfloat_R");
static_assert(offsetof(Ftuple_Lgameplay__effect__asset_Mfloat_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lgameplay__effect__asset_Mfloat_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lgameplay__effect__asset_Mfloat_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lgameplay__effect__asset_Mfloat_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lint_Mint_Mint_R
// 0x0018 (0x0018 - 0x0000)
struct VerseFortnite_0::Ftuple_Lint_Mint_Mint_R final
{
public:
	int64                                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseFortnite_0::Ftuple_Lint_Mint_Mint_R) == 0x000008, "Wrong alignment on VerseFortnite_0::Ftuple_Lint_Mint_Mint_R");
static_assert(sizeof(VerseFortnite_0::Ftuple_Lint_Mint_Mint_R) == 0x000018, "Wrong size on VerseFortnite_0::Ftuple_Lint_Mint_Mint_R");
static_assert(offsetof(VerseFortnite_0::Ftuple_Lint_Mint_Mint_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'VerseFortnite_0::Ftuple_Lint_Mint_Mint_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(VerseFortnite_0::Ftuple_Lint_Mint_Mint_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'VerseFortnite_0::Ftuple_Lint_Mint_Mint_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(VerseFortnite_0::Ftuple_Lint_Mint_Mint_R, __verse_0x932BF92E_Elem2) == 0x000010, "Member 'VerseFortnite_0::Ftuple_Lint_Mint_Mint_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lint_Mint_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lint_Mint_R final
{
public:
	int64                                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseFortnite_0::Ftuple_Lint_Mint_R) == 0x000008, "Wrong alignment on VerseFortnite_0::Ftuple_Lint_Mint_R");
static_assert(sizeof(VerseFortnite_0::Ftuple_Lint_Mint_R) == 0x000010, "Wrong size on VerseFortnite_0::Ftuple_Lint_Mint_R");
static_assert(offsetof(VerseFortnite_0::Ftuple_Lint_Mint_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'VerseFortnite_0::Ftuple_Lint_Mint_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(VerseFortnite_0::Ftuple_Lint_Mint_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'VerseFortnite_0::Ftuple_Lint_Mint_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Litem__type_Mint_Mplayer__component_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Litem__type_Mint_Mplayer__component_R final
{
public:
	class Uitem_type*                             __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uplayer_component*                      __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Litem__type_Mint_Mplayer__component_R) == 0x000008, "Wrong alignment on Ftuple_Litem__type_Mint_Mplayer__component_R");
static_assert(sizeof(Ftuple_Litem__type_Mint_Mplayer__component_R) == 0x000018, "Wrong size on Ftuple_Litem__type_Mint_Mplayer__component_R");
static_assert(offsetof(Ftuple_Litem__type_Mint_Mplayer__component_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Litem__type_Mint_Mplayer__component_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Litem__type_Mint_Mplayer__component_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Litem__type_Mint_Mplayer__component_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Litem__type_Mint_Mplayer__component_R, __verse_0x932BF92E_Elem2) == 0x000010, "Member 'Ftuple_Litem__type_Mint_Mplayer__component_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R
// 0x0038 (0x0038 - 0x0000)
struct Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF64C4596_Elem3;                          // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R");
static_assert(sizeof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R) == 0x000038, "Wrong size on Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R, __verse_0x932BF92E_Elem2) == 0x000018, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R::__verse_0x932BF92E_Elem2' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R, __verse_0xF64C4596_Elem3) == 0x000028, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_M_Kchar_R::__verse_0xF64C4596_Elem3' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R
// 0x0058 (0x0058 - 0x0000)
struct Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
	EDynamicHUD_Anchor                            __verse_0xF64C4596_Elem3;                          // 0x0028(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         __verse_0x4F74920B_Elem4;                          // 0x0030(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x2A132EB3_Elem5;                          // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)
	EDynamicHUD_Anchor                            __verse_0xC4BC9BA1_Elem6;                          // 0x0050(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R");
static_assert(sizeof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R) == 0x000058, "Wrong size on Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R, __verse_0x932BF92E_Elem2) == 0x000018, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R::__verse_0x932BF92E_Elem2' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R, __verse_0xF64C4596_Elem3) == 0x000028, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R::__verse_0xF64C4596_Elem3' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R, __verse_0x4F74920B_Elem4) == 0x000030, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R::__verse_0x4F74920B_Elem4' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R, __verse_0x2A132EB3_Elem5) == 0x000040, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R::__verse_0x2A132EB3_Elem5' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R, __verse_0xC4BC9BA1_Elem6) == 0x000050, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_MDynamicHUD__Anchor_M_Kchar_M_Kchar_MDynamicHUD__Anchor_R::__verse_0xC4BC9BA1_Elem6' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R
// 0x0040 (0x0040 - 0x0000)
struct Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
	int64                                         __verse_0xF64C4596_Elem3;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x4F74920B_Elem4;                          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDynamicHUD_Anchor                            __verse_0x2A132EB3_Elem5;                          // 0x0038(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R");
static_assert(sizeof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R) == 0x000040, "Wrong size on Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R, __verse_0x932BF92E_Elem2) == 0x000018, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R::__verse_0x932BF92E_Elem2' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R, __verse_0xF64C4596_Elem3) == 0x000028, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R::__verse_0xF64C4596_Elem3' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R, __verse_0x4F74920B_Elem4) == 0x000030, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R::__verse_0x4F74920B_Elem4' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R, __verse_0x2A132EB3_Elem5) == 0x000038, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_MDynamicHUD__Anchor_R::__verse_0x2A132EB3_Elem5' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R
// 0x0038 (0x0038 - 0x0000)
struct Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
	int64                                         __verse_0xF64C4596_Elem3;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x4F74920B_Elem4;                          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R");
static_assert(sizeof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R) == 0x000038, "Wrong size on Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R, __verse_0x932BF92E_Elem2) == 0x000018, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R::__verse_0x932BF92E_Elem2' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R, __verse_0xF64C4596_Elem3) == 0x000028, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R::__verse_0xF64C4596_Elem3' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R, __verse_0x4F74920B_Elem4) == 0x000030, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_Mint_R::__verse_0x4F74920B_Elem4' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R
// 0x0030 (0x0030 - 0x0000)
struct Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
	int64                                         __verse_0xF64C4596_Elem3;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R");
static_assert(sizeof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R) == 0x000030, "Wrong size on Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R, __verse_0x932BF92E_Elem2) == 0x000018, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R::__verse_0x932BF92E_Elem2' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R, __verse_0xF64C4596_Elem3) == 0x000028, "Member 'Ftuple_Lplayer__component_M_Kchar_M_Kchar_Mint_R::__verse_0xF64C4596_Elem3' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_M_Kchar_M_Kchar_R
// 0x0028 (0x0028 - 0x0000)
struct VerseFortnite_0::Ftuple_Lplayer__component_M_Kchar_M_Kchar_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(VerseFortnite_0::Ftuple_Lplayer__component_M_Kchar_M_Kchar_R) == 0x000008, "Wrong alignment on VerseFortnite_0::Ftuple_Lplayer__component_M_Kchar_M_Kchar_R");
static_assert(sizeof(VerseFortnite_0::Ftuple_Lplayer__component_M_Kchar_M_Kchar_R) == 0x000028, "Wrong size on VerseFortnite_0::Ftuple_Lplayer__component_M_Kchar_M_Kchar_R");
static_assert(offsetof(VerseFortnite_0::Ftuple_Lplayer__component_M_Kchar_M_Kchar_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'VerseFortnite_0::Ftuple_Lplayer__component_M_Kchar_M_Kchar_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(VerseFortnite_0::Ftuple_Lplayer__component_M_Kchar_M_Kchar_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'VerseFortnite_0::Ftuple_Lplayer__component_M_Kchar_M_Kchar_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(VerseFortnite_0::Ftuple_Lplayer__component_M_Kchar_M_Kchar_R, __verse_0x932BF92E_Elem2) == 0x000018, "Member 'VerseFortnite_0::Ftuple_Lplayer__component_M_Kchar_M_Kchar_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_M_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lplayer__component_M_Kchar_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_M_Kchar_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_M_Kchar_R");
static_assert(sizeof(Ftuple_Lplayer__component_M_Kchar_R) == 0x000018, "Wrong size on Ftuple_Lplayer__component_M_Kchar_R");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_M_Kchar_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_M_Kchar_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_M_Kchar_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_Mint_Mint_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lplayer__component_Mint_Mint_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_Mint_Mint_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_Mint_Mint_R");
static_assert(sizeof(Ftuple_Lplayer__component_Mint_Mint_R) == 0x000018, "Wrong size on Ftuple_Lplayer__component_Mint_Mint_R");
static_assert(offsetof(Ftuple_Lplayer__component_Mint_Mint_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_Mint_Mint_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_Mint_Mint_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_Mint_Mint_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_Mint_Mint_R, __verse_0x932BF92E_Elem2) == 0x000010, "Member 'Ftuple_Lplayer__component_Mint_Mint_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_Mint_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lplayer__component_Mint_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_Mint_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_Mint_R");
static_assert(sizeof(Ftuple_Lplayer__component_Mint_R) == 0x000010, "Wrong size on Ftuple_Lplayer__component_Mint_R");
static_assert(offsetof(Ftuple_Lplayer__component_Mint_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_Mint_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_Mint_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_Mint_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_Mlogic_Mlogic_Mlogic_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lplayer__component_Mlogic_Mlogic_Mlogic_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_8_1 : 7;                                    // 0x0008(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x932BF92E_Elem2 : 1;                      // 0x0009(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_9_1 : 7;                                    // 0x0009(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xF64C4596_Elem3 : 1;                      // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Ftuple_Lplayer__component_Mlogic_Mlogic_Mlogic_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_Mlogic_Mlogic_Mlogic_R");
static_assert(sizeof(Ftuple_Lplayer__component_Mlogic_Mlogic_Mlogic_R) == 0x000010, "Wrong size on Ftuple_Lplayer__component_Mlogic_Mlogic_Mlogic_R");
static_assert(offsetof(Ftuple_Lplayer__component_Mlogic_Mlogic_Mlogic_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_Mlogic_Mlogic_Mlogic_R::__verse_0x18E3F084_Elem0' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_Mlogic_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lplayer__component_Mlogic_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Ftuple_Lplayer__component_Mlogic_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_Mlogic_R");
static_assert(sizeof(Ftuple_Lplayer__component_Mlogic_R) == 0x000010, "Wrong size on Ftuple_Lplayer__component_Mlogic_R");
static_assert(offsetof(Ftuple_Lplayer__component_Mlogic_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_Mlogic_R::__verse_0x18E3F084_Elem0' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_Mplayer__component_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lplayer__component_Mplayer__component_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uplayer_component*                      __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_Mplayer__component_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_Mplayer__component_R");
static_assert(sizeof(Ftuple_Lplayer__component_Mplayer__component_R) == 0x000010, "Wrong size on Ftuple_Lplayer__component_Mplayer__component_R");
static_assert(offsetof(Ftuple_Lplayer__component_Mplayer__component_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_Mplayer__component_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_Mplayer__component_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_Mplayer__component_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_Mplayer__start__component_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lplayer__component_Mplayer__start__component_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uplayer_start_component*                __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_Mplayer__start__component_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_Mplayer__start__component_R");
static_assert(sizeof(Ftuple_Lplayer__component_Mplayer__start__component_R) == 0x000010, "Wrong size on Ftuple_Lplayer__component_Mplayer__start__component_R");
static_assert(offsetof(Ftuple_Lplayer__component_Mplayer__start__component_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_Mplayer__start__component_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_Mplayer__start__component_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_Mplayer__start__component_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_Mplayer__status__type_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lplayer__component_Mplayer__status__type_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Eplayer_status_type                           __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_Mplayer__status__type_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_Mplayer__status__type_R");
static_assert(sizeof(Ftuple_Lplayer__component_Mplayer__status__type_R) == 0x000010, "Wrong size on Ftuple_Lplayer__component_Mplayer__status__type_R");
static_assert(offsetof(Ftuple_Lplayer__component_Mplayer__status__type_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_Mplayer__status__type_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_Mplayer__status__type_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_Mplayer__status__type_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_MPlayerAttribute_Mfloat_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lplayer__component_MPlayerAttribute_Mfloat_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAttribute                              __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_MPlayerAttribute_Mfloat_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_MPlayerAttribute_Mfloat_R");
static_assert(sizeof(Ftuple_Lplayer__component_MPlayerAttribute_Mfloat_R) == 0x000018, "Wrong size on Ftuple_Lplayer__component_MPlayerAttribute_Mfloat_R");
static_assert(offsetof(Ftuple_Lplayer__component_MPlayerAttribute_Mfloat_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_MPlayerAttribute_Mfloat_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_MPlayerAttribute_Mfloat_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_MPlayerAttribute_Mfloat_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_MPlayerAttribute_Mfloat_R, __verse_0x932BF92E_Elem2) == 0x000010, "Member 'Ftuple_Lplayer__component_MPlayerAttribute_Mfloat_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAttribute                              __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAttributeOperation                     __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xF64C4596_Elem3;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R");
static_assert(sizeof(Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R) == 0x000018, "Wrong size on Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R");
static_assert(offsetof(Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R, __verse_0x932BF92E_Elem2) == 0x000009, "Member 'Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R::__verse_0x932BF92E_Elem2' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R, __verse_0xF64C4596_Elem3) == 0x000010, "Member 'Ftuple_Lplayer__component_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R::__verse_0xF64C4596_Elem3' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__component_MPlayerAttribute_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lplayer__component_MPlayerAttribute_R final
{
public:
	class Uplayer_component*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAttribute                              __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__component_MPlayerAttribute_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__component_MPlayerAttribute_R");
static_assert(sizeof(Ftuple_Lplayer__component_MPlayerAttribute_R) == 0x000010, "Wrong size on Ftuple_Lplayer__component_MPlayerAttribute_R");
static_assert(offsetof(Ftuple_Lplayer__component_MPlayerAttribute_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__component_MPlayerAttribute_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__component_MPlayerAttribute_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lplayer__component_MPlayerAttribute_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R
// 0x0048 (0x0048 - 0x0000)
struct Ftuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R final
{
public:
	struct FPlayerHandle                          __verse_0x18E3F084_Elem0;                          // 0x0000(0x0028)(InstancedReference)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xF64C4596_Elem3 : 1;                      // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Ftuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R");
static_assert(sizeof(Ftuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R) == 0x000048, "Wrong size on Ftuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R");
static_assert(offsetof(Ftuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R, __verse_0x7D844C3C_Elem1) == 0x000028, "Member 'Ftuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R, __verse_0x932BF92E_Elem2) == 0x000038, "Member 'Ftuple_Lplayer__handle_M_Kchar_Mint_Mlogic_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__handle_M_Kchar_Mint_R
// 0x0040 (0x0040 - 0x0000)
struct Ftuple_Lplayer__handle_M_Kchar_Mint_R final
{
public:
	struct FPlayerHandle                          __verse_0x18E3F084_Elem0;                          // 0x0000(0x0028)(InstancedReference)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lplayer__handle_M_Kchar_Mint_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__handle_M_Kchar_Mint_R");
static_assert(sizeof(Ftuple_Lplayer__handle_M_Kchar_Mint_R) == 0x000040, "Wrong size on Ftuple_Lplayer__handle_M_Kchar_Mint_R");
static_assert(offsetof(Ftuple_Lplayer__handle_M_Kchar_Mint_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__handle_M_Kchar_Mint_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__handle_M_Kchar_Mint_R, __verse_0x7D844C3C_Elem1) == 0x000028, "Member 'Ftuple_Lplayer__handle_M_Kchar_Mint_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lplayer__handle_M_Kchar_Mint_R, __verse_0x932BF92E_Elem2) == 0x000038, "Member 'Ftuple_Lplayer__handle_M_Kchar_Mint_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// SolarisGeneratedStruct VerseFortnite.tuple_Lplayer__handle_Mfort__item__definition_Mint_Mlogic_R
// 0x0040 (0x0040 - 0x0000)
struct Ftuple_Lplayer__handle_Mfort__item__definition_Mint_Mlogic_R final
{
public:
	struct FPlayerHandle                          __verse_0x18E3F084_Elem0;                          // 0x0000(0x0028)(InstancedReference)
	class Ufort_item_definition*                  __verse_0x7D844C3C_Elem1;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xF64C4596_Elem3 : 1;                      // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Ftuple_Lplayer__handle_Mfort__item__definition_Mint_Mlogic_R) == 0x000008, "Wrong alignment on Ftuple_Lplayer__handle_Mfort__item__definition_Mint_Mlogic_R");
static_assert(sizeof(Ftuple_Lplayer__handle_Mfort__item__definition_Mint_Mlogic_R) == 0x000040, "Wrong size on Ftuple_Lplayer__handle_Mfort__item__definition_Mint_Mlogic_R");
static_assert(offsetof(Ftuple_Lplayer__handle_Mfort__item__definition_Mint_Mlogic_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lplayer__handle_Mfort__item__definition_Mint_Mlogic_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
