#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseGameplay_0

#include "Basic.hpp"

#include "VerseGameplay_0_structs.hpp"
#include "VerseGameplay_structs.hpp"
#include "SolarisInterop_structs.hpp"
#include "VerseEngine_0_structs.hpp"


namespace SDK::Params
{

// Function VerseGameplay.GameplayTags._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTag_L_Ngameplay__tag__selector_R
// 0x0010 (0x0010 - 0x0000)
struct GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTag_L_Ngameplay__tag__selector_R final
{
public:
	struct FVerseGameplayTag                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTag_L_Ngameplay__tag__selector_R) == 0x000008, "Wrong alignment on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTag_L_Ngameplay__tag__selector_R");
static_assert(sizeof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTag_L_Ngameplay__tag__selector_R) == 0x000010, "Wrong size on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTag_L_Ngameplay__tag__selector_R");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTag_L_Ngameplay__tag__selector_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTag_L_Ngameplay__tag__selector_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTag_L_Ngameplay__tag__selector_R, RetVal) == 0x000008, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTag_L_Ngameplay__tag__selector_R::RetVal' has a wrong offset!");

// Function VerseGameplay.GameplayTags._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTagFromSubClass_L_Nsubtype_Lgameplay__tag_R_R
// 0x0010 (0x0010 - 0x0000)
struct GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTagFromSubClass_L_Nsubtype_Lgameplay__tag_R_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTagFromSubClass_L_Nsubtype_Lgameplay__tag_R_R) == 0x000008, "Wrong alignment on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTagFromSubClass_L_Nsubtype_Lgameplay__tag_R_R");
static_assert(sizeof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTagFromSubClass_L_Nsubtype_Lgameplay__tag_R_R) == 0x000010, "Wrong size on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTagFromSubClass_L_Nsubtype_Lgameplay__tag_R_R");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTagFromSubClass_L_Nsubtype_Lgameplay__tag_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTagFromSubClass_L_Nsubtype_Lgameplay__tag_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTagFromSubClass_L_Nsubtype_Lgameplay__tag_R_R, RetVal) == 0x000008, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateGameplayTagFromSubClass_L_Nsubtype_Lgameplay__tag_R_R::RetVal' has a wrong offset!");

// Function VerseGameplay.GameplayTags._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_N_Kgameplay__tag_R
// 0x0018 (0x0018 - 0x0000)
struct GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_N_Kgameplay__tag_R final
{
public:
	TArray<class Ugameplay_tag*>                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm)
	class Ugameplay_tag_container*                RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_N_Kgameplay__tag_R) == 0x000008, "Wrong alignment on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_N_Kgameplay__tag_R");
static_assert(sizeof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_N_Kgameplay__tag_R) == 0x000018, "Wrong size on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_N_Kgameplay__tag_R");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_N_Kgameplay__tag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_N_Kgameplay__tag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_N_Kgameplay__tag_R, RetVal) == 0x000010, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_N_Kgameplay__tag_R::RetVal' has a wrong offset!");

// Function VerseGameplay.GameplayTags._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_Ngameplay__tag__selector__container_R
// 0x0018 (0x0018 - 0x0000)
struct GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_Ngameplay__tag__selector__container_R final
{
public:
	struct FVerseGameplayTagContainer             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_Ngameplay__tag__selector__container_R) == 0x000008, "Wrong alignment on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_Ngameplay__tag__selector__container_R");
static_assert(sizeof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_Ngameplay__tag__selector__container_R) == 0x000018, "Wrong size on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_Ngameplay__tag__selector__container_R");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_Ngameplay__tag__selector__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_Ngameplay__tag__selector__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_Ngameplay__tag__selector__container_R, RetVal) == 0x000010, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RCreateTagContainer_L_Ngameplay__tag__selector__container_R::RetVal' has a wrong offset!");

// Function VerseGameplay.GameplayTags._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag__container_M_Ngameplay__tag__container_R
// 0x0018 (0x0018 - 0x0000)
struct GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag__container_M_Ngameplay__tag__container_R final
{
public:
	struct Ftuple_Lgameplay__tag__container_Mgameplay__tag__container_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag__container_M_Ngameplay__tag__container_R) == 0x000008, "Wrong alignment on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag__container_M_Ngameplay__tag__container_R");
static_assert(sizeof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag__container_M_Ngameplay__tag__container_R) == 0x000018, "Wrong size on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag__container_M_Ngameplay__tag__container_R");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag__container_M_Ngameplay__tag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag__container_M_Ngameplay__tag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.GameplayTags._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag_M_Ngameplay__tag_R
// 0x0018 (0x0018 - 0x0000)
struct GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag_M_Ngameplay__tag_R final
{
public:
	struct Ftuple_Lgameplay__tag_Mgameplay__tag_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag_M_Ngameplay__tag_R) == 0x000008, "Wrong alignment on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag_M_Ngameplay__tag_R");
static_assert(sizeof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag_M_Ngameplay__tag_R) == 0x000018, "Wrong size on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag_M_Ngameplay__tag_R");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag_M_Ngameplay__tag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_REquals_L_Ngameplay__tag_M_Ngameplay__tag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.GameplayTags._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag__container_R
// 0x0018 (0x0018 - 0x0000)
struct GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag__container_R final
{
public:
	class Ugameplay_tag_container*                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag__container_R) == 0x000008, "Wrong alignment on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag__container_R");
static_assert(sizeof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag__container_R) == 0x000018, "Wrong size on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag__container_R");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag__container_R, RetVal) == 0x000008, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag__container_R::RetVal' has a wrong offset!");

// Function VerseGameplay.GameplayTags._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag_R
// 0x0018 (0x0018 - 0x0000)
struct GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag_R final
{
public:
	class Ugameplay_tag*                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag_R) == 0x000008, "Wrong alignment on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag_R");
static_assert(sizeof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag_R) == 0x000018, "Wrong size on GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag_R");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag_R, RetVal) == 0x000008, "Member 'GameplayTags__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_N_RToString_L_Ngameplay__tag_R::RetVal' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAddTag_L_Ngameplay__tag_R
// 0x0008 (0x0008 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAddTag_L_Ngameplay__tag_R final
{
public:
	class Ugameplay_tag*                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAddTag_L_Ngameplay__tag_R) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAddTag_L_Ngameplay__tag_R");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAddTag_L_Ngameplay__tag_R) == 0x000008, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAddTag_L_Ngameplay__tag_R");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAddTag_L_Ngameplay__tag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAddTag_L_Ngameplay__tag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAppendTags_L_Ngameplay__tag__container_R
// 0x0008 (0x0008 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAppendTags_L_Ngameplay__tag__container_R final
{
public:
	class Ugameplay_tag_container*                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAppendTags_L_Ngameplay__tag__container_R) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAppendTags_L_Ngameplay__tag__container_R");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAppendTags_L_Ngameplay__tag__container_R) == 0x000008, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAppendTags_L_Ngameplay__tag__container_R");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAppendTags_L_Ngameplay__tag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RAppendTags_L_Ngameplay__tag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAll_L_Ngameplay__tag__container_R
// 0x0010 (0x0010 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAll_L_Ngameplay__tag__container_R final
{
public:
	class Ugameplay_tag_container*                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAll_L_Ngameplay__tag__container_R) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAll_L_Ngameplay__tag__container_R");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAll_L_Ngameplay__tag__container_R) == 0x000010, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAll_L_Ngameplay__tag__container_R");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAll_L_Ngameplay__tag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAll_L_Ngameplay__tag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAllExact_L_Ngameplay__tag__container_R
// 0x0010 (0x0010 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAllExact_L_Ngameplay__tag__container_R final
{
public:
	class Ugameplay_tag_container*                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAllExact_L_Ngameplay__tag__container_R) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAllExact_L_Ngameplay__tag__container_R");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAllExact_L_Ngameplay__tag__container_R) == 0x000010, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAllExact_L_Ngameplay__tag__container_R");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAllExact_L_Ngameplay__tag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAllExact_L_Ngameplay__tag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAny_L_Ngameplay__tag__container_R
// 0x0010 (0x0010 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAny_L_Ngameplay__tag__container_R final
{
public:
	class Ugameplay_tag_container*                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAny_L_Ngameplay__tag__container_R) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAny_L_Ngameplay__tag__container_R");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAny_L_Ngameplay__tag__container_R) == 0x000010, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAny_L_Ngameplay__tag__container_R");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAny_L_Ngameplay__tag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAny_L_Ngameplay__tag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAnyExact_L_Ngameplay__tag__container_R
// 0x0010 (0x0010 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAnyExact_L_Ngameplay__tag__container_R final
{
public:
	class Ugameplay_tag_container*                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAnyExact_L_Ngameplay__tag__container_R) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAnyExact_L_Ngameplay__tag__container_R");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAnyExact_L_Ngameplay__tag__container_R) == 0x000010, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAnyExact_L_Ngameplay__tag__container_R");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAnyExact_L_Ngameplay__tag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasAnyExact_L_Ngameplay__tag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTag_L_Ngameplay__tag_R
// 0x0010 (0x0010 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTag_L_Ngameplay__tag_R final
{
public:
	class Ugameplay_tag*                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTag_L_Ngameplay__tag_R) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTag_L_Ngameplay__tag_R");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTag_L_Ngameplay__tag_R) == 0x000010, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTag_L_Ngameplay__tag_R");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTag_L_Ngameplay__tag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTag_L_Ngameplay__tag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTagExact_L_Ngameplay__tag_R
// 0x0010 (0x0010 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTagExact_L_Ngameplay__tag_R final
{
public:
	class Ugameplay_tag*                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTagExact_L_Ngameplay__tag_R) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTagExact_L_Ngameplay__tag_R");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTagExact_L_Ngameplay__tag_R) == 0x000010, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTagExact_L_Ngameplay__tag_R");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTagExact_L_Ngameplay__tag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RHasTagExact_L_Ngameplay__tag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RNum
// 0x0010 (0x0010 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RNum final
{
public:
	struct VerseGameplay_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RNum) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RNum");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RNum) == 0x000010, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RNum");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RNum, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RNum::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RNum, RetVal) == 0x000008, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RNum::RetVal' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTag_L_Ngameplay__tag_R
// 0x0010 (0x0010 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTag_L_Ngameplay__tag_R final
{
public:
	class Ugameplay_tag*                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTag_L_Ngameplay__tag_R) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTag_L_Ngameplay__tag_R");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTag_L_Ngameplay__tag_R) == 0x000010, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTag_L_Ngameplay__tag_R");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTag_L_Ngameplay__tag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTag_L_Ngameplay__tag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTags_L_Ngameplay__tag__container_R
// 0x0008 (0x0008 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTags_L_Ngameplay__tag__container_R final
{
public:
	class Ugameplay_tag_container*                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTags_L_Ngameplay__tag__container_R) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTags_L_Ngameplay__tag__container_R");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTags_L_Ngameplay__tag__container_R) == 0x000008, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTags_L_Ngameplay__tag__container_R");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTags_L_Ngameplay__tag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RRemoveTags_L_Ngameplay__tag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RReset
// 0x0001 (0x0001 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RReset final
{
public:
	struct VerseGameplay_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RReset) == 0x000001, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RReset");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RReset) == 0x000001, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RReset");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RReset, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RReset::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.gameplay_tag_container._L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RResetWithSlack_L_Nint_R
// 0x0008 (0x0008 - 0x0000)
struct gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RResetWithSlack_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RResetWithSlack_L_Nint_R) == 0x000008, "Wrong alignment on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RResetWithSlack_L_Nint_R");
static_assert(sizeof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RResetWithSlack_L_Nint_R) == 0x000008, "Wrong size on gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RResetWithSlack_L_Nint_R");
static_assert(offsetof(gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RResetWithSlack_L_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'gameplay_tag_container__L_2fVerse_2eorg_2fVerseGameplay_2fGameplayTags_2fgameplay__tag__container_N_RResetWithSlack_L_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.Player_V._L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nint_M_Ntype_R
// 0x0018 (0x0018 - 0x0000)
struct Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nint_M_Ntype_R final
{
public:
	struct Ftuple_Lint_Mtype_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nint_M_Ntype_R) == 0x000008, "Wrong alignment on Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nint_M_Ntype_R");
static_assert(sizeof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nint_M_Ntype_R) == 0x000018, "Wrong size on Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nint_M_Ntype_R");
static_assert(offsetof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nint_M_Ntype_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nint_M_Ntype_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nint_M_Ntype_R, RetVal) == 0x000010, "Member 'Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nint_M_Ntype_R::RetVal' has a wrong offset!");

// Function VerseGameplay.Player_V._L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R
// 0x0018 (0x0018 - 0x0000)
struct Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R final
{
public:
	struct Ftuple_Lplayer__component_Mtype_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R) == 0x000008, "Wrong alignment on Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R");
static_assert(sizeof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R) == 0x000018, "Wrong size on Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R");
static_assert(offsetof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R, RetVal) == 0x000010, "Member 'Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R::RetVal' has a wrong offset!");

// Function VerseGameplay.Player_V._L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_Ntype_R
// 0x0018 (0x0018 - 0x0000)
struct Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_Ntype_R final
{
public:
	struct Ftuple_Lint_Mtype_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_Ntype_R) == 0x000008, "Wrong alignment on Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_Ntype_R");
static_assert(sizeof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_Ntype_R) == 0x000018, "Wrong size on Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_Ntype_R");
static_assert(offsetof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_Ntype_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_Ntype_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_Ntype_R, RetVal) == 0x000010, "Member 'Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_Ntype_R::RetVal' has a wrong offset!");

// Function VerseGameplay.Player_V._L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R
// 0x0018 (0x0018 - 0x0000)
struct Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R final
{
public:
	struct Ftuple_Lplayer__component_Mtype_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R) == 0x000008, "Wrong alignment on Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R");
static_assert(sizeof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R) == 0x000018, "Wrong size on Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R");
static_assert(offsetof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R, RetVal) == 0x000010, "Member 'Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_Ntype_R::RetVal' has a wrong offset!");

// Function VerseGameplay.Player_V._L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetPlayerComponentByIndex_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetPlayerComponentByIndex_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetPlayerComponentByIndex_L_Nint_R) == 0x000008, "Wrong alignment on Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetPlayerComponentByIndex_L_Nint_R");
static_assert(sizeof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetPlayerComponentByIndex_L_Nint_R) == 0x000010, "Wrong size on Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetPlayerComponentByIndex_L_Nint_R");
static_assert(offsetof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetPlayerComponentByIndex_L_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetPlayerComponentByIndex_L_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetPlayerComponentByIndex_L_Nint_R, RetVal) == 0x000008, "Member 'Player_V__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_N_RGetPlayerComponentByIndex_L_Nint_R::RetVal' has a wrong offset!");

// Function VerseGameplay.player_component.$InitCDO
// 0x0001 (0x0001 - 0x0000)
struct player_component__InitCDO final
{
public:
	EVerseTrue                                    _TEMP_0;                                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(player_component__InitCDO) == 0x000001, "Wrong alignment on player_component__InitCDO");
static_assert(sizeof(player_component__InitCDO) == 0x000001, "Wrong size on player_component__InitCDO");
static_assert(offsetof(player_component__InitCDO, _TEMP_0) == 0x000000, "Member 'player_component__InitCDO::_TEMP_0' has a wrong offset!");

// Function VerseGameplay.player_component._L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__component_N_RGetHandle
// 0x0030 (0x0030 - 0x0000)
struct player_component__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__component_N_RGetHandle final
{
public:
	struct VerseGameplay_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerHandle                          RetVal;                                            // 0x0008(0x0028)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(player_component__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__component_N_RGetHandle) == 0x000008, "Wrong alignment on player_component__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__component_N_RGetHandle");
static_assert(sizeof(player_component__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__component_N_RGetHandle) == 0x000030, "Wrong size on player_component__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__component_N_RGetHandle");
static_assert(offsetof(player_component__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__component_N_RGetHandle, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'player_component__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__component_N_RGetHandle::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(player_component__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__component_N_RGetHandle, RetVal) == 0x000008, "Member 'player_component__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__component_N_RGetHandle::RetVal' has a wrong offset!");

// Function VerseGameplay.player_handle_array_helper._L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__handle__array__helper_N_RTestFunc_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct player_handle_array_helper__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__handle__array__helper_N_RTestFunc_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(player_handle_array_helper__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__handle__array__helper_N_RTestFunc_L_Nint_R) == 0x000008, "Wrong alignment on player_handle_array_helper__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__handle__array__helper_N_RTestFunc_L_Nint_R");
static_assert(sizeof(player_handle_array_helper__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__handle__array__helper_N_RTestFunc_L_Nint_R) == 0x000010, "Wrong size on player_handle_array_helper__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__handle__array__helper_N_RTestFunc_L_Nint_R");
static_assert(offsetof(player_handle_array_helper__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__handle__array__helper_N_RTestFunc_L_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'player_handle_array_helper__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__handle__array__helper_N_RTestFunc_L_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(player_handle_array_helper__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__handle__array__helper_N_RTestFunc_L_Nint_R, RetVal) == 0x000008, "Member 'player_handle_array_helper__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__handle__array__helper_N_RTestFunc_L_Nint_R::RetVal' has a wrong offset!");

// Function VerseGameplay.player_multicast_delegate._L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RBroadcast_L_Nplayer__handle_R
// 0x0028 (0x0028 - 0x0000)
struct player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RBroadcast_L_Nplayer__handle_R final
{
public:
	struct FPlayerHandle                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm)
};
static_assert(alignof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RBroadcast_L_Nplayer__handle_R) == 0x000008, "Wrong alignment on player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RBroadcast_L_Nplayer__handle_R");
static_assert(sizeof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RBroadcast_L_Nplayer__handle_R) == 0x000028, "Wrong size on player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RBroadcast_L_Nplayer__handle_R");
static_assert(offsetof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RBroadcast_L_Nplayer__handle_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RBroadcast_L_Nplayer__handle_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.player_multicast_delegate._L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_REmpty
// 0x0001 (0x0001 - 0x0000)
struct player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_REmpty final
{
public:
	struct VerseGameplay_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_REmpty) == 0x000001, "Wrong alignment on player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_REmpty");
static_assert(sizeof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_REmpty) == 0x000001, "Wrong size on player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_REmpty");
static_assert(offsetof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_REmpty, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_REmpty::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplay.player_multicast_delegate._L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RSubscribe_L_Nplayer__handle_Tvoid_R
// 0x0020 (0x0020 - 0x0000)
struct player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RSubscribe_L_Nplayer__handle_Tvoid_R final
{
public:
	TDelegate<void(const struct FPlayerHandle& __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument;                       // 0x0000(0x000C)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct Fdelegate_handle                       RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RSubscribe_L_Nplayer__handle_Tvoid_R) == 0x000008, "Wrong alignment on player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RSubscribe_L_Nplayer__handle_Tvoid_R");
static_assert(sizeof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RSubscribe_L_Nplayer__handle_Tvoid_R) == 0x000020, "Wrong size on player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RSubscribe_L_Nplayer__handle_Tvoid_R");
static_assert(offsetof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RSubscribe_L_Nplayer__handle_Tvoid_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RSubscribe_L_Nplayer__handle_Tvoid_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RSubscribe_L_Nplayer__handle_Tvoid_R, RetVal) == 0x000010, "Member 'player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RSubscribe_L_Nplayer__handle_Tvoid_R::RetVal' has a wrong offset!");

// Function VerseGameplay.player_multicast_delegate._L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R
// 0x0018 (0x0018 - 0x0000)
struct player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R final
{
public:
	struct Fdelegate_handle                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R) == 0x000008, "Wrong alignment on player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R");
static_assert(sizeof(player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R) == 0x000018, "Wrong size on player_multicast_delegate__L_2fVerse_2eorg_2fVerseGameplay_2fPlayer__V_2fplayer__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R");
