#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseMovement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum VerseMovement.ENetPhysicsMoveTriggerType
// NumValues: 0x0006
enum class ENetPhysicsMoveTriggerType : uint8
{
	Input                                    = 0,
	Constraint                               = 1,
	Physics                                  = 2,
	Trace                                    = 3,
	Constant                                 = 4,
	ENetPhysicsMoveTriggerType_MAX           = 5,
};

// Enum VerseMovement.ENetPhysicsMoveResponseType
// NumValues: 0x0003
enum class ENetPhysicsMoveResponseType : uint8
{
	Linear                                   = 0,
	Angular                                  = 1,
	ENetPhysicsMoveResponseType_MAX          = 2,
};

// Enum VerseMovement.ENetPhysicsMoveResponseFrame
// NumValues: 0x0004
enum class ENetPhysicsMoveResponseFrame : uint8
{
	Absolute                                 = 0,
	Object                                   = 1,
	Camera                                   = 2,
	ENetPhysicsMoveResponseFrame_MAX         = 3,
};

// Enum VerseMovement.ENetPhysicsMoveResponseEffect
// NumValues: 0x0004
enum class ENetPhysicsMoveResponseEffect : uint8
{
	Force                                    = 0,
	VelocityChange                           = 1,
	Transform                                = 2,
	ENetPhysicsMoveResponseEffect_MAX        = 3,
};

// Enum VerseMovement.ENetPhysicsMoveResponseModifier
// NumValues: 0x0006
enum class ENetPhysicsMoveResponseModifier : uint8
{
	Add                                      = 0,
	TargetTransform                          = 1,
	TargetVelocity                           = 2,
	OverrideTransform                        = 3,
	OverrideVelocity                         = 4,
	ENetPhysicsMoveResponseModifier_MAX      = 5,
};

// ScriptStruct VerseMovement.NetPhysicsMoveInputTriggerParams
// 0x0028 (0x0028 - 0x0000)
struct FNetPhysicsMoveInputTriggerParams final
{
public:
	bool                                          bIsAxis;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            AxisToMagnitudeCurve;                              // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AccumulateAxisInput;                               // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ClampAxis;                                         // 0x0018(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNetPhysicsMoveInputTriggerParams) == 0x000008, "Wrong alignment on FNetPhysicsMoveInputTriggerParams");
static_assert(sizeof(FNetPhysicsMoveInputTriggerParams) == 0x000028, "Wrong size on FNetPhysicsMoveInputTriggerParams");
static_assert(offsetof(FNetPhysicsMoveInputTriggerParams, bIsAxis) == 0x000000, "Member 'FNetPhysicsMoveInputTriggerParams::bIsAxis' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveInputTriggerParams, Name) == 0x000004, "Member 'FNetPhysicsMoveInputTriggerParams::Name' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveInputTriggerParams, AxisToMagnitudeCurve) == 0x000008, "Member 'FNetPhysicsMoveInputTriggerParams::AxisToMagnitudeCurve' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveInputTriggerParams, AccumulateAxisInput) == 0x000010, "Member 'FNetPhysicsMoveInputTriggerParams::AccumulateAxisInput' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveInputTriggerParams, ClampAxis) == 0x000018, "Member 'FNetPhysicsMoveInputTriggerParams::ClampAxis' has a wrong offset!");

// ScriptStruct VerseMovement.NetPhysicsMovePhysicsTriggerParams
// 0x0018 (0x0018 - 0x0000)
struct FNetPhysicsMovePhysicsTriggerParams final
{
public:
	struct FVector                                SpeedInDirection;                                  // 0x0000(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNetPhysicsMovePhysicsTriggerParams) == 0x000008, "Wrong alignment on FNetPhysicsMovePhysicsTriggerParams");
static_assert(sizeof(FNetPhysicsMovePhysicsTriggerParams) == 0x000018, "Wrong size on FNetPhysicsMovePhysicsTriggerParams");
static_assert(offsetof(FNetPhysicsMovePhysicsTriggerParams, SpeedInDirection) == 0x000000, "Member 'FNetPhysicsMovePhysicsTriggerParams::SpeedInDirection' has a wrong offset!");

// ScriptStruct VerseMovement.NetPhysicsMoveTraceTriggerParams
// 0x0050 (0x0050 - 0x0000)
struct FNetPhysicsMoveTraceTriggerParams final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseFrame                  Frame;                                             // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Length;                                            // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannel;                                  // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCollisionResponseContainer            ResponseParams;                                    // 0x0021(0x0020)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bProportionalToHitDistance;                        // 0x0041(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            HitDistanceToMagnitudeCurve;                       // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNetPhysicsMoveTraceTriggerParams) == 0x000008, "Wrong alignment on FNetPhysicsMoveTraceTriggerParams");
static_assert(sizeof(FNetPhysicsMoveTraceTriggerParams) == 0x000050, "Wrong size on FNetPhysicsMoveTraceTriggerParams");
static_assert(offsetof(FNetPhysicsMoveTraceTriggerParams, Direction) == 0x000000, "Member 'FNetPhysicsMoveTraceTriggerParams::Direction' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveTraceTriggerParams, Frame) == 0x000018, "Member 'FNetPhysicsMoveTraceTriggerParams::Frame' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveTraceTriggerParams, Length) == 0x00001C, "Member 'FNetPhysicsMoveTraceTriggerParams::Length' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveTraceTriggerParams, CollisionChannel) == 0x000020, "Member 'FNetPhysicsMoveTraceTriggerParams::CollisionChannel' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveTraceTriggerParams, ResponseParams) == 0x000021, "Member 'FNetPhysicsMoveTraceTriggerParams::ResponseParams' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveTraceTriggerParams, bProportionalToHitDistance) == 0x000041, "Member 'FNetPhysicsMoveTraceTriggerParams::bProportionalToHitDistance' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveTraceTriggerParams, HitDistanceToMagnitudeCurve) == 0x000048, "Member 'FNetPhysicsMoveTraceTriggerParams::HitDistanceToMagnitudeCurve' has a wrong offset!");

// ScriptStruct VerseMovement.NetPhysicsMoveTrigger
// 0x0098 (0x0098 - 0x0000)
struct FNetPhysicsMoveTrigger final
{
public:
	ENetPhysicsMoveTriggerType                    Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetPhysicsMoveInputTriggerParams      InputParams;                                       // 0x0008(0x0028)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FNetPhysicsMovePhysicsTriggerParams    PhysicsParams;                                     // 0x0030(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FNetPhysicsMoveTraceTriggerParams      TraceParams;                                       // 0x0048(0x0050)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNetPhysicsMoveTrigger) == 0x000008, "Wrong alignment on FNetPhysicsMoveTrigger");
static_assert(sizeof(FNetPhysicsMoveTrigger) == 0x000098, "Wrong size on FNetPhysicsMoveTrigger");
static_assert(offsetof(FNetPhysicsMoveTrigger, Type) == 0x000000, "Member 'FNetPhysicsMoveTrigger::Type' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveTrigger, InputParams) == 0x000008, "Member 'FNetPhysicsMoveTrigger::InputParams' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveTrigger, PhysicsParams) == 0x000030, "Member 'FNetPhysicsMoveTrigger::PhysicsParams' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveTrigger, TraceParams) == 0x000048, "Member 'FNetPhysicsMoveTrigger::TraceParams' has a wrong offset!");

// ScriptStruct VerseMovement.NetPhysicsMoveResponse
// 0x0050 (0x0050 - 0x0000)
struct FNetPhysicsMoveResponse final
{
public:
	struct FVector                                Vector;                                            // 0x0000(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            MagnitudeCurve;                                    // 0x0020(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseType                   Type;                                              // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseFrame                  Frame;                                             // 0x0029(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseEffect                 Effect;                                            // 0x002A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseModifier               Modifier;                                          // 0x002B(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ClampVector;                                       // 0x0030(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseFrame                  ClampFrame;                                        // 0x0048(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNetPhysicsMoveResponse) == 0x000008, "Wrong alignment on FNetPhysicsMoveResponse");
static_assert(sizeof(FNetPhysicsMoveResponse) == 0x000050, "Wrong size on FNetPhysicsMoveResponse");
static_assert(offsetof(FNetPhysicsMoveResponse, Vector) == 0x000000, "Member 'FNetPhysicsMoveResponse::Vector' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveResponse, Magnitude) == 0x000018, "Member 'FNetPhysicsMoveResponse::Magnitude' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveResponse, MagnitudeCurve) == 0x000020, "Member 'FNetPhysicsMoveResponse::MagnitudeCurve' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveResponse, Type) == 0x000028, "Member 'FNetPhysicsMoveResponse::Type' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveResponse, Frame) == 0x000029, "Member 'FNetPhysicsMoveResponse::Frame' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveResponse, Effect) == 0x00002A, "Member 'FNetPhysicsMoveResponse::Effect' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveResponse, Modifier) == 0x00002B, "Member 'FNetPhysicsMoveResponse::Modifier' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveResponse, ClampVector) == 0x000030, "Member 'FNetPhysicsMoveResponse::ClampVector' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveResponse, ClampFrame) == 0x000048, "Member 'FNetPhysicsMoveResponse::ClampFrame' has a wrong offset!");

// ScriptStruct VerseMovement.NetPhysicsMoveConfigEntry
// 0x0030 (0x0030 - 0x0000)
struct FNetPhysicsMoveConfigEntry final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNetPhysicsMoveTrigger>         Triggers;                                          // 0x0010(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FNetPhysicsMoveResponse>        Responses;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNetPhysicsMoveConfigEntry) == 0x000008, "Wrong alignment on FNetPhysicsMoveConfigEntry");
static_assert(sizeof(FNetPhysicsMoveConfigEntry) == 0x000030, "Wrong size on FNetPhysicsMoveConfigEntry");
static_assert(offsetof(FNetPhysicsMoveConfigEntry, Name) == 0x000000, "Member 'FNetPhysicsMoveConfigEntry::Name' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveConfigEntry, Triggers) == 0x000010, "Member 'FNetPhysicsMoveConfigEntry::Triggers' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveConfigEntry, Responses) == 0x000020, "Member 'FNetPhysicsMoveConfigEntry::Responses' has a wrong offset!");

// ScriptStruct VerseMovement.NetPhysicsMoveLimits
// 0x0080 (0x0080 - 0x0000)
struct FNetPhysicsMoveLimits final
{
public:
	bool                                          bClampVelocity;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MaxVelocity;                                       // 0x0008(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampAngularVelocity;                             // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MaxAngularVelocity;                                // 0x0028(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampMaxPosition;                                 // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MaxPosition;                                       // 0x0048(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampMinPosition;                                 // 0x0060(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MinPosition;                                       // 0x0068(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNetPhysicsMoveLimits) == 0x000008, "Wrong alignment on FNetPhysicsMoveLimits");
static_assert(sizeof(FNetPhysicsMoveLimits) == 0x000080, "Wrong size on FNetPhysicsMoveLimits");
static_assert(offsetof(FNetPhysicsMoveLimits, bClampVelocity) == 0x000000, "Member 'FNetPhysicsMoveLimits::bClampVelocity' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveLimits, MaxVelocity) == 0x000008, "Member 'FNetPhysicsMoveLimits::MaxVelocity' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveLimits, bClampAngularVelocity) == 0x000020, "Member 'FNetPhysicsMoveLimits::bClampAngularVelocity' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveLimits, MaxAngularVelocity) == 0x000028, "Member 'FNetPhysicsMoveLimits::MaxAngularVelocity' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveLimits, bClampMaxPosition) == 0x000040, "Member 'FNetPhysicsMoveLimits::bClampMaxPosition' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveLimits, MaxPosition) == 0x000048, "Member 'FNetPhysicsMoveLimits::MaxPosition' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveLimits, bClampMinPosition) == 0x000060, "Member 'FNetPhysicsMoveLimits::bClampMinPosition' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveLimits, MinPosition) == 0x000068, "Member 'FNetPhysicsMoveLimits::MinPosition' has a wrong offset!");

// ScriptStruct VerseMovement.NetPhysicsMoveInputCmd
// 0x0038 (0x0038 - 0x0000)
struct FNetPhysicsMoveInputCmd final
{
public:
	TArray<float>                                 AxisValues;                                        // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<bool>                                  ActionValues;                                      // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRotator                               ViewRotation;                                      // 0x0020(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNetPhysicsMoveInputCmd) == 0x000008, "Wrong alignment on FNetPhysicsMoveInputCmd");
static_assert(sizeof(FNetPhysicsMoveInputCmd) == 0x000038, "Wrong size on FNetPhysicsMoveInputCmd");
static_assert(offsetof(FNetPhysicsMoveInputCmd, AxisValues) == 0x000000, "Member 'FNetPhysicsMoveInputCmd::AxisValues' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveInputCmd, ActionValues) == 0x000010, "Member 'FNetPhysicsMoveInputCmd::ActionValues' has a wrong offset!");
static_assert(offsetof(FNetPhysicsMoveInputCmd, ViewRotation) == 0x000020, "Member 'FNetPhysicsMoveInputCmd::ViewRotation' has a wrong offset!");

// ScriptStruct VerseMovement.NetPhysicsMoveObject
// 0x0001 (0x0001 - 0x0000)
struct FNetPhysicsMoveObject final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNetPhysicsMoveObject) == 0x000001, "Wrong alignment on FNetPhysicsMoveObject");
static_assert(sizeof(FNetPhysicsMoveObject) == 0x000001, "Wrong size on FNetPhysicsMoveObject");
static_assert(offsetof(FNetPhysicsMoveObject, bEnabled) == 0x000000, "Member 'FNetPhysicsMoveObject::bEnabled' has a wrong offset!");

// ScriptStruct VerseMovement.NetPhysicsMoveObjectLocal
// 0x0090 (0x0090 - 0x0000)
struct alignas(0x08) FNetPhysicsMoveObjectLocal final
{
public:
	uint8                                         Pad_0[0x90];                                       // 0x0000(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNetPhysicsMoveObjectLocal) == 0x000008, "Wrong alignment on FNetPhysicsMoveObjectLocal");
static_assert(sizeof(FNetPhysicsMoveObjectLocal) == 0x000090, "Wrong size on FNetPhysicsMoveObjectLocal");

}

