#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteFrameworkUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "VerseFortniteFrameworkUI_structs.hpp"


namespace SDK
{

// Class VerseFortniteFrameworkUI.HUDControlsWidgetBase
// 0x0010 (0x0330 - 0x0320)
class UHUDControlsWidgetBase final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_320[0x8];                                      // 0x0320(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntryBox_Mappings;                                 // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDControlsWidgetBase">();
	}
	static class UHUDControlsWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDControlsWidgetBase>();
	}
};
static_assert(alignof(UHUDControlsWidgetBase) == 0x000008, "Wrong alignment on UHUDControlsWidgetBase");
static_assert(sizeof(UHUDControlsWidgetBase) == 0x000330, "Wrong size on UHUDControlsWidgetBase");
static_assert(offsetof(UHUDControlsWidgetBase, EntryBox_Mappings) == 0x000328, "Member 'UHUDControlsWidgetBase::EntryBox_Mappings' has a wrong offset!");

// Class VerseFortniteFrameworkUI.VerseFortniteHUDWidgetBase
// 0x0010 (0x0330 - 0x0320)
class UVerseFortniteHUDWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_320[0x10];                                     // 0x0320(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnUpdateVisibleState(bool bEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteHUDWidgetBase">();
	}
	static class UVerseFortniteHUDWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteHUDWidgetBase>();
	}
};
static_assert(alignof(UVerseFortniteHUDWidgetBase) == 0x000008, "Wrong alignment on UVerseFortniteHUDWidgetBase");
static_assert(sizeof(UVerseFortniteHUDWidgetBase) == 0x000330, "Wrong size on UVerseFortniteHUDWidgetBase");

// Class VerseFortniteFrameworkUI.HUDCountDownWidget
// 0x0000 (0x0330 - 0x0330)
class UHUDCountDownWidget final : public UVerseFortniteHUDWidgetBase
{
public:
	void OnStartCountDown(const float SecondsRemaining, const int32 CurrentRound);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDCountDownWidget">();
	}
	static class UHUDCountDownWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDCountDownWidget>();
	}
};
static_assert(alignof(UHUDCountDownWidget) == 0x000008, "Wrong alignment on UHUDCountDownWidget");
static_assert(sizeof(UHUDCountDownWidget) == 0x000330, "Wrong size on UHUDCountDownWidget");

// Class VerseFortniteFrameworkUI.VerseFortniteActivatableWidgetBase
// 0x0010 (0x0408 - 0x03F8)
class UVerseFortniteActivatableWidgetBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x10];                                     // 0x03F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEnabledChanged(bool bEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteActivatableWidgetBase">();
	}
	static class UVerseFortniteActivatableWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteActivatableWidgetBase>();
	}
};
static_assert(alignof(UVerseFortniteActivatableWidgetBase) == 0x000008, "Wrong alignment on UVerseFortniteActivatableWidgetBase");
static_assert(sizeof(UVerseFortniteActivatableWidgetBase) == 0x000408, "Wrong size on UVerseFortniteActivatableWidgetBase");

// Class VerseFortniteFrameworkUI.HUDScoreboardWidgetBase
// 0x0028 (0x0358 - 0x0330)
class UHUDScoreboardWidgetBase final : public UVerseFortniteHUDWidgetBase
{
public:
	TArray<class UHUDScoreboardEntryData*>        ScoreboardData;                                    // 0x0330(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UCommonListView*                        ScoreboardListView;                                // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_CurrentRound;                                 // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_NumberOfRounds;                               // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnUpdateRounds(uint32 CurrentRound, uint32 NumberOfRounds);
	void OnUpdateScores();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDScoreboardWidgetBase">();
	}
	static class UHUDScoreboardWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDScoreboardWidgetBase>();
	}
};
static_assert(alignof(UHUDScoreboardWidgetBase) == 0x000008, "Wrong alignment on UHUDScoreboardWidgetBase");
static_assert(sizeof(UHUDScoreboardWidgetBase) == 0x000358, "Wrong size on UHUDScoreboardWidgetBase");
static_assert(offsetof(UHUDScoreboardWidgetBase, ScoreboardData) == 0x000330, "Member 'UHUDScoreboardWidgetBase::ScoreboardData' has a wrong offset!");
static_assert(offsetof(UHUDScoreboardWidgetBase, ScoreboardListView) == 0x000340, "Member 'UHUDScoreboardWidgetBase::ScoreboardListView' has a wrong offset!");
static_assert(offsetof(UHUDScoreboardWidgetBase, Text_CurrentRound) == 0x000348, "Member 'UHUDScoreboardWidgetBase::Text_CurrentRound' has a wrong offset!");
static_assert(offsetof(UHUDScoreboardWidgetBase, Text_NumberOfRounds) == 0x000350, "Member 'UHUDScoreboardWidgetBase::Text_NumberOfRounds' has a wrong offset!");

// Class VerseFortniteFrameworkUI.HUDGameOverWidgetBase
// 0x0008 (0x0410 - 0x0408)
class UHUDGameOverWidgetBase final : public UVerseFortniteActivatableWidgetBase
{
public:
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EGameOverMessageType GetGameOverType();
	void HandleGameOverStateChanged(class UHUDGameOverComponentBase* GameOverComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDGameOverWidgetBase">();
	}
	static class UHUDGameOverWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDGameOverWidgetBase>();
	}
};
static_assert(alignof(UHUDGameOverWidgetBase) == 0x000008, "Wrong alignment on UHUDGameOverWidgetBase");
static_assert(sizeof(UHUDGameOverWidgetBase) == 0x000410, "Wrong size on UHUDGameOverWidgetBase");

// Class VerseFortniteFrameworkUI.HUDMapWidgetBase
// 0x0000 (0x0330 - 0x0330)
class UHUDMapWidgetBase final : public UVerseFortniteHUDWidgetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDMapWidgetBase">();
	}
	static class UHUDMapWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDMapWidgetBase>();
	}
};
static_assert(alignof(UHUDMapWidgetBase) == 0x000008, "Wrong alignment on UHUDMapWidgetBase");
static_assert(sizeof(UHUDMapWidgetBase) == 0x000330, "Wrong size on UHUDMapWidgetBase");

// Class VerseFortniteFrameworkUI.HUDScoreboardEntryWidgetBase
// 0x0020 (0x0300 - 0x02E0)
class UHUDScoreboardEntryWidgetBase final : public UCommonUserWidget
{
public:
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(TArray<class FString>& RowData)> OnScoreDataChanged;                                // 0x02E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHUDScoreboardEntryData*                ScoreData;                                         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDScoreboardEntryWidgetBase">();
	}
	static class UHUDScoreboardEntryWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDScoreboardEntryWidgetBase>();
	}
};
static_assert(alignof(UHUDScoreboardEntryWidgetBase) == 0x000008, "Wrong alignment on UHUDScoreboardEntryWidgetBase");
static_assert(sizeof(UHUDScoreboardEntryWidgetBase) == 0x000300, "Wrong size on UHUDScoreboardEntryWidgetBase");
static_assert(offsetof(UHUDScoreboardEntryWidgetBase, OnScoreDataChanged) == 0x0002E8, "Member 'UHUDScoreboardEntryWidgetBase::OnScoreDataChanged' has a wrong offset!");
static_assert(offsetof(UHUDScoreboardEntryWidgetBase, ScoreData) == 0x0002F8, "Member 'UHUDScoreboardEntryWidgetBase::ScoreData' has a wrong offset!");

// Class VerseFortniteFrameworkUI.HUDSimpleMessageWidget
// 0x0000 (0x0330 - 0x0330)
class UHUDSimpleMessageWidget final : public UVerseFortniteHUDWidgetBase
{
public:
	void OnUpdateMessage(const class FString& NewMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDSimpleMessageWidget">();
	}
	static class UHUDSimpleMessageWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDSimpleMessageWidget>();
	}
};
static_assert(alignof(UHUDSimpleMessageWidget) == 0x000008, "Wrong alignment on UHUDSimpleMessageWidget");
static_assert(sizeof(UHUDSimpleMessageWidget) == 0x000330, "Wrong size on UHUDSimpleMessageWidget");

// Class VerseFortniteFrameworkUI.VerseFortniteButton
// 0x0000 (0x0FE0 - 0x0FE0)
class UVerseFortniteButton final : public UCommonButtonBase
{
public:
	class FName                                   ButtonActionName;                                  // 0x0FD8(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FDC[0x4];                                      // 0x0FDC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteButton">();
	}
	static class UVerseFortniteButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteButton>();
	}
};
static_assert(alignof(UVerseFortniteButton) == 0x000010, "Wrong alignment on UVerseFortniteButton");
static_assert(sizeof(UVerseFortniteButton) == 0x000FE0, "Wrong size on UVerseFortniteButton");
static_assert(offsetof(UVerseFortniteButton, ButtonActionName) == 0x000FD8, "Member 'UVerseFortniteButton::ButtonActionName' has a wrong offset!");

}

