#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseInterface

#include "Basic.hpp"


namespace SDK
{

// Enum VerseInterface.ESolarisDebugMessageClientId
// NumValues: 0x0002
enum class ESolarisDebugMessageClientId : uint32
{
	None                                     = 0,
	Max                                      = 2147483646,
};

// Enum VerseInterface.ESolarisDebugMessageCommand
// NumValues: 0x0005
enum class ESolarisDebugMessageCommand : uint32
{
	Connect                                  = 0,
	Disconnect                               = 1,
	Message                                  = 2,
	PackageMapping                           = 3,
	ESolarisDebugMessageCommand_MAX          = 4,
};

// ScriptStruct VerseInterface.SolarisDebugMessage
// 0x0018 (0x0018 - 0x0000)
struct FSolarisDebugMessage final
{
public:
	ESolarisDebugMessageClientId                  ClientId;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESolarisDebugMessageCommand                   Command;                                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 MessageBodyUTF8;                                   // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSolarisDebugMessage) == 0x000008, "Wrong alignment on FSolarisDebugMessage");
static_assert(sizeof(FSolarisDebugMessage) == 0x000018, "Wrong size on FSolarisDebugMessage");
static_assert(offsetof(FSolarisDebugMessage, ClientId) == 0x000000, "Member 'FSolarisDebugMessage::ClientId' has a wrong offset!");
static_assert(offsetof(FSolarisDebugMessage, Command) == 0x000004, "Member 'FSolarisDebugMessage::Command' has a wrong offset!");
static_assert(offsetof(FSolarisDebugMessage, MessageBodyUTF8) == 0x000008, "Member 'FSolarisDebugMessage::MessageBodyUTF8' has a wrong offset!");

}

