#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_0

#include "Basic.hpp"

#include "SolarisInterop_0_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseGameplay_0_classes.hpp"
#include "EntityCore_classes.hpp"
#include "VerseFortnite_0_structs.hpp"
#include "VersePlayspace_classes.hpp"
#include "VerseFortnite_classes.hpp"
#include "Verse_0_structs.hpp"
#include "VerseEngine_0_classes.hpp"
#include "SolarisInterop_structs.hpp"
#include "EntityFortnite_classes.hpp"


namespace SDK
{

// SolarisGeneratedClass VerseFortnite.fort_building_settings_component
// 0x0040 (0x00D0 - 0x0090)
class Ufort_building_settings_component final : public UFortBuildingSettingsComponentBase
{
public:
	TDelegate<void(EPlayerSettingState __verse_0xB2CDDD72_Argument)> __verse_0x73B2BC5B__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R; // 0x0090(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPlayerSettingState __verse_0xB2CDDD72_Argument)> __verse_0x5AEF43A7__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R; // 0x009C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPlayerSettingState __verse_0xB2CDDD72_Argument)> __verse_0x82B7290F__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R; // 0x00A8(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPlayerSettingState __verse_0xB2CDDD72_Argument)> __verse_0x043FB183__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R; // 0x00B4(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPlayerSettingState __verse_0xB2CDDD72_Argument)> __verse_0xEE499CFF__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R; // 0x00C0(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R(EPlayerSettingState __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R(EPlayerSettingState __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R(EPlayerSettingState __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R(EPlayerSettingState __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R(EPlayerSettingState __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"fort_building_settings_component">();
	}
	static class Ufort_building_settings_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufort_building_settings_component>();
	}
};
static_assert(alignof(Ufort_building_settings_component) == 0x000008, "Wrong alignment on Ufort_building_settings_component");
static_assert(sizeof(Ufort_building_settings_component) == 0x0000D0, "Wrong size on Ufort_building_settings_component");
static_assert(offsetof(Ufort_building_settings_component, __verse_0x73B2BC5B__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R) == 0x000090, "Member 'Ufort_building_settings_component::__verse_0x73B2BC5B__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R' has a wrong offset!");
static_assert(offsetof(Ufort_building_settings_component, __verse_0x5AEF43A7__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R) == 0x00009C, "Member 'Ufort_building_settings_component::__verse_0x5AEF43A7__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R' has a wrong offset!");
static_assert(offsetof(Ufort_building_settings_component, __verse_0x82B7290F__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R) == 0x0000A8, "Member 'Ufort_building_settings_component::__verse_0x82B7290F__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R' has a wrong offset!");
static_assert(offsetof(Ufort_building_settings_component, __verse_0x043FB183__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R) == 0x0000B4, "Member 'Ufort_building_settings_component::__verse_0x043FB183__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R' has a wrong offset!");
static_assert(offsetof(Ufort_building_settings_component, __verse_0xEE499CFF__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R) == 0x0000C0, "Member 'Ufort_building_settings_component::__verse_0xEE499CFF__L_2fFortnite_2ecom_2fVerseFortnite_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.ability_target_data
// 0x0058 (0x0080 - 0x0028)
class Uability_target_data final : public UObject
{
public:
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x92925191__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RHasHits; // 0x0028(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xF2337515__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetOrigin; // 0x0034(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x4E9C9B5E__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetEndPoint; // 0x0040(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x4E94026D__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetHitLocations; // 0x004C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x28];                                      // 0x0058(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	FOptionProperty_ _L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetEndPoint(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TArray<struct Fvector3> _L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetHitLocations(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetOrigin(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RHasHits(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ability_target_data">();
	}
	static class Uability_target_data* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uability_target_data>();
	}
};
static_assert(alignof(Uability_target_data) == 0x000008, "Wrong alignment on Uability_target_data");
static_assert(sizeof(Uability_target_data) == 0x000080, "Wrong size on Uability_target_data");
static_assert(offsetof(Uability_target_data, __verse_0x92925191__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RHasHits) == 0x000028, "Member 'Uability_target_data::__verse_0x92925191__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RHasHits' has a wrong offset!");
static_assert(offsetof(Uability_target_data, __verse_0xF2337515__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetOrigin) == 0x000034, "Member 'Uability_target_data::__verse_0xF2337515__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetOrigin' has a wrong offset!");
static_assert(offsetof(Uability_target_data, __verse_0x4E9C9B5E__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetEndPoint) == 0x000040, "Member 'Uability_target_data::__verse_0x4E9C9B5E__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetEndPoint' has a wrong offset!");
static_assert(offsetof(Uability_target_data, __verse_0x4E94026D__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetHitLocations) == 0x00004C, "Member 'Uability_target_data::__verse_0x4E94026D__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__target__data_N_RGetHitLocations' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.player_eliminated_result
// 0x0010 (0x0038 - 0x0028)
class Uplayer_eliminated_result final : public UObject
{
public:
	class Uplayer_component*                      __verse_0x7C71103B_EliminatedPlayer;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0xB989E158_Eliminator;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"player_eliminated_result">();
	}
	static class Uplayer_eliminated_result* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uplayer_eliminated_result>();
	}
};
static_assert(alignof(Uplayer_eliminated_result) == 0x000008, "Wrong alignment on Uplayer_eliminated_result");
static_assert(sizeof(Uplayer_eliminated_result) == 0x000038, "Wrong size on Uplayer_eliminated_result");
static_assert(offsetof(Uplayer_eliminated_result, __verse_0x7C71103B_EliminatedPlayer) == 0x000028, "Member 'Uplayer_eliminated_result::__verse_0x7C71103B_EliminatedPlayer' has a wrong offset!");
static_assert(offsetof(Uplayer_eliminated_result, __verse_0xB989E158_Eliminator) == 0x000030, "Member 'Uplayer_eliminated_result::__verse_0xB989E158_Eliminator' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.fort_item_definition
// 0x0000 (0x00B0 - 0x00B0)
class Ufort_item_definition final : public UAsset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"fort_item_definition">();
	}
	static class Ufort_item_definition* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufort_item_definition>();
	}
};
static_assert(alignof(Ufort_item_definition) == 0x000008, "Wrong alignment on Ufort_item_definition");
static_assert(sizeof(Ufort_item_definition) == 0x0000B0, "Wrong size on Ufort_item_definition");

// SolarisGeneratedClass VerseFortnite.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseFortnite_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SolarisGeneratedClass VerseFortnite.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseFortnite_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseFortnite_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseFortnite_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseFortnite_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseFortnite_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseFortnite_0::U_SolarisSignatureFunctionOuter");

// SolarisGeneratedClass VerseFortnite.ability_component
// 0x0080 (0x0118 - 0x0098)
class Uability_component final : public UVerseFortniteAbilityComponentBase
{
public:
	TDelegate<void(class UClass* __verse_0xB2CDDD72_Argument)> __verse_0xAD70D868__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RGiveAbility_L_Ntype_R; // 0x0098(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UClass* __verse_0xB2CDDD72_Argument)> __verse_0xD170EB31__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RClearAbility_L_Ntype_R; // 0x00A4(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UClass* __verse_0xB2CDDD72_Argument)> __verse_0x3FF5DAF4__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RTryActivateAbility_L_Ntype_R; // 0x00B0(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Ftuple_Lgameplay__effect__asset_Mfloat_R& __verse_0xB2CDDD72_Argument)> __verse_0x92A6C711__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R; // 0x00BC(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x50];                                      // 0x00C8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R(const struct Ftuple_Lgameplay__effect__asset_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RClearAbility_L_Ntype_R(class UClass* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RGiveAbility_L_Ntype_R(class UClass* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RTryActivateAbility_L_Ntype_R(class UClass* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ability_component">();
	}
	static class Uability_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uability_component>();
	}
};
static_assert(alignof(Uability_component) == 0x000008, "Wrong alignment on Uability_component");
static_assert(sizeof(Uability_component) == 0x000118, "Wrong size on Uability_component");
static_assert(offsetof(Uability_component, __verse_0xAD70D868__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RGiveAbility_L_Ntype_R) == 0x000098, "Member 'Uability_component::__verse_0xAD70D868__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RGiveAbility_L_Ntype_R' has a wrong offset!");
static_assert(offsetof(Uability_component, __verse_0xD170EB31__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RClearAbility_L_Ntype_R) == 0x0000A4, "Member 'Uability_component::__verse_0xD170EB31__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RClearAbility_L_Ntype_R' has a wrong offset!");
static_assert(offsetof(Uability_component, __verse_0x3FF5DAF4__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RTryActivateAbility_L_Ntype_R) == 0x0000B0, "Member 'Uability_component::__verse_0x3FF5DAF4__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RTryActivateAbility_L_Ntype_R' has a wrong offset!");
static_assert(offsetof(Uability_component, __verse_0x92A6C711__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R) == 0x0000BC, "Member 'Uability_component::__verse_0x92A6C711__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.AbilityComponent
// 0x0000 (0x0028 - 0x0028)
class UAbilityComponent final : public UObject
{
public:
	static FOptionProperty_ _L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R(class Uplayer_component* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityComponent">();
	}
	static class UAbilityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityComponent>();
	}
};
static_assert(alignof(UAbilityComponent) == 0x000008, "Wrong alignment on UAbilityComponent");
static_assert(sizeof(UAbilityComponent) == 0x000028, "Wrong size on UAbilityComponent");

// SolarisGeneratedClass VerseFortnite.Context_fort_playspace_component$__WaitForPlayerEliminated
// 0x0018 (0x0148 - 0x0130)
class UContext_fort_playspace_component___WaitForPlayerEliminated final : public Utask
{
public:
	class Ufort_playspace_component*              _Self;                                             // 0x0130(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0138(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Uplayer_eliminated_result*              _RetVal;                                           // 0x0140(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_fort_playspace_component$__WaitForPlayerEliminated">();
	}
	static class UContext_fort_playspace_component___WaitForPlayerEliminated* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_fort_playspace_component___WaitForPlayerEliminated>();
	}
};
static_assert(alignof(UContext_fort_playspace_component___WaitForPlayerEliminated) == 0x000008, "Wrong alignment on UContext_fort_playspace_component___WaitForPlayerEliminated");
static_assert(sizeof(UContext_fort_playspace_component___WaitForPlayerEliminated) == 0x000148, "Wrong size on UContext_fort_playspace_component___WaitForPlayerEliminated");
static_assert(offsetof(UContext_fort_playspace_component___WaitForPlayerEliminated, _Self) == 0x000130, "Member 'UContext_fort_playspace_component___WaitForPlayerEliminated::_Self' has a wrong offset!");
static_assert(offsetof(UContext_fort_playspace_component___WaitForPlayerEliminated, __verse_0xB2CDDD72_Argument) == 0x000138, "Member 'UContext_fort_playspace_component___WaitForPlayerEliminated::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UContext_fort_playspace_component___WaitForPlayerEliminated, _RetVal) == 0x000140, "Member 'UContext_fort_playspace_component___WaitForPlayerEliminated::_RetVal' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.PlayerTeam
// 0x0000 (0x0028 - 0x0028)
class UPlayerTeam final : public UObject
{
public:
	static uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2fPlayerTeam_N_RcontainsHumanPlayers_L_Ncomponent_M_Nint_R(const struct Ftuple_Lcomponent_Mint_R& __verse_0xB2CDDD72_Argument);
	static int64 _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2fPlayerTeam_N_RgetTeam_L_Nplayer__component_R(class Uplayer_component* __verse_0xB2CDDD72_Argument);
	static struct Fcolor_v _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2fPlayerTeam_N_RgetTeamColor_L_Ncomponent_M_Nint_R(const struct Ftuple_Lcomponent_Mint_R& __verse_0xB2CDDD72_Argument);
	static int64 _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2fPlayerTeam_N_RgetTeamExperience_L_Ncomponent_M_Nint_R(const struct Ftuple_Lcomponent_Mint_R& __verse_0xB2CDDD72_Argument);
	static int64 _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2fPlayerTeam_N_RgetTeamLevel_L_Ncomponent_M_Nint_R(const struct Ftuple_Lcomponent_Mint_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uplayer_component*> _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2fPlayerTeam_N_RgetTeamMembers_L_Ncomponent_M_Nint_R(const struct Ftuple_Lcomponent_Mint_R& __verse_0xB2CDDD72_Argument);
	static int64 _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2fPlayerTeam_N_RgetTeamSize_L_Ncomponent_M_Nint_R(const struct Ftuple_Lcomponent_Mint_R& __verse_0xB2CDDD72_Argument);
	static int64 _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2fPlayerTeam_N_RpickTeam_L_Nplayer__component_M_Nint_R(const struct Ftuple_Lplayer__component_Mint_R& __verse_0xB2CDDD72_Argument);
	static uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2fPlayerTeam_N_RsetTeam_L_Nplayer__component_M_Nint_R(const struct Ftuple_Lplayer__component_Mint_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerTeam">();
	}
	static class UPlayerTeam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerTeam>();
	}
};
static_assert(alignof(UPlayerTeam) == 0x000008, "Wrong alignment on UPlayerTeam");
static_assert(sizeof(UPlayerTeam) == 0x000028, "Wrong size on UPlayerTeam");

// SolarisGeneratedClass VerseFortnite.gameplay_ability_asset
// 0x0000 (0x00B0 - 0x00B0)
class Ugameplay_ability_asset final : public UAsset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"gameplay_ability_asset">();
	}
	static class Ugameplay_ability_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ugameplay_ability_asset>();
	}
};
static_assert(alignof(Ugameplay_ability_asset) == 0x000008, "Wrong alignment on Ugameplay_ability_asset");
static_assert(sizeof(Ugameplay_ability_asset) == 0x0000B0, "Wrong size on Ugameplay_ability_asset");

// SolarisGeneratedClass VerseFortnite.Context_gameplay_ability$_L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility
// 0x0020 (0x0150 - 0x0130)
class UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility final : public Utask
{
public:
	class Ugameplay_ability*                      _Self;                                             // 0x0130(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0138(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> _TEMP_0;                                           // 0x013C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            _TEMP_1;                                           // 0x0148(0x0001)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_gameplay_ability$_L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility">();
	}
	static class UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility>();
	}
};
static_assert(alignof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility) == 0x000008, "Wrong alignment on UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility");
static_assert(sizeof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility) == 0x000150, "Wrong size on UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility, _Self) == 0x000130, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility::_Self' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility, __verse_0xB2CDDD72_Argument) == 0x000138, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility, _TEMP_0) == 0x00013C, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility::_TEMP_0' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility, _TEMP_1) == 0x000148, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbility::_TEMP_1' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.Context_gameplay_ability$_L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync
// 0x0050 (0x0180 - 0x0130)
class UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync final : public Utask
{
public:
	class Ugameplay_ability*                      _Self;                                             // 0x0130(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0138(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Utask*                                  _TEMP_0;                                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> _TEMP_1;                                           // 0x0148(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            _TEMP_2;                                           // 0x0154(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _TEMP_3;                                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Utask*                                  _TEMP_4;                                           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> _TEMP_5;                                           // 0x0168(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            _TEMP_6;                                           // 0x0174(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _TEMP_7;                                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_gameplay_ability$_L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync">();
	}
	static class UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync>();
	}
};
static_assert(alignof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync) == 0x000008, "Wrong alignment on UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync");
static_assert(sizeof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync) == 0x000180, "Wrong size on UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync, _Self) == 0x000130, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync::_Self' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync, __verse_0xB2CDDD72_Argument) == 0x000138, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync, _TEMP_0) == 0x000140, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync::_TEMP_0' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync, _TEMP_1) == 0x000148, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync::_TEMP_1' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync, _TEMP_2) == 0x000154, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync::_TEMP_2' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync, _TEMP_3) == 0x000158, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync::_TEMP_3' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync, _TEMP_4) == 0x000160, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync::_TEMP_4' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync, _TEMP_5) == 0x000168, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync::_TEMP_5' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync, _TEMP_6) == 0x000174, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync::_TEMP_6' has a wrong offset!");
static_assert(offsetof(UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync, _TEMP_7) == 0x000178, "Member 'UContext_gameplay_ability__L_2fFortnite_2ecom_2fVerseFortnite_2fAbilities_2fgameplay__ability_N_RActivateAbilityAsync::_TEMP_7' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.player_pickup_component
// 0x0048 (0x00A8 - 0x0060)
class Uplayer_pickup_component final : public UEntityComponent
{
public:
	TDelegate<void(class Uplayer_component* __verse_0xB2CDDD72_Argument)> __verse_0x136AA735__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R; // 0x0060(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Ftuple_Lvector3_M_Qplayer__component_R& __verse_0xB2CDDD72_Argument)> __verse_0x048CF2EC__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R; // 0x006C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Uitem_type* __verse_0xB2CDDD72_Argument)> __verse_0xA4D817CA__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R; // 0x0078(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Ftuple_Litem__type_Mint_Mplayer__component_R& __verse_0xB2CDDD72_Argument)> __verse_0xECC38C6C__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R; // 0x0084(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x331FC05A__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType; // 0x0090(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0xC];                                       // 0x009C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R(const struct Ftuple_Litem__type_Mint_Mplayer__component_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R(class Uitem_type* __verse_0xB2CDDD72_Argument);
	class Uitem_type* _L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R(class Uplayer_component* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R(const struct Ftuple_Lvector3_M_Qplayer__component_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"player_pickup_component">();
	}
	static class Uplayer_pickup_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uplayer_pickup_component>();
	}
};
static_assert(alignof(Uplayer_pickup_component) == 0x000008, "Wrong alignment on Uplayer_pickup_component");
static_assert(sizeof(Uplayer_pickup_component) == 0x0000A8, "Wrong size on Uplayer_pickup_component");
static_assert(offsetof(Uplayer_pickup_component, __verse_0x136AA735__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R) == 0x000060, "Member 'Uplayer_pickup_component::__verse_0x136AA735__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R' has a wrong offset!");
static_assert(offsetof(Uplayer_pickup_component, __verse_0x048CF2EC__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R) == 0x00006C, "Member 'Uplayer_pickup_component::__verse_0x048CF2EC__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R' has a wrong offset!");
static_assert(offsetof(Uplayer_pickup_component, __verse_0xA4D817CA__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R) == 0x000078, "Member 'Uplayer_pickup_component::__verse_0xA4D817CA__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R' has a wrong offset!");
static_assert(offsetof(Uplayer_pickup_component, __verse_0xECC38C6C__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R) == 0x000084, "Member 'Uplayer_pickup_component::__verse_0xECC38C6C__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R' has a wrong offset!");
static_assert(offsetof(Uplayer_pickup_component, __verse_0x331FC05A__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType) == 0x000090, "Member 'Uplayer_pickup_component::__verse_0x331FC05A__L_2fFortnite_2ecom_2fVerseFortnite_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.hud_dynamic_director
// 0x0000 (0x01D0 - 0x01D0)
class Uhud_dynamic_director final : public UHUDDynamicDirectorBase
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"hud_dynamic_director">();
	}
	static class Uhud_dynamic_director* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uhud_dynamic_director>();
	}
};
static_assert(alignof(Uhud_dynamic_director) == 0x000008, "Wrong alignment on Uhud_dynamic_director");
static_assert(sizeof(Uhud_dynamic_director) == 0x0001D0, "Wrong size on Uhud_dynamic_director");

// SolarisGeneratedClass VerseFortnite.fort_player_component
// 0x0030 (0x0120 - 0x00F0)
class Ufort_player_component final : public Uplayer_component
{
public:
	TDelegate<void(FVerseStringProperty_ __verse_0xB2CDDD72_Argument)> __verse_0x7F09BDC7__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RPushActiveState_L_N_Kchar_R; // 0x00F0(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(FVerseStringProperty_ __verse_0xB2CDDD72_Argument)> __verse_0x9285EDA3__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RPopActiveState_L_N_Kchar_R; // 0x00FC(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(FVerseStringProperty_ __verse_0xB2CDDD72_Argument)> __verse_0xF8387873__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RIsActive_L_N_Kchar_R; // 0x0108(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x4262CD43__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RGetUniqueID; // 0x0114(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void _InitCDO();
	void _InitInstance();
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RGetUniqueID(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RIsActive_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RPopActiveState_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RPushActiveState_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"fort_player_component">();
	}
	static class Ufort_player_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufort_player_component>();
	}
};
static_assert(alignof(Ufort_player_component) == 0x000008, "Wrong alignment on Ufort_player_component");
static_assert(sizeof(Ufort_player_component) == 0x000120, "Wrong size on Ufort_player_component");
static_assert(offsetof(Ufort_player_component, __verse_0x7F09BDC7__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RPushActiveState_L_N_Kchar_R) == 0x0000F0, "Member 'Ufort_player_component::__verse_0x7F09BDC7__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RPushActiveState_L_N_Kchar_R' has a wrong offset!");
static_assert(offsetof(Ufort_player_component, __verse_0x9285EDA3__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RPopActiveState_L_N_Kchar_R) == 0x0000FC, "Member 'Ufort_player_component::__verse_0x9285EDA3__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RPopActiveState_L_N_Kchar_R' has a wrong offset!");
static_assert(offsetof(Ufort_player_component, __verse_0xF8387873__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RIsActive_L_N_Kchar_R) == 0x000108, "Member 'Ufort_player_component::__verse_0xF8387873__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RIsActive_L_N_Kchar_R' has a wrong offset!");
static_assert(offsetof(Ufort_player_component, __verse_0x4262CD43__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RGetUniqueID) == 0x000114, "Member 'Ufort_player_component::__verse_0x4262CD43__L_2fFortnite_2ecom_2fVerseFortnite_2fPlayer_2ffort__player__component_N_RGetUniqueID' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.fort_playspace_component
// 0x0038 (0x0150 - 0x0118)
class Ufort_playspace_component final : public Uplayspace_component
{
public:
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x43E273F3___WaitForPlayerEliminated;      // 0x0118(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x2C];                                     // 0x0124(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	class Utask* __WaitForPlayerEliminated(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"fort_playspace_component">();
	}
	static class Ufort_playspace_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufort_playspace_component>();
	}
};
static_assert(alignof(Ufort_playspace_component) == 0x000008, "Wrong alignment on Ufort_playspace_component");
static_assert(sizeof(Ufort_playspace_component) == 0x000150, "Wrong size on Ufort_playspace_component");
static_assert(offsetof(Ufort_playspace_component, __verse_0x43E273F3___WaitForPlayerEliminated) == 0x000118, "Member 'Ufort_playspace_component::__verse_0x43E273F3___WaitForPlayerEliminated' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.stat_container
// 0x0038 (0x0060 - 0x0028)
class Ustat_container : public UObject
{
public:
	TDelegate<void(int64 __verse_0xB2CDDD72_Argument)> __verse_0xD5D3D4B0__L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RgetStatValue_L_Nint_R; // 0x0028(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_Lint_Mint_R& __verse_0xB2CDDD72_Argument)> __verse_0x204575BE__L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RsetStatValue_L_Nint_M_Nint_R; // 0x0034(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_Lint_Mint_R& __verse_0xB2CDDD72_Argument)> __verse_0xFC20F645__L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RincrementStat_L_Nint_M_Nint_R; // 0x0040(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x14];                                      // 0x004C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	int64 _L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RgetStatValue_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RincrementStat_L_Nint_M_Nint_R(const struct VerseFortnite_0::Ftuple_Lint_Mint_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RsetStatValue_L_Nint_M_Nint_R(const struct VerseFortnite_0::Ftuple_Lint_Mint_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"stat_container">();
	}
	static class Ustat_container* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ustat_container>();
	}
};
static_assert(alignof(Ustat_container) == 0x000008, "Wrong alignment on Ustat_container");
static_assert(sizeof(Ustat_container) == 0x000060, "Wrong size on Ustat_container");
static_assert(offsetof(Ustat_container, __verse_0xD5D3D4B0__L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RgetStatValue_L_Nint_R) == 0x000028, "Member 'Ustat_container::__verse_0xD5D3D4B0__L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RgetStatValue_L_Nint_R' has a wrong offset!");
static_assert(offsetof(Ustat_container, __verse_0x204575BE__L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RsetStatValue_L_Nint_M_Nint_R) == 0x000034, "Member 'Ustat_container::__verse_0x204575BE__L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RsetStatValue_L_Nint_M_Nint_R' has a wrong offset!");
static_assert(offsetof(Ustat_container, __verse_0xFC20F645__L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RincrementStat_L_Nint_M_Nint_R) == 0x000040, "Member 'Ustat_container::__verse_0xFC20F645__L_2fFortnite_2ecom_2fVerseFortnite_2fstat__container_N_RincrementStat_L_Nint_M_Nint_R' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.hud_map_component
// 0x0040 (0x0198 - 0x0158)
class Uhud_map_component final : public UHUDMapComponentBase
{
public:
	TDelegate<void(const struct VerseFortnite_0::Ftuple_Lvector3_Mvector3_R& __verse_0xB2CDDD72_Argument)> __verse_0x1693B434__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RSetMapBounds_L_Nvector3_M_Nvector3_R; // 0x0158(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xD7419A0D__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RClearMapBounds; // 0x0164(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x3968ACAA__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RShow; // 0x0170(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x37B28F2A__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RHide; // 0x017C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TArray<class Uplayer_component*>& __verse_0xB2CDDD72_Argument)> __verse_0x853433D6__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RRestrictMessageToPlayers_L_N_Kplayer__component_R; // 0x0188(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RClearMapBounds(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RHide(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RRestrictMessageToPlayers_L_N_Kplayer__component_R(const TArray<class Uplayer_component*>& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RSetMapBounds_L_Nvector3_M_Nvector3_R(const struct VerseFortnite_0::Ftuple_Lvector3_Mvector3_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RShow(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"hud_map_component">();
	}
	static class Uhud_map_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uhud_map_component>();
	}
};
static_assert(alignof(Uhud_map_component) == 0x000008, "Wrong alignment on Uhud_map_component");
static_assert(sizeof(Uhud_map_component) == 0x000198, "Wrong size on Uhud_map_component");
static_assert(offsetof(Uhud_map_component, __verse_0x1693B434__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RSetMapBounds_L_Nvector3_M_Nvector3_R) == 0x000158, "Member 'Uhud_map_component::__verse_0x1693B434__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RSetMapBounds_L_Nvector3_M_Nvector3_R' has a wrong offset!");
static_assert(offsetof(Uhud_map_component, __verse_0xD7419A0D__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RClearMapBounds) == 0x000164, "Member 'Uhud_map_component::__verse_0xD7419A0D__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RClearMapBounds' has a wrong offset!");
static_assert(offsetof(Uhud_map_component, __verse_0x3968ACAA__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RShow) == 0x000170, "Member 'Uhud_map_component::__verse_0x3968ACAA__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RShow' has a wrong offset!");
static_assert(offsetof(Uhud_map_component, __verse_0x37B28F2A__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RHide) == 0x00017C, "Member 'Uhud_map_component::__verse_0x37B28F2A__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RHide' has a wrong offset!");
static_assert(offsetof(Uhud_map_component, __verse_0x853433D6__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RRestrictMessageToPlayers_L_N_Kplayer__component_R) == 0x000188, "Member 'Uhud_map_component::__verse_0x853433D6__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__map__component_N_RRestrictMessageToPlayers_L_N_Kplayer__component_R' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.fortnite_building_component
// 0x0048 (0x00A8 - 0x0060)
class Ufortnite_building_component final : public UEntityComponent
{
public:
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x3D2D19F1__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RwasPlayerBuilt; // 0x0060(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x75634E43__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RcanBeDamaged; // 0x006C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x50178CD3__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RcanBeReplaced; // 0x0078(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(uint8 __verse_0xB2CDDD72_Argument)> __verse_0x58548D00__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R; // 0x0084(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(uint8 __verse_0xB2CDDD72_Argument)> __verse_0xBCD3ABD7__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R; // 0x0090(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0xC];                                       // 0x009C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RcanBeDamaged(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RcanBeReplaced(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RwasPlayerBuilt(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"fortnite_building_component">();
	}
	static class Ufortnite_building_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufortnite_building_component>();
	}
};
static_assert(alignof(Ufortnite_building_component) == 0x000008, "Wrong alignment on Ufortnite_building_component");
static_assert(sizeof(Ufortnite_building_component) == 0x0000A8, "Wrong size on Ufortnite_building_component");
static_assert(offsetof(Ufortnite_building_component, __verse_0x3D2D19F1__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RwasPlayerBuilt) == 0x000060, "Member 'Ufortnite_building_component::__verse_0x3D2D19F1__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RwasPlayerBuilt' has a wrong offset!");
static_assert(offsetof(Ufortnite_building_component, __verse_0x75634E43__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RcanBeDamaged) == 0x00006C, "Member 'Ufortnite_building_component::__verse_0x75634E43__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RcanBeDamaged' has a wrong offset!");
static_assert(offsetof(Ufortnite_building_component, __verse_0x50178CD3__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RcanBeReplaced) == 0x000078, "Member 'Ufortnite_building_component::__verse_0x50178CD3__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RcanBeReplaced' has a wrong offset!");
static_assert(offsetof(Ufortnite_building_component, __verse_0x58548D00__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R) == 0x000084, "Member 'Ufortnite_building_component::__verse_0x58548D00__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R' has a wrong offset!");
static_assert(offsetof(Ufortnite_building_component, __verse_0xBCD3ABD7__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R) == 0x000090, "Member 'Ufortnite_building_component::__verse_0xBCD3ABD7__L_2fFortnite_2ecom_2fVerseFortnite_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R' has a wrong offset!");

// SolarisGeneratedClass VerseFortnite.hud_message_component
// 0x0030 (0x0160 - 0x0130)
class Uhud_message_component final : public UHUDMessageComponentBase
{
public:
	TDelegate<void(FVerseStringProperty_ __verse_0xB2CDDD72_Argument)> __verse_0x30BE8FBC__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RShowMessage_L_N_Kchar_R; // 0x0130(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x13757749__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RHide; // 0x013C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TArray<class Uplayer_component*>& __verse_0xB2CDDD72_Argument)> __verse_0x9DB24A0D__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RRestrictMessageToPlayers_L_N_Kplayer__component_R; // 0x0148(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(FVerseStringProperty_ __verse_0xB2CDDD72_Argument)> __verse_0xD990F02D__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RSetWidget_L_N_Kchar_R; // 0x0154(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RHide(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RRestrictMessageToPlayers_L_N_Kplayer__component_R(const TArray<class Uplayer_component*>& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RSetWidget_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RShowMessage_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"hud_message_component">();
	}
	static class Uhud_message_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uhud_message_component>();
	}
};
static_assert(alignof(Uhud_message_component) == 0x000008, "Wrong alignment on Uhud_message_component");
static_assert(sizeof(Uhud_message_component) == 0x000160, "Wrong size on Uhud_message_component");
static_assert(offsetof(Uhud_message_component, __verse_0x30BE8FBC__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RShowMessage_L_N_Kchar_R) == 0x000130, "Member 'Uhud_message_component::__verse_0x30BE8FBC__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RShowMessage_L_N_Kchar_R' has a wrong offset!");
static_assert(offsetof(Uhud_message_component, __verse_0x13757749__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RHide) == 0x00013C, "Member 'Uhud_message_component::__verse_0x13757749__L_2fFortnite_2ecom_2fVerseFortnite_2fhud__message__component_N_RHide' has a wrong offset!");
