#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteDynamicUI

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct VerseFortniteDynamicUI.GhostWidgetBaseCreationData
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FGhostWidgetBaseCreationData final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGhostWidgetBaseCreationData) == 0x000008, "Wrong alignment on FGhostWidgetBaseCreationData");
static_assert(sizeof(FGhostWidgetBaseCreationData) == 0x000060, "Wrong size on FGhostWidgetBaseCreationData");

// ScriptStruct VerseFortniteDynamicUI.SceneCatalogEntryClass
// 0x0008 (0x0008 - 0x0000)
struct FSceneCatalogEntryClass final
{
public:
	class UDynamicUIScene*                        DynamicUIScene;                                    // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSceneCatalogEntryClass) == 0x000008, "Wrong alignment on FSceneCatalogEntryClass");
static_assert(sizeof(FSceneCatalogEntryClass) == 0x000008, "Wrong size on FSceneCatalogEntryClass");
static_assert(offsetof(FSceneCatalogEntryClass, DynamicUIScene) == 0x000000, "Member 'FSceneCatalogEntryClass::DynamicUIScene' has a wrong offset!");

// ScriptStruct VerseFortniteDynamicUI.WidgetCatalogEntryClass
// 0x0028 (0x0028 - 0x0000)
struct FWidgetCatalogEntryClass final
{
public:
	TSoftClassPtr<class UClass>                   WidgetClass;                                       // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWidgetCatalogEntryClass) == 0x000008, "Wrong alignment on FWidgetCatalogEntryClass");
static_assert(sizeof(FWidgetCatalogEntryClass) == 0x000028, "Wrong size on FWidgetCatalogEntryClass");
static_assert(offsetof(FWidgetCatalogEntryClass, WidgetClass) == 0x000000, "Member 'FWidgetCatalogEntryClass::WidgetClass' has a wrong offset!");

}

