#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseEngine_0

#include "Basic.hpp"

#include "SolarisInterop_0_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseEngine_0_structs.hpp"
#include "Engine_classes.hpp"
#include "VerseEngine_classes.hpp"


namespace SDK
{

// SolarisGeneratedClass VerseEngine.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseEngine_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SolarisGeneratedClass VerseEngine.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseEngine_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseEngine_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseEngine_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseEngine_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseEngine_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseEngine_0::U_SolarisSignatureFunctionOuter");

// SolarisGeneratedClass VerseEngine.Asset
// 0x0048 (0x00B0 - 0x0068)
class UAsset : public UVerseAssetPtr
{
public:
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x9ABBB381__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RSyncLoad; // 0x0068(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x3A1A8FE4__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RAsync__Load; // 0x0074(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x85D44999__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RGetAsyncLoadEvent; // 0x0080(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x277424A2__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RGetAssetType; // 0x008C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         __verse_0xD636D109_AssetPath;                      // 0x00A0(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _InitCDO();
	void _InitInstance();
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RAsync__Load(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RGetAssetType(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RGetAsyncLoadEvent(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RSyncLoad(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Asset">();
	}
	static class UAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsset>();
	}
};
static_assert(alignof(UAsset) == 0x000008, "Wrong alignment on UAsset");
static_assert(sizeof(UAsset) == 0x0000B0, "Wrong size on UAsset");
static_assert(offsetof(UAsset, __verse_0x9ABBB381__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RSyncLoad) == 0x000068, "Member 'UAsset::__verse_0x9ABBB381__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RSyncLoad' has a wrong offset!");
static_assert(offsetof(UAsset, __verse_0x3A1A8FE4__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RAsync__Load) == 0x000074, "Member 'UAsset::__verse_0x3A1A8FE4__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RAsync__Load' has a wrong offset!");
static_assert(offsetof(UAsset, __verse_0x85D44999__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RGetAsyncLoadEvent) == 0x000080, "Member 'UAsset::__verse_0x85D44999__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RGetAsyncLoadEvent' has a wrong offset!");
static_assert(offsetof(UAsset, __verse_0x277424A2__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RGetAssetType) == 0x00008C, "Member 'UAsset::__verse_0x277424A2__L_2fVerse_2eorg_2fVerseEngine_2fAssets_2fasset_N_RGetAssetType' has a wrong offset!");
static_assert(offsetof(UAsset, __verse_0xD636D109_AssetPath) == 0x0000A0, "Member 'UAsset::__verse_0xD636D109_AssetPath' has a wrong offset!");

// SolarisGeneratedClass VerseEngine.client_asset
// 0x0000 (0x00B0 - 0x00B0)
class Uclient_asset : public UAsset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"client_asset">();
	}
	static class Uclient_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uclient_asset>();
	}
};
static_assert(alignof(Uclient_asset) == 0x000008, "Wrong alignment on Uclient_asset");
static_assert(sizeof(Uclient_asset) == 0x0000B0, "Wrong size on Uclient_asset");

// SolarisGeneratedClass VerseEngine.Animation
// 0x0000 (0x00B0 - 0x00B0)
class UAnimation final : public UAsset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Animation">();
	}
	static class UAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimation>();
	}
};
static_assert(alignof(UAnimation) == 0x000008, "Wrong alignment on UAnimation");
static_assert(sizeof(UAnimation) == 0x0000B0, "Wrong size on UAnimation");

// SolarisGeneratedClass VerseEngine.animation_blueprint
// 0x0000 (0x00B0 - 0x00B0)
class Uanimation_blueprint final : public UAsset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"animation_blueprint">();
	}
	static class Uanimation_blueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uanimation_blueprint>();
	}
};
static_assert(alignof(Uanimation_blueprint) == 0x000008, "Wrong alignment on Uanimation_blueprint");
static_assert(sizeof(Uanimation_blueprint) == 0x0000B0, "Wrong size on Uanimation_blueprint");

// SolarisGeneratedClass VerseEngine.animation_instance
// 0x0000 (0x00B0 - 0x00B0)
class Uanimation_instance final : public UAsset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"animation_instance">();
	}
	static class Uanimation_instance* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uanimation_instance>();
	}
};
static_assert(alignof(Uanimation_instance) == 0x000008, "Wrong alignment on Uanimation_instance");
static_assert(sizeof(Uanimation_instance) == 0x0000B0, "Wrong size on Uanimation_instance");

// SolarisGeneratedClass VerseEngine.Utils
// 0x0000 (0x0028 - 0x0028)
class UUtils final : public UObject
{
public:
	static double _L_2fVerse_2eorg_2fVerseEngine_2fUtils_N_RGetServerTime(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static class Utask* Wait_L_Nfloat_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, double __verse_0xB2CDDD72_Argument);
	static class Utask* WaitForever(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static class Utask* WaitNext(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Utils">();
	}
	static class UUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUtils>();
	}
};
static_assert(alignof(UUtils) == 0x000008, "Wrong alignment on UUtils");
static_assert(sizeof(UUtils) == 0x000028, "Wrong size on UUtils");

// SolarisGeneratedClass VerseEngine.camera_animation
// 0x0000 (0x00B0 - 0x00B0)
class Ucamera_animation final : public Uclient_asset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"camera_animation">();
	}
	static class Ucamera_animation* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ucamera_animation>();
	}
};
static_assert(alignof(Ucamera_animation) == 0x000008, "Wrong alignment on Ucamera_animation");
static_assert(sizeof(Ucamera_animation) == 0x0000B0, "Wrong size on Ucamera_animation");

// SolarisGeneratedClass VerseEngine.Context_Utils$Wait_L_Nfloat_R
// 0x0008 (0x0138 - 0x0130)
class UContext_Utils_Wait_L_Nfloat_R final : public Utask
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0130(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_Utils$Wait_L_Nfloat_R">();
	}
	static class UContext_Utils_Wait_L_Nfloat_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_Utils_Wait_L_Nfloat_R>();
	}
};
static_assert(alignof(UContext_Utils_Wait_L_Nfloat_R) == 0x000008, "Wrong alignment on UContext_Utils_Wait_L_Nfloat_R");
static_assert(sizeof(UContext_Utils_Wait_L_Nfloat_R) == 0x000138, "Wrong size on UContext_Utils_Wait_L_Nfloat_R");
static_assert(offsetof(UContext_Utils_Wait_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000130, "Member 'UContext_Utils_Wait_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// SolarisGeneratedClass VerseEngine.Context_Utils$WaitForever
// 0x0008 (0x0138 - 0x0130)
class UContext_Utils_WaitForever final : public Utask
{
public:
	struct VerseEngine_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0130(0x0001)(Parm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_Utils$WaitForever">();
	}
	static class UContext_Utils_WaitForever* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_Utils_WaitForever>();
	}
};
static_assert(alignof(UContext_Utils_WaitForever) == 0x000008, "Wrong alignment on UContext_Utils_WaitForever");
static_assert(sizeof(UContext_Utils_WaitForever) == 0x000138, "Wrong size on UContext_Utils_WaitForever");
static_assert(offsetof(UContext_Utils_WaitForever, __verse_0xB2CDDD72_Argument) == 0x000130, "Member 'UContext_Utils_WaitForever::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// SolarisGeneratedClass VerseEngine.multicast_delegate_base
// 0x0000 (0x0028 - 0x0028)
class Umulticast_delegate_base : public UObject
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"multicast_delegate_base">();
	}
	static class Umulticast_delegate_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<Umulticast_delegate_base>();
	}
};
static_assert(alignof(Umulticast_delegate_base) == 0x000008, "Wrong alignment on Umulticast_delegate_base");
static_assert(sizeof(Umulticast_delegate_base) == 0x000028, "Wrong size on Umulticast_delegate_base");

// SolarisGeneratedClass VerseEngine.Context_Utils$WaitNext
// 0x0008 (0x0138 - 0x0130)
class UContext_Utils_WaitNext final : public Utask
{
public:
	struct VerseEngine_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0130(0x0001)(Parm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_Utils$WaitNext">();
	}
	static class UContext_Utils_WaitNext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_Utils_WaitNext>();
	}
};
static_assert(alignof(UContext_Utils_WaitNext) == 0x000008, "Wrong alignment on UContext_Utils_WaitNext");
static_assert(sizeof(UContext_Utils_WaitNext) == 0x000138, "Wrong size on UContext_Utils_WaitNext");
static_assert(offsetof(UContext_Utils_WaitNext, __verse_0xB2CDDD72_Argument) == 0x000130, "Member 'UContext_Utils_WaitNext::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// SolarisGeneratedClass VerseEngine.curve_float
// 0x0010 (0x00C8 - 0x00B8)
class Ucurve_float final : public UCurveFloat
{
public:
	TDelegate<void(double __verse_0xB2CDDD72_Argument)> __verse_0xC040E804__L_2fVerse_2eorg_2fVerseEngine_2fUtils_2fcurve__float_N_RGetValueAtTime_L_Nfloat_R; // 0x00B8(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	double _L_2fVerse_2eorg_2fVerseEngine_2fUtils_2fcurve__float_N_RGetValueAtTime_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"curve_float">();
	}
	static class Ucurve_float* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ucurve_float>();
	}
};
static_assert(alignof(Ucurve_float) == 0x000008, "Wrong alignment on Ucurve_float");
static_assert(sizeof(Ucurve_float) == 0x0000C8, "Wrong size on Ucurve_float");
static_assert(offsetof(Ucurve_float, __verse_0xC040E804__L_2fVerse_2eorg_2fVerseEngine_2fUtils_2fcurve__float_N_RGetValueAtTime_L_Nfloat_R) == 0x0000B8, "Member 'Ucurve_float::__verse_0xC040E804__L_2fVerse_2eorg_2fVerseEngine_2fUtils_2fcurve__float_N_RGetValueAtTime_L_Nfloat_R' has a wrong offset!");

// SolarisGeneratedClass VerseEngine.Diagnostics
// 0x0000 (0x0028 - 0x0028)
class UDiagnostics final : public UObject
{
public:
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RDrawDebugArrow_L_Nvector3_M_Nvector3_M_Narrow__draw__params_R(const struct Ftuple_Lvector3_Mvector3_Marrow__draw__params_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RDrawDebugBox_L_Nvector3_M_Nrotation_M_Nbox__draw__params_R(const struct Ftuple_Lvector3_Mrotation_Mbox__draw__params_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RDrawDebugCapsule_L_Nvector3_M_Nrotation_M_Ncapsule__draw__params_R(const struct Ftuple_Lvector3_Mrotation_Mcapsule__draw__params_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RDrawDebugCone_L_Nvector3_M_Nvector3_M_Ncone__draw__params_R(const struct Ftuple_Lvector3_Mvector3_Mcone__draw__params_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RDrawDebugCylinder_L_Nvector3_M_Nvector3_M_Ncylinder__draw__params_R(const struct Ftuple_Lvector3_Mvector3_Mcylinder__draw__params_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RDrawDebugLine_L_Nvector3_M_Nvector3_M_Nline__draw__params_R(const struct Ftuple_Lvector3_Mvector3_Mline__draw__params_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RDrawDebugPoint_L_Nvector3_M_Npoint__draw__params_R(const struct Ftuple_Lvector3_Mpoint__draw__params_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RDrawDebugSphere_L_Nvector3_M_Nsphere__draw__params_R(const struct Ftuple_Lvector3_Msphere__draw__params_R& __verse_0xB2CDDD72_Argument);
	static struct Flog_channel_handle _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_Rlog__channel__handle_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RLog_L_N_Kchar_M_Nlog__params_R(const struct Ftuple_L_Kchar_Mlog__params_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RLog_L_N_Kchar_M_Nlog__screen__params_R(const struct Ftuple_L_Kchar_Mlog__screen__params_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RLog_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RLogCallstack(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RLogCallstack_L_Nlog__params_R(const struct Flog_params& __verse_0xB2CDDD72_Argument);
	static void _L_2fVerse_2eorg_2fVerseEngine_2fDiagnostics_N_RLogCallstack_L_Nlog__screen__params_R(const struct Flog_screen_params& __verse_0xB2CDDD72_Argument);
	static struct Farrow_draw_params arrow_draw_params_Factory();
	static struct Fbox_draw_params box_draw_params_Factory();
	static struct Fcapsule_draw_params capsule_draw_params_Factory();
	static struct Fcone_draw_params cone_draw_params_Factory();
	static struct Fcylinder_draw_params cylinder_draw_params_Factory();
	static struct Fline_draw_params line_draw_params_Factory();
	static struct Flog_channel_handle log_channel_handle_Factory();
	static struct Flog_params log_params_Factory();
	static struct Flog_screen_params log_screen_params_Factory();
	static struct Fpoint_draw_params point_draw_params_Factory();
	static struct Fsphere_draw_params sphere_draw_params_Factory();

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Diagnostics">();
	}
	static class UDiagnostics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiagnostics>();
	}
};
static_assert(alignof(UDiagnostics) == 0x000008, "Wrong alignment on UDiagnostics");
static_assert(sizeof(UDiagnostics) == 0x000028, "Wrong size on UDiagnostics");

// SolarisGeneratedClass VerseEngine.skeletal_mesh
// 0x0000 (0x00B0 - 0x00B0)
class Uskeletal_mesh final : public UAsset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"skeletal_mesh">();
	}
	static class Uskeletal_mesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uskeletal_mesh>();
	}
};
static_assert(alignof(Uskeletal_mesh) == 0x000008, "Wrong alignment on Uskeletal_mesh");
static_assert(sizeof(Uskeletal_mesh) == 0x0000B0, "Wrong size on Uskeletal_mesh");

// SolarisGeneratedClass VerseEngine.entity_v
// 0x0080 (0x00A8 - 0x0028)
class Uentity_v final : public UObject
{
public:
	TDelegate<void(class UClass* __verse_0xB2CDDD72_Argument)> __verse_0x2FBDFBBE__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RAddComponent_L_Ntype_R; // 0x0028(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEntityComponent* __verse_0xB2CDDD72_Argument)> __verse_0xF11AABD6__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RRemoveComponent_L_Ncomponent_R; // 0x0034(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument)> __verse_0x1B640181__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R; // 0x0040(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument)> __verse_0xF013DDF6__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R; // 0x004C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UClass* __verse_0xB2CDDD72_Argument)> __verse_0x26B5E7D7__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetComponentOfType_L_Ntype_R; // 0x0058(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UClass* __verse_0xB2CDDD72_Argument)> __verse_0x385CD0D8__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetAllComponentsOfType_L_Ntype_R; // 0x0064(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UClass* __verse_0xB2CDDD72_Argument)> __verse_0x67B68277__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetOrCreateComponentOfType_L_Ntype_R; // 0x0070(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xD7624778__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RDestroy; // 0x007C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xFAEC1ABD__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetName; // 0x0088(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xAA8D42EC__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetFullname; // 0x0094(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RAddComponent_L_Ntype_R(class UClass* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RDestroy(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	TArray<class UEntityComponent*> _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetAllComponentsOfType_L_Ntype_R(class UClass* __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetComponentOfType_L_Ntype_R(class UClass* __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetFullname(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetName(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetOrCreateComponentOfType_L_Ntype_R(class UClass* __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RRemoveComponent_L_Ncomponent_R(class UEntityComponent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"entity_v">();
	}
	static class Uentity_v* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uentity_v>();
	}
};
static_assert(alignof(Uentity_v) == 0x000008, "Wrong alignment on Uentity_v");
static_assert(sizeof(Uentity_v) == 0x0000A8, "Wrong size on Uentity_v");
static_assert(offsetof(Uentity_v, __verse_0x2FBDFBBE__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RAddComponent_L_Ntype_R) == 0x000028, "Member 'Uentity_v::__verse_0x2FBDFBBE__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RAddComponent_L_Ntype_R' has a wrong offset!");
static_assert(offsetof(Uentity_v, __verse_0xF11AABD6__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RRemoveComponent_L_Ncomponent_R) == 0x000034, "Member 'Uentity_v::__verse_0xF11AABD6__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RRemoveComponent_L_Ncomponent_R' has a wrong offset!");
static_assert(offsetof(Uentity_v, __verse_0x1B640181__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R) == 0x000040, "Member 'Uentity_v::__verse_0x1B640181__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R' has a wrong offset!");
static_assert(offsetof(Uentity_v, __verse_0xF013DDF6__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R) == 0x00004C, "Member 'Uentity_v::__verse_0xF013DDF6__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R' has a wrong offset!");
static_assert(offsetof(Uentity_v, __verse_0x26B5E7D7__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetComponentOfType_L_Ntype_R) == 0x000058, "Member 'Uentity_v::__verse_0x26B5E7D7__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetComponentOfType_L_Ntype_R' has a wrong offset!");
static_assert(offsetof(Uentity_v, __verse_0x385CD0D8__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetAllComponentsOfType_L_Ntype_R) == 0x000064, "Member 'Uentity_v::__verse_0x385CD0D8__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetAllComponentsOfType_L_Ntype_R' has a wrong offset!");
static_assert(offsetof(Uentity_v, __verse_0x67B68277__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetOrCreateComponentOfType_L_Ntype_R) == 0x000070, "Member 'Uentity_v::__verse_0x67B68277__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetOrCreateComponentOfType_L_Ntype_R' has a wrong offset!");
static_assert(offsetof(Uentity_v, __verse_0xD7624778__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RDestroy) == 0x00007C, "Member 'Uentity_v::__verse_0xD7624778__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RDestroy' has a wrong offset!");
static_assert(offsetof(Uentity_v, __verse_0xFAEC1ABD__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetName) == 0x000088, "Member 'Uentity_v::__verse_0xFAEC1ABD__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetName' has a wrong offset!");
static_assert(offsetof(Uentity_v, __verse_0xAA8D42EC__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetFullname) == 0x000094, "Member 'Uentity_v::__verse_0xAA8D42EC__L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fentity__v_N_RGetFullname' has a wrong offset!");

// SolarisGeneratedClass VerseEngine.EntityHelpers
// 0x0000 (0x0028 - 0x0028)
class UEntityHelpers final : public UObject
{
public:
	static uint8 _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fEntityHelpers_N_RDestroyObject_L_Ncomponent_R(class UEntityComponent* __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_Ntype_R(const struct VerseEngine_0::Ftuple_Lcomponent_Mtype_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R(class UEntityComponent* __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fEntityHelpers_N_RSpawnEntity_L_Ntransform__v_M_N_Kchar_R(const struct VerseEngine_0::Ftuple_Ltransform__v_M_Kchar_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fEntityHelpers_N_RSpawnEntity_L_Nvector3_M_N_Kchar_R(const struct VerseEngine_0::Ftuple_Lvector3_M_Kchar_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity__V_2fEntityHelpers_N_RSpawnEntity_L_Nvector3_M_Nvector3_M_Nvector3_M_N_Kchar_R(const struct Ftuple_Lvector3_Mvector3_Mvector3_M_Kchar_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityHelpers">();
	}
	static class UEntityHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityHelpers>();
	}
};
static_assert(alignof(UEntityHelpers) == 0x000008, "Wrong alignment on UEntityHelpers");
static_assert(sizeof(UEntityHelpers) == 0x000028, "Wrong size on UEntityHelpers");

// SolarisGeneratedClass VerseEngine.VerseEngine
// 0x0000 (0x0028 - 0x0028)
class UVerseEngine final : public UObject
{
public:
	static struct Fdelegate_handle _L_2fVerse_2eorg_2fVerseEngine_N_RInvalidDelegateHandle(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static struct Fdelegate_handle delegate_handle_Factory();

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine">();
	}
	static class UVerseEngine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine>();
	}
};
static_assert(alignof(UVerseEngine) == 0x000008, "Wrong alignment on UVerseEngine");
static_assert(sizeof(UVerseEngine) == 0x000028, "Wrong size on UVerseEngine");

// SolarisGeneratedClass VerseEngine.font_v
// 0x0000 (0x00B0 - 0x00B0)
class Ufont_v final : public Uclient_asset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"font_v">();
	}
	static class Ufont_v* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufont_v>();
	}
};
static_assert(alignof(Ufont_v) == 0x000008, "Wrong alignment on Ufont_v");
static_assert(sizeof(Ufont_v) == 0x0000B0, "Wrong size on Ufont_v");

// SolarisGeneratedClass VerseEngine.level_v
// 0x0000 (0x00B0 - 0x00B0)
class Ulevel_v final : public UAsset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"level_v">();
	}
	static class Ulevel_v* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ulevel_v>();
	}
};
static_assert(alignof(Ulevel_v) == 0x000008, "Wrong alignment on Ulevel_v");
static_assert(sizeof(Ulevel_v) == 0x0000B0, "Wrong size on Ulevel_v");

// SolarisGeneratedClass VerseEngine.material_v
// 0x0000 (0x00B0 - 0x00B0)
class Umaterial_v final : public UAsset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"material_v">();
	}
	static class Umaterial_v* GetDefaultObj()
	{
		return GetDefaultObjImpl<Umaterial_v>();
	}
};
static_assert(alignof(Umaterial_v) == 0x000008, "Wrong alignment on Umaterial_v");
static_assert(sizeof(Umaterial_v) == 0x0000B0, "Wrong size on Umaterial_v");

// SolarisGeneratedClass VerseEngine.float_param_multicast_delegate
// 0x0070 (0x0098 - 0x0028)
class Ufloat_param_multicast_delegate final : public Umulticast_delegate_base
{
public:
	TDelegate<void(TDelegate<void(double __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument)> __verse_0x293177FD__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RSubscribe_L_Nfloat_Tvoid_R; // 0x0028(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument)> __verse_0x829159BF__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R; // 0x0034(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(double __verse_0xB2CDDD72_Argument)> __verse_0x6B5D31EF__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RBroadcast_L_Nfloat_R; // 0x0040(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xA5DA7548__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_REmpty; // 0x004C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x40];                                      // 0x0058(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	void _L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RBroadcast_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_REmpty(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Fdelegate_handle _L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RSubscribe_L_Nfloat_Tvoid_R(TDelegate<void(double __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"float_param_multicast_delegate">();
	}
	static class Ufloat_param_multicast_delegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufloat_param_multicast_delegate>();
	}
};
static_assert(alignof(Ufloat_param_multicast_delegate) == 0x000008, "Wrong alignment on Ufloat_param_multicast_delegate");
static_assert(sizeof(Ufloat_param_multicast_delegate) == 0x000098, "Wrong size on Ufloat_param_multicast_delegate");
static_assert(offsetof(Ufloat_param_multicast_delegate, __verse_0x293177FD__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RSubscribe_L_Nfloat_Tvoid_R) == 0x000028, "Member 'Ufloat_param_multicast_delegate::__verse_0x293177FD__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RSubscribe_L_Nfloat_Tvoid_R' has a wrong offset!");
static_assert(offsetof(Ufloat_param_multicast_delegate, __verse_0x829159BF__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R) == 0x000034, "Member 'Ufloat_param_multicast_delegate::__verse_0x829159BF__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R' has a wrong offset!");
static_assert(offsetof(Ufloat_param_multicast_delegate, __verse_0x6B5D31EF__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RBroadcast_L_Nfloat_R) == 0x000040, "Member 'Ufloat_param_multicast_delegate::__verse_0x6B5D31EF__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_RBroadcast_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(Ufloat_param_multicast_delegate, __verse_0xA5DA7548__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_REmpty) == 0x00004C, "Member 'Ufloat_param_multicast_delegate::__verse_0xA5DA7548__L_2fVerse_2eorg_2fVerseEngine_2ffloat__param__multicast__delegate_N_REmpty' has a wrong offset!");

// SolarisGeneratedClass VerseEngine.int_param_multicast_delegate
// 0x0070 (0x0098 - 0x0028)
class Uint_param_multicast_delegate final : public Umulticast_delegate_base
{
public:
	TDelegate<void(TDelegate<void(int64 __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument)> __verse_0x0850D54C__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RSubscribe_L_Nint_Tvoid_R; // 0x0028(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument)> __verse_0x88DBBD25__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R; // 0x0034(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int64 __verse_0xB2CDDD72_Argument)> __verse_0xC1CBC0EB__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RBroadcast_L_Nint_R; // 0x0040(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xBDE2F270__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_REmpty; // 0x004C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x40];                                      // 0x0058(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	void _L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RBroadcast_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_REmpty(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Fdelegate_handle _L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RSubscribe_L_Nint_Tvoid_R(TDelegate<void(int64 __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"int_param_multicast_delegate">();
	}
	static class Uint_param_multicast_delegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uint_param_multicast_delegate>();
	}
};
static_assert(alignof(Uint_param_multicast_delegate) == 0x000008, "Wrong alignment on Uint_param_multicast_delegate");
static_assert(sizeof(Uint_param_multicast_delegate) == 0x000098, "Wrong size on Uint_param_multicast_delegate");
static_assert(offsetof(Uint_param_multicast_delegate, __verse_0x0850D54C__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RSubscribe_L_Nint_Tvoid_R) == 0x000028, "Member 'Uint_param_multicast_delegate::__verse_0x0850D54C__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RSubscribe_L_Nint_Tvoid_R' has a wrong offset!");
static_assert(offsetof(Uint_param_multicast_delegate, __verse_0x88DBBD25__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R) == 0x000034, "Member 'Uint_param_multicast_delegate::__verse_0x88DBBD25__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R' has a wrong offset!");
static_assert(offsetof(Uint_param_multicast_delegate, __verse_0xC1CBC0EB__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RBroadcast_L_Nint_R) == 0x000040, "Member 'Uint_param_multicast_delegate::__verse_0xC1CBC0EB__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_RBroadcast_L_Nint_R' has a wrong offset!");
static_assert(offsetof(Uint_param_multicast_delegate, __verse_0xBDE2F270__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_REmpty) == 0x00004C, "Member 'Uint_param_multicast_delegate::__verse_0xBDE2F270__L_2fVerse_2eorg_2fVerseEngine_2fint__param__multicast__delegate_N_REmpty' has a wrong offset!");

// SolarisGeneratedClass VerseEngine.logic_param_multicast_delegate
// 0x0070 (0x0098 - 0x0028)
class Ulogic_param_multicast_delegate final : public Umulticast_delegate_base
{
public:
	TDelegate<void(TDelegate<void(uint8 __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument)> __verse_0xD494000B__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RSubscribe_L_Nlogic_Tvoid_R; // 0x0028(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument)> __verse_0xE4BA5C54__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R; // 0x0034(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(uint8 __verse_0xB2CDDD72_Argument)> __verse_0x8894A3D6__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RBroadcast_L_Nlogic_R; // 0x0040(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x17DDF14D__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_REmpty; // 0x004C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x40];                                      // 0x0058(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	void _L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RBroadcast_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_REmpty(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Fdelegate_handle _L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RSubscribe_L_Nlogic_Tvoid_R(TDelegate<void(uint8 __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"logic_param_multicast_delegate">();
	}
	static class Ulogic_param_multicast_delegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ulogic_param_multicast_delegate>();
	}
};
static_assert(alignof(Ulogic_param_multicast_delegate) == 0x000008, "Wrong alignment on Ulogic_param_multicast_delegate");
static_assert(sizeof(Ulogic_param_multicast_delegate) == 0x000098, "Wrong size on Ulogic_param_multicast_delegate");
static_assert(offsetof(Ulogic_param_multicast_delegate, __verse_0xD494000B__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RSubscribe_L_Nlogic_Tvoid_R) == 0x000028, "Member 'Ulogic_param_multicast_delegate::__verse_0xD494000B__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RSubscribe_L_Nlogic_Tvoid_R' has a wrong offset!");
static_assert(offsetof(Ulogic_param_multicast_delegate, __verse_0xE4BA5C54__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R) == 0x000034, "Member 'Ulogic_param_multicast_delegate::__verse_0xE4BA5C54__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R' has a wrong offset!");
static_assert(offsetof(Ulogic_param_multicast_delegate, __verse_0x8894A3D6__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RBroadcast_L_Nlogic_R) == 0x000040, "Member 'Ulogic_param_multicast_delegate::__verse_0x8894A3D6__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_RBroadcast_L_Nlogic_R' has a wrong offset!");
static_assert(offsetof(Ulogic_param_multicast_delegate, __verse_0x17DDF14D__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_REmpty) == 0x00004C, "Member 'Ulogic_param_multicast_delegate::__verse_0x17DDF14D__L_2fVerse_2eorg_2fVerseEngine_2flogic__param__multicast__delegate_N_REmpty' has a wrong offset!");

// SolarisGeneratedClass VerseEngine.no_param_multicast_delegate
// 0x0070 (0x0098 - 0x0028)
class Uno_param_multicast_delegate final : public Umulticast_delegate_base
{
public:
	TDelegate<void(TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument)> __verse_0xE06F97E3__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RSubscribe_L_Ntuple_L_R_Tvoid_R; // 0x0028(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument)> __verse_0x009FF9C3__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R; // 0x0034(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xF1D0E58D__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RBroadcast; // 0x0040(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x60A381FF__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_REmpty; // 0x004C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x40];                                      // 0x0058(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	void _L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RBroadcast(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_REmpty(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Fdelegate_handle _L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RSubscribe_L_Ntuple_L_R_Tvoid_R(TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"no_param_multicast_delegate">();
	}
	static class Uno_param_multicast_delegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uno_param_multicast_delegate>();
	}
};
static_assert(alignof(Uno_param_multicast_delegate) == 0x000008, "Wrong alignment on Uno_param_multicast_delegate");
static_assert(sizeof(Uno_param_multicast_delegate) == 0x000098, "Wrong size on Uno_param_multicast_delegate");
static_assert(offsetof(Uno_param_multicast_delegate, __verse_0xE06F97E3__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RSubscribe_L_Ntuple_L_R_Tvoid_R) == 0x000028, "Member 'Uno_param_multicast_delegate::__verse_0xE06F97E3__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RSubscribe_L_Ntuple_L_R_Tvoid_R' has a wrong offset!");
static_assert(offsetof(Uno_param_multicast_delegate, __verse_0x009FF9C3__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R) == 0x000034, "Member 'Uno_param_multicast_delegate::__verse_0x009FF9C3__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R' has a wrong offset!");
static_assert(offsetof(Uno_param_multicast_delegate, __verse_0xF1D0E58D__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RBroadcast) == 0x000040, "Member 'Uno_param_multicast_delegate::__verse_0xF1D0E58D__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_RBroadcast' has a wrong offset!");
static_assert(offsetof(Uno_param_multicast_delegate, __verse_0x60A381FF__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_REmpty) == 0x00004C, "Member 'Uno_param_multicast_delegate::__verse_0x60A381FF__L_2fVerse_2eorg_2fVerseEngine_2fno__param__multicast__delegate_N_REmpty' has a wrong offset!");

// SolarisGeneratedClass VerseEngine.particle_system
// 0x0000 (0x00B0 - 0x00B0)
class Uparticle_system final : public Uclient_asset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"particle_system">();
	}
	static class Uparticle_system* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uparticle_system>();
	}
};
static_assert(alignof(Uparticle_system) == 0x000008, "Wrong alignment on Uparticle_system");
static_assert(sizeof(Uparticle_system) == 0x0000B0, "Wrong size on Uparticle_system");

// SolarisGeneratedClass VerseEngine.sound
// 0x0000 (0x00B0 - 0x00B0)
class Usound final : public Uclient_asset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"sound">();
	}
	static class Usound* GetDefaultObj()
	{
		return GetDefaultObjImpl<Usound>();
	}
};
static_assert(alignof(Usound) == 0x000008, "Wrong alignment on Usound");
static_assert(sizeof(Usound) == 0x0000B0, "Wrong size on Usound");

// SolarisGeneratedClass VerseEngine.static_mesh
// 0x0000 (0x00B0 - 0x00B0)
class Ustatic_mesh final : public UAsset
{
public:
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"static_mesh">();
	}
	static class Ustatic_mesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ustatic_mesh>();
	}
};
static_assert(alignof(Ustatic_mesh) == 0x000008, "Wrong alignment on Ustatic_mesh");
static_assert(sizeof(Ustatic_mesh) == 0x0000B0, "Wrong size on Ustatic_mesh");

// SolarisGeneratedClass VerseEngine.string_param_multicast_delegate
// 0x0070 (0x0098 - 0x0028)
class Ustring_param_multicast_delegate final : public Umulticast_delegate_base
{
public:
	TDelegate<void(TDelegate<void(FVerseStringProperty_ __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument)> __verse_0x4A31289C__L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_RSubscribe_L_N_Kchar_Tvoid_R; // 0x0028(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument)> __verse_0xF128C0E1__L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R; // 0x0034(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(FVerseStringProperty_ __verse_0xB2CDDD72_Argument)> __verse_0xF77DF54F__L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_RBroadcast_L_N_Kchar_R; // 0x0040(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xCA9885D5__L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_REmpty; // 0x004C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x40];                                      // 0x0058(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	void _L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_RBroadcast_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_REmpty(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Fdelegate_handle _L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_RSubscribe_L_N_Kchar_Tvoid_R(TDelegate<void(FVerseStringProperty_ __verse_0xB2CDDD72_Argument)> __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R(const struct Fdelegate_handle& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"string_param_multicast_delegate">();
	}
	static class Ustring_param_multicast_delegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ustring_param_multicast_delegate>();
	}
};
static_assert(alignof(Ustring_param_multicast_delegate) == 0x000008, "Wrong alignment on Ustring_param_multicast_delegate");
static_assert(sizeof(Ustring_param_multicast_delegate) == 0x000098, "Wrong size on Ustring_param_multicast_delegate");
static_assert(offsetof(Ustring_param_multicast_delegate, __verse_0x4A31289C__L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_RSubscribe_L_N_Kchar_Tvoid_R) == 0x000028, "Member 'Ustring_param_multicast_delegate::__verse_0x4A31289C__L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_RSubscribe_L_N_Kchar_Tvoid_R' has a wrong offset!");
static_assert(offsetof(Ustring_param_multicast_delegate, __verse_0xF128C0E1__L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R) == 0x000034, "Member 'Ustring_param_multicast_delegate::__verse_0xF128C0E1__L_2fVerse_2eorg_2fVerseEngine_2fstring__param__multicast__delegate_N_RUnsubscribe_L_Ndelegate__handle_R' has a wrong offset!");
