#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VGameplayRst

#include "Basic.hpp"


namespace SDK::Params
{

// Function VGameplayRst.VerseLevelStreamingPlayerControllerRpcComponent.TellServer_ClientLevelLoaded
// 0x0008 (0x0008 - 0x0000)
struct VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelLoaded final
{
public:
	class UVerseLevelStreamingComponentBase*      LevelStreamingComponent;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelLoaded) == 0x000008, "Wrong alignment on VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelLoaded");
static_assert(sizeof(VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelLoaded) == 0x000008, "Wrong size on VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelLoaded");
static_assert(offsetof(VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelLoaded, LevelStreamingComponent) == 0x000000, "Member 'VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelLoaded::LevelStreamingComponent' has a wrong offset!");

// Function VGameplayRst.VerseLevelStreamingPlayerControllerRpcComponent.TellServer_ClientLevelUnloaded
// 0x0008 (0x0008 - 0x0000)
struct VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelUnloaded final
{
public:
	class UVerseLevelStreamingComponentBase*      LevelStreamingComponent;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelUnloaded) == 0x000008, "Wrong alignment on VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelUnloaded");
static_assert(sizeof(VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelUnloaded) == 0x000008, "Wrong size on VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelUnloaded");
static_assert(offsetof(VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelUnloaded, LevelStreamingComponent) == 0x000000, "Member 'VerseLevelStreamingPlayerControllerRpcComponent_TellServer_ClientLevelUnloaded::LevelStreamingComponent' has a wrong offset!");

}

