#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VGameplayRst_0

#include "Basic.hpp"

#include "VGameplayRst_0_structs.hpp"
#include "Verse_0_structs.hpp"
#include "Verse_structs.hpp"


namespace SDK::Params
{

// Function VGameplayRst.Context_dynamic_activation_component$WaitForTransitionComplete.Update
// 0x0008 (0x0008 - 0x0000)
struct Context_dynamic_activation_component_WaitForTransitionComplete_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Context_dynamic_activation_component_WaitForTransitionComplete_Update) == 0x000008, "Wrong alignment on Context_dynamic_activation_component_WaitForTransitionComplete_Update");
static_assert(sizeof(Context_dynamic_activation_component_WaitForTransitionComplete_Update) == 0x000008, "Wrong size on Context_dynamic_activation_component_WaitForTransitionComplete_Update");
static_assert(offsetof(Context_dynamic_activation_component_WaitForTransitionComplete_Update, RetVal) == 0x000000, "Member 'Context_dynamic_activation_component_WaitForTransitionComplete_Update::RetVal' has a wrong offset!");

// Function VGameplayRst.tagged_object_finder_entry.$InitCDO
// 0x0018 (0x0018 - 0x0000)
struct tagged_object_finder_entry__InitCDO final
{
public:
	class Ugameplay_tag_container*                _TEMP_0;                                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ugameplay_tag_container*                _TEMP_1;                                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ugameplay_tag_container*                _TEMP_2;                                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(tagged_object_finder_entry__InitCDO) == 0x000008, "Wrong alignment on tagged_object_finder_entry__InitCDO");
static_assert(sizeof(tagged_object_finder_entry__InitCDO) == 0x000018, "Wrong size on tagged_object_finder_entry__InitCDO");
static_assert(offsetof(tagged_object_finder_entry__InitCDO, _TEMP_0) == 0x000000, "Member 'tagged_object_finder_entry__InitCDO::_TEMP_0' has a wrong offset!");
static_assert(offsetof(tagged_object_finder_entry__InitCDO, _TEMP_1) == 0x000008, "Member 'tagged_object_finder_entry__InitCDO::_TEMP_1' has a wrong offset!");
static_assert(offsetof(tagged_object_finder_entry__InitCDO, _TEMP_2) == 0x000010, "Member 'tagged_object_finder_entry__InitCDO::_TEMP_2' has a wrong offset!");

// Function VGameplayRst.scale_component._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__scalable_N_RSetScale_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__scalable_N_RSetScale_L_Nvector3_R final
{
public:
	struct Fvector3                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__scalable_N_RSetScale_L_Nvector3_R) == 0x000008, "Wrong alignment on scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__scalable_N_RSetScale_L_Nvector3_R");
static_assert(sizeof(scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__scalable_N_RSetScale_L_Nvector3_R) == 0x000018, "Wrong size on scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__scalable_N_RSetScale_L_Nvector3_R");
static_assert(offsetof(scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__scalable_N_RSetScale_L_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__scalable_N_RSetScale_L_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.scale_component._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale
// 0x0020 (0x0020 - 0x0000)
struct scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct Fvector3                               RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale) == 0x000008, "Wrong alignment on scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale");
static_assert(sizeof(scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale) == 0x000020, "Wrong size on scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale");
static_assert(offsetof(scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale, RetVal) == 0x000008, "Member 'scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale::RetVal' has a wrong offset!");

// Function VGameplayRst.scale_component._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscale__component_N_RAddToScale_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscale__component_N_RAddToScale_L_Nvector3_R final
{
public:
	struct Fvector3                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscale__component_N_RAddToScale_L_Nvector3_R) == 0x000008, "Wrong alignment on scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscale__component_N_RAddToScale_L_Nvector3_R");
static_assert(sizeof(scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscale__component_N_RAddToScale_L_Nvector3_R) == 0x000018, "Wrong size on scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscale__component_N_RAddToScale_L_Nvector3_R");
static_assert(offsetof(scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscale__component_N_RAddToScale_L_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'scale_component__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscale__component_N_RAddToScale_L_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.Context_collision_component$WaitBeginOverlap.Update
// 0x0008 (0x0008 - 0x0000)
struct Context_collision_component_WaitBeginOverlap_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Context_collision_component_WaitBeginOverlap_Update) == 0x000008, "Wrong alignment on Context_collision_component_WaitBeginOverlap_Update");
static_assert(sizeof(Context_collision_component_WaitBeginOverlap_Update) == 0x000008, "Wrong size on Context_collision_component_WaitBeginOverlap_Update");
static_assert(offsetof(Context_collision_component_WaitBeginOverlap_Update, RetVal) == 0x000000, "Member 'Context_collision_component_WaitBeginOverlap_Update::RetVal' has a wrong offset!");

// Function VGameplayRst.scalable._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale
// 0x0020 (0x0020 - 0x0000)
struct scalable__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct Fvector3                               RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(scalable__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale) == 0x000008, "Wrong alignment on scalable__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale");
static_assert(sizeof(scalable__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale) == 0x000020, "Wrong size on scalable__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale");
static_assert(offsetof(scalable__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'scalable__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(scalable__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale, RetVal) == 0x000008, "Member 'scalable__L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale::RetVal' has a wrong offset!");

// Function VGameplayRst.Context_debug_command_component$__WaitForCommand_L_N_Kchar_R.Update
// 0x0008 (0x0008 - 0x0000)
struct Context_debug_command_component___WaitForCommand_L_N_Kchar_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Context_debug_command_component___WaitForCommand_L_N_Kchar_R_Update) == 0x000008, "Wrong alignment on Context_debug_command_component___WaitForCommand_L_N_Kchar_R_Update");
static_assert(sizeof(Context_debug_command_component___WaitForCommand_L_N_Kchar_R_Update) == 0x000008, "Wrong size on Context_debug_command_component___WaitForCommand_L_N_Kchar_R_Update");
static_assert(offsetof(Context_debug_command_component___WaitForCommand_L_N_Kchar_R_Update, RetVal) == 0x000000, "Member 'Context_debug_command_component___WaitForCommand_L_N_Kchar_R_Update::RetVal' has a wrong offset!");

// Function VGameplayRst.audio_component._L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RPlaySound
// 0x0001 (0x0001 - 0x0000)
struct audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RPlaySound final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RPlaySound) == 0x000001, "Wrong alignment on audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RPlaySound");
static_assert(sizeof(audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RPlaySound) == 0x000001, "Wrong size on audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RPlaySound");
static_assert(offsetof(audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RPlaySound, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RPlaySound::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.audio_component._L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R
// 0x0008 (0x0008 - 0x0000)
struct audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R final
{
public:
	class Usound*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R) == 0x000008, "Wrong alignment on audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R");
static_assert(sizeof(audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R) == 0x000008, "Wrong size on audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R");
static_assert(offsetof(audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.audio_component._L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RStopSound
// 0x0001 (0x0001 - 0x0000)
struct audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RStopSound final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RStopSound) == 0x000001, "Wrong alignment on audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RStopSound");
static_assert(sizeof(audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RStopSound) == 0x000001, "Wrong size on audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RStopSound");
static_assert(offsetof(audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RStopSound, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'audio_component__L_2fVerse_2eorg_2fVGameplayRst_2fAudio_2faudio__component_N_RStopSound::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.Context_collision_component$WaitHit.Update
// 0x0008 (0x0008 - 0x0000)
struct Context_collision_component_WaitHit_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Context_collision_component_WaitHit_Update) == 0x000008, "Wrong alignment on Context_collision_component_WaitHit_Update");
static_assert(sizeof(Context_collision_component_WaitHit_Update) == 0x000008, "Wrong size on Context_collision_component_WaitHit_Update");
static_assert(offsetof(Context_collision_component_WaitHit_Update, RetVal) == 0x000000, "Member 'Context_collision_component_WaitHit_Update::RetVal' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName) == 0x000008, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName) == 0x000018, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName, RetVal) == 0x000008, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName::RetVal' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode
// 0x0002 (0x0002 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	Ecollision_shape_mode                         RetVal;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode) == 0x000002, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode, RetVal) == 0x000001, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode::RetVal' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled
// 0x0002 (0x0002 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled) == 0x000002, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled
// 0x0002 (0x0002 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled) == 0x000002, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable
// 0x0002 (0x0002 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable) == 0x000002, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide
// 0x0002 (0x0002 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide) == 0x000002, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents
// 0x0002 (0x0002 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents) == 0x000002, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection
// 0x0002 (0x0002 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection) == 0x000002, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R final
{
public:
	struct Fvector3                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R) == 0x000008, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R) == 0x000018, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R final
{
public:
	struct VGameplayRst_0::Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R) == 0x000008, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R) == 0x000010, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R) == 0x000008, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R) == 0x000010, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R final
{
public:
	struct Fvector3                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R) == 0x000008, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R) == 0x000018, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R
// 0x0001 (0x0001 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R final
{
public:
	Edof_movement_mode                            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R) == 0x000001, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R) == 0x000001, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R) == 0x000001, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode
// 0x0001 (0x0001 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode) == 0x000001, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nstatic__mesh_R
// 0x0008 (0x0008 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nstatic__mesh_R final
{
public:
	class Ustatic_mesh*                           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nstatic__mesh_R) == 0x000008, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nstatic__mesh_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nstatic__mesh_R) == 0x000008, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nstatic__mesh_R");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nstatic__mesh_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nstatic__mesh_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R) == 0x000001, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R) == 0x000001, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R) == 0x000001, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R) == 0x000008, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R) == 0x000008, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R");
static_assert(offsetof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R) == 0x000001, "Wrong alignment on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R");
static_assert(sizeof(collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R) == 0x000001, "Wrong size on collision_component__L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R");

// Function VGameplayRst.collision_component.WaitBeginOverlap
// 0x0028 (0x0028 - 0x0000)
struct collision_component_WaitBeginOverlap final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(collision_component_WaitBeginOverlap) == 0x000008, "Wrong alignment on collision_component_WaitBeginOverlap");
static_assert(sizeof(collision_component_WaitBeginOverlap) == 0x000028, "Wrong size on collision_component_WaitBeginOverlap");
static_assert(offsetof(collision_component_WaitBeginOverlap, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'collision_component_WaitBeginOverlap::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(collision_component_WaitBeginOverlap, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'collision_component_WaitBeginOverlap::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(collision_component_WaitBeginOverlap, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'collision_component_WaitBeginOverlap::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(collision_component_WaitBeginOverlap, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'collision_component_WaitBeginOverlap::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(collision_component_WaitBeginOverlap, RetVal) == 0x000020, "Member 'collision_component_WaitBeginOverlap::RetVal' has a wrong offset!");

// Function VGameplayRst.collision_component.WaitEndOverlap
// 0x0028 (0x0028 - 0x0000)
struct collision_component_WaitEndOverlap final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(collision_component_WaitEndOverlap) == 0x000008, "Wrong alignment on collision_component_WaitEndOverlap");
static_assert(sizeof(collision_component_WaitEndOverlap) == 0x000028, "Wrong size on collision_component_WaitEndOverlap");
static_assert(offsetof(collision_component_WaitEndOverlap, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'collision_component_WaitEndOverlap::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(collision_component_WaitEndOverlap, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'collision_component_WaitEndOverlap::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(collision_component_WaitEndOverlap, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'collision_component_WaitEndOverlap::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(collision_component_WaitEndOverlap, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'collision_component_WaitEndOverlap::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(collision_component_WaitEndOverlap, RetVal) == 0x000020, "Member 'collision_component_WaitEndOverlap::RetVal' has a wrong offset!");

// Function VGameplayRst.collision_component.WaitHit
// 0x0028 (0x0028 - 0x0000)
struct collision_component_WaitHit final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(collision_component_WaitHit) == 0x000008, "Wrong alignment on collision_component_WaitHit");
static_assert(sizeof(collision_component_WaitHit) == 0x000028, "Wrong size on collision_component_WaitHit");
static_assert(offsetof(collision_component_WaitHit, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'collision_component_WaitHit::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(collision_component_WaitHit, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'collision_component_WaitHit::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(collision_component_WaitHit, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'collision_component_WaitHit::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(collision_component_WaitHit, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'collision_component_WaitHit::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(collision_component_WaitHit, RetVal) == 0x000020, "Member 'collision_component_WaitHit::RetVal' has a wrong offset!");

// Function VGameplayRst.Context_collision_component$WaitEndOverlap.Update
// 0x0008 (0x0008 - 0x0000)
struct Context_collision_component_WaitEndOverlap_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Context_collision_component_WaitEndOverlap_Update) == 0x000008, "Wrong alignment on Context_collision_component_WaitEndOverlap_Update");
static_assert(sizeof(Context_collision_component_WaitEndOverlap_Update) == 0x000008, "Wrong size on Context_collision_component_WaitEndOverlap_Update");
static_assert(offsetof(Context_collision_component_WaitEndOverlap_Update, RetVal) == 0x000000, "Member 'Context_collision_component_WaitEndOverlap_Update::RetVal' has a wrong offset!");

// Function VGameplayRst.Physics.hit_result$Factory
// 0x0040 (0x0040 - 0x0000)
struct Physics_hit_result_Factory final
{
public:
	struct Fhit_result                            RetVal;                                            // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Physics_hit_result_Factory) == 0x000008, "Wrong alignment on Physics_hit_result_Factory");
static_assert(sizeof(Physics_hit_result_Factory) == 0x000040, "Wrong size on Physics_hit_result_Factory");
static_assert(offsetof(Physics_hit_result_Factory, RetVal) == 0x000000, "Member 'Physics_hit_result_Factory::RetVal' has a wrong offset!");

// Function VGameplayRst.Context_dynamic_activation_component$WaitForTransitionStart.Update
// 0x0008 (0x0008 - 0x0000)
struct Context_dynamic_activation_component_WaitForTransitionStart_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Context_dynamic_activation_component_WaitForTransitionStart_Update) == 0x000008, "Wrong alignment on Context_dynamic_activation_component_WaitForTransitionStart_Update");
static_assert(sizeof(Context_dynamic_activation_component_WaitForTransitionStart_Update) == 0x000008, "Wrong size on Context_dynamic_activation_component_WaitForTransitionStart_Update");
static_assert(offsetof(Context_dynamic_activation_component_WaitForTransitionStart_Update, RetVal) == 0x000000, "Member 'Context_dynamic_activation_component_WaitForTransitionStart_Update::RetVal' has a wrong offset!");

// Function VGameplayRst.particle_system_component._L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RActivate
// 0x0001 (0x0001 - 0x0000)
struct particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RActivate final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RActivate) == 0x000001, "Wrong alignment on particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RActivate");
static_assert(sizeof(particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RActivate) == 0x000001, "Wrong size on particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RActivate");
static_assert(offsetof(particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RActivate, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RActivate::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.particle_system_component._L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RDeactivate
// 0x0001 (0x0001 - 0x0000)
struct particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RDeactivate final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RDeactivate) == 0x000001, "Wrong alignment on particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RDeactivate");
static_assert(sizeof(particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RDeactivate) == 0x000001, "Wrong size on particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RDeactivate");
static_assert(offsetof(particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RDeactivate, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'particle_system_component__L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RDeactivate::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.particle_system_component._L_2fVerse_2eorg_2fVGameplayRst_2fVFX_2fparticle__system__component_N_RSetParticleSystem_L_Nparticle__system_R
// 0x0008 (0x0008 - 0x0000)
