#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VictoryCrownsKillFeedExtension

#include "Basic.hpp"


namespace SDK::Params
{

// Function VictoryCrownsKillFeedExtension.VictoryCrownsKillFeedExtension_C.CheckForOverrideKillerStyle
// 0x0050 (0x0050 - 0x0000)
struct VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle final
{
public:
	const class AFortPlayerStateAthena*           KillerPlayerStateAthena;                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 KillerStyle;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameStateComponent_VictoryCrowns*  CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrownBearer_ReturnValue;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle) == 0x000008, "Wrong alignment on VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle");
static_assert(sizeof(VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle) == 0x000050, "Wrong size on VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle, KillerPlayerStateAthena) == 0x000000, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle::KillerPlayerStateAthena' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle, KillerStyle) == 0x000008, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle::KillerStyle' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle, ReturnValue) == 0x000018, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle::ReturnValue' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle, CallFunc_GetGameStateAthena_ReturnValue) == 0x000030, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle, CallFunc_IsCrownBearer_ReturnValue) == 0x000049, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideKillerStyle::CallFunc_IsCrownBearer_ReturnValue' has a wrong offset!");

// Function VictoryCrownsKillFeedExtension.VictoryCrownsKillFeedExtension_C.CheckForOverrideVictimStyle
// 0x0050 (0x0050 - 0x0000)
struct VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle final
{
public:
	const class AFortPlayerStateAthena*           VictimPlayerStateAthena;                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 VictimStyle;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameStateComponent_VictoryCrowns*  CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrownBearer_ReturnValue;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle) == 0x000008, "Wrong alignment on VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle");
static_assert(sizeof(VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle) == 0x000050, "Wrong size on VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle, VictimPlayerStateAthena) == 0x000000, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle::VictimPlayerStateAthena' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle, VictimStyle) == 0x000008, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle::VictimStyle' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle, ReturnValue) == 0x000018, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle::ReturnValue' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle, CallFunc_GetGameStateAthena_ReturnValue) == 0x000030, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle, CallFunc_IsCrownBearer_ReturnValue) == 0x000049, "Member 'VictoryCrownsKillFeedExtension_C_CheckForOverrideVictimStyle::CallFunc_IsCrownBearer_ReturnValue' has a wrong offset!");

}

