#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VictoryCrownFrontEndPawnComponent

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "VictoryCrownsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VictoryCrownFrontEndPawnComponent.VictoryCrownFrontEndPawnComponent_C
// 0x0020 (0x00D8 - 0x00B8)
class UVictoryCrownFrontEndPawnComponent_C final : public UFortPawnComponent_VictoryCrownsFrontEnd
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           CrownFXCueTag;                                     // 0x00C0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   AthenaPawn;                                        // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AccountHasCrown;                                   // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AppliedCrownFX;                                    // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VictoryCrownFrontEndPawnComponent(int32 EntryPoint);
	void OnStatChanged_80A6FD2F402F11C0D0A207ACE25F03A6(class FName StatName, int32 StatValue);
	void PlaylistChanged();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void UpdateForGCNL();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VictoryCrownFrontEndPawnComponent_C">();
	}
	static class UVictoryCrownFrontEndPawnComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVictoryCrownFrontEndPawnComponent_C>();
	}
};
static_assert(alignof(UVictoryCrownFrontEndPawnComponent_C) == 0x000008, "Wrong alignment on UVictoryCrownFrontEndPawnComponent_C");
static_assert(sizeof(UVictoryCrownFrontEndPawnComponent_C) == 0x0000D8, "Wrong size on UVictoryCrownFrontEndPawnComponent_C");
static_assert(offsetof(UVictoryCrownFrontEndPawnComponent_C, UberGraphFrame) == 0x0000B8, "Member 'UVictoryCrownFrontEndPawnComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVictoryCrownFrontEndPawnComponent_C, CrownFXCueTag) == 0x0000C0, "Member 'UVictoryCrownFrontEndPawnComponent_C::CrownFXCueTag' has a wrong offset!");
static_assert(offsetof(UVictoryCrownFrontEndPawnComponent_C, AthenaPawn) == 0x0000C8, "Member 'UVictoryCrownFrontEndPawnComponent_C::AthenaPawn' has a wrong offset!");
static_assert(offsetof(UVictoryCrownFrontEndPawnComponent_C, AccountHasCrown) == 0x0000D0, "Member 'UVictoryCrownFrontEndPawnComponent_C::AccountHasCrown' has a wrong offset!");
static_assert(offsetof(UVictoryCrownFrontEndPawnComponent_C, AppliedCrownFX) == 0x0000D1, "Member 'UVictoryCrownFrontEndPawnComponent_C::AppliedCrownFX' has a wrong offset!");

}

