#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VKDownloadOnDemandUI

#include "Basic.hpp"

#include "CommonUILegacy_classes.hpp"
#include "UMG_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectAssetTile
// 0x0010 (0x1040 - 0x1030)
class UDownloadOnDemandProjectAssetTile final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_Item;                                        // 0x1030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonNumericTextBlock*                NumericTextBlock_ItemCount;                        // 0x1038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectAssetTile">();
	}
	static class UDownloadOnDemandProjectAssetTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectAssetTile>();
	}
};
static_assert(alignof(UDownloadOnDemandProjectAssetTile) == 0x000010, "Wrong alignment on UDownloadOnDemandProjectAssetTile");
static_assert(sizeof(UDownloadOnDemandProjectAssetTile) == 0x001040, "Wrong size on UDownloadOnDemandProjectAssetTile");
static_assert(offsetof(UDownloadOnDemandProjectAssetTile, Image_Item) == 0x001030, "Member 'UDownloadOnDemandProjectAssetTile::Image_Item' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectAssetTile, NumericTextBlock_ItemCount) == 0x001038, "Member 'UDownloadOnDemandProjectAssetTile::NumericTextBlock_ItemCount' has a wrong offset!");

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectDetailsSidePanel
// 0x0010 (0x02C8 - 0x02B8)
class UDownloadOnDemandProjectDetailsSidePanel final : public UUserWidget
{
public:
	class UDownloadOnDemandProjectTile*           DownloadOnDemandProjectTile_CurrentProjectEntry;   // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCreativeContentBrowserItemInfo*        ContentBrowserItemInfo_ItemDetails;                // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectDetailsSidePanel">();
	}
	static class UDownloadOnDemandProjectDetailsSidePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectDetailsSidePanel>();
	}
};
static_assert(alignof(UDownloadOnDemandProjectDetailsSidePanel) == 0x000008, "Wrong alignment on UDownloadOnDemandProjectDetailsSidePanel");
static_assert(sizeof(UDownloadOnDemandProjectDetailsSidePanel) == 0x0002C8, "Wrong size on UDownloadOnDemandProjectDetailsSidePanel");
static_assert(offsetof(UDownloadOnDemandProjectDetailsSidePanel, DownloadOnDemandProjectTile_CurrentProjectEntry) == 0x0002B8, "Member 'UDownloadOnDemandProjectDetailsSidePanel::DownloadOnDemandProjectTile_CurrentProjectEntry' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectDetailsSidePanel, ContentBrowserItemInfo_ItemDetails) == 0x0002C0, "Member 'UDownloadOnDemandProjectDetailsSidePanel::ContentBrowserItemInfo_ItemDetails' has a wrong offset!");

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectTile
// 0x01D0 (0x1200 - 0x1030)
class UDownloadOnDemandProjectTile final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SelectedHighlightBrush;                            // 0x1030(0x00C0)(Edit, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            HoveredHighlightBrush;                             // 0x10F0(0x00C0)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bIsSelected;                                       // 0x11B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11B1[0x7];                                     // 0x11B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandProject*               Project;                                           // 0x11B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Item;                                        // 0x11C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Spinner;                                     // 0x11C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Error;                                       // 0x11D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_AddProject;                                  // 0x11D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_UpdatePending;                               // 0x11E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                               SizeBox_Label;                                     // 0x11E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_Label;                                   // 0x11F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonBorder*                          Border_Highlight;                                  // 0x11F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnLabelUpdated();
	void UpdateLabel(bool bShowLabel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectTile">();
	}
	static class UDownloadOnDemandProjectTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectTile>();
	}
};
static_assert(alignof(UDownloadOnDemandProjectTile) == 0x000010, "Wrong alignment on UDownloadOnDemandProjectTile");
static_assert(sizeof(UDownloadOnDemandProjectTile) == 0x001200, "Wrong size on UDownloadOnDemandProjectTile");
static_assert(offsetof(UDownloadOnDemandProjectTile, SelectedHighlightBrush) == 0x001030, "Member 'UDownloadOnDemandProjectTile::SelectedHighlightBrush' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectTile, HoveredHighlightBrush) == 0x0010F0, "Member 'UDownloadOnDemandProjectTile::HoveredHighlightBrush' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectTile, bIsSelected) == 0x0011B0, "Member 'UDownloadOnDemandProjectTile::bIsSelected' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectTile, Project) == 0x0011B8, "Member 'UDownloadOnDemandProjectTile::Project' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectTile, Image_Item) == 0x0011C0, "Member 'UDownloadOnDemandProjectTile::Image_Item' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectTile, Image_Spinner) == 0x0011C8, "Member 'UDownloadOnDemandProjectTile::Image_Spinner' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectTile, Image_Error) == 0x0011D0, "Member 'UDownloadOnDemandProjectTile::Image_Error' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectTile, Image_AddProject) == 0x0011D8, "Member 'UDownloadOnDemandProjectTile::Image_AddProject' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectTile, Image_UpdatePending) == 0x0011E0, "Member 'UDownloadOnDemandProjectTile::Image_UpdatePending' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectTile, SizeBox_Label) == 0x0011E8, "Member 'UDownloadOnDemandProjectTile::SizeBox_Label' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectTile, TextBlock_Label) == 0x0011F0, "Member 'UDownloadOnDemandProjectTile::TextBlock_Label' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandProjectTile, Border_Highlight) == 0x0011F8, "Member 'UDownloadOnDemandProjectTile::Border_Highlight' has a wrong offset!");

// Class VKDownloadOnDemandUI.DownloadOnDemandStatusFeed
// 0x0008 (0x02C0 - 0x02B8)
class UDownloadOnDemandStatusFeed final : public UUserWidget
{
public:
	class UFortDynamicEntryBox*                   EntryBox_DownloadStatusContainer;                  // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandStatusFeed">();
	}
	static class UDownloadOnDemandStatusFeed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandStatusFeed>();
	}
};
static_assert(alignof(UDownloadOnDemandStatusFeed) == 0x000008, "Wrong alignment on UDownloadOnDemandStatusFeed");
static_assert(sizeof(UDownloadOnDemandStatusFeed) == 0x0002C0, "Wrong size on UDownloadOnDemandStatusFeed");
static_assert(offsetof(UDownloadOnDemandStatusFeed, EntryBox_DownloadStatusContainer) == 0x0002B8, "Member 'UDownloadOnDemandStatusFeed::EntryBox_DownloadStatusContainer' has a wrong offset!");

// Class VKDownloadOnDemandUI.DownloadOnDemandStatusFeedLine
// 0x0008 (0x02C0 - 0x02B8)
class UDownloadOnDemandStatusFeedLine final : public UUserWidget
{
public:
	class UCommonTextBlock*                       TextBlock_DownloadStatus;                          // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandStatusFeedLine">();
	}
	static class UDownloadOnDemandStatusFeedLine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandStatusFeedLine>();
	}
};
static_assert(alignof(UDownloadOnDemandStatusFeedLine) == 0x000008, "Wrong alignment on UDownloadOnDemandStatusFeedLine");
static_assert(sizeof(UDownloadOnDemandStatusFeedLine) == 0x0002C0, "Wrong size on UDownloadOnDemandStatusFeedLine");
static_assert(offsetof(UDownloadOnDemandStatusFeedLine, TextBlock_DownloadStatus) == 0x0002B8, "Member 'UDownloadOnDemandStatusFeedLine::TextBlock_DownloadStatus' has a wrong offset!");

// Class VKDownloadOnDemandUI.DownloadOnDemandTabPanel
// 0x0090 (0x04D0 - 0x0440)
class UDownloadOnDemandTabPanel final : public UFortCreativeContentBrowserTabPanelBase
{
public:
	struct FDataTableRowHandle                    DownloadOnDemandProjectIDInputRowHandle;           // 0x0440(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    DownloadOnDemandAddProjectInputRowHandle;          // 0x0450(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    DownloadOnDemandManageProjectInputRowHandle;       // 0x0460(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDownloadOnDemandProjectDetailsSidePanel> DownloadOnDemandItemDetailsSidePanelClass;         // 0x0470(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDownloadOnDemandProject*               SelectedProject;                                   // 0x0478(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTileView*                        CommonTileView_ProjectTiles;                       // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTileView*                        CommonTileView_ProjectAssetTiles;                  // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        Switcher_DownloadOnDemandPanels;                   // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_ProjectTitle;                            // 0x0498(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_LinkCode;                                // 0x04A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_VersionNumber;                           // 0x04A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_Description;                             // 0x04B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_AddProject;                                 // 0x04B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_RemoveProject;                              // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_UpdateProject;                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void RemoveProject();
	void UpdateProject();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandTabPanel">();
	}
	static class UDownloadOnDemandTabPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandTabPanel>();
	}
};
static_assert(alignof(UDownloadOnDemandTabPanel) == 0x000008, "Wrong alignment on UDownloadOnDemandTabPanel");
static_assert(sizeof(UDownloadOnDemandTabPanel) == 0x0004D0, "Wrong size on UDownloadOnDemandTabPanel");
static_assert(offsetof(UDownloadOnDemandTabPanel, DownloadOnDemandProjectIDInputRowHandle) == 0x000440, "Member 'UDownloadOnDemandTabPanel::DownloadOnDemandProjectIDInputRowHandle' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, DownloadOnDemandAddProjectInputRowHandle) == 0x000450, "Member 'UDownloadOnDemandTabPanel::DownloadOnDemandAddProjectInputRowHandle' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, DownloadOnDemandManageProjectInputRowHandle) == 0x000460, "Member 'UDownloadOnDemandTabPanel::DownloadOnDemandManageProjectInputRowHandle' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, DownloadOnDemandItemDetailsSidePanelClass) == 0x000470, "Member 'UDownloadOnDemandTabPanel::DownloadOnDemandItemDetailsSidePanelClass' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, SelectedProject) == 0x000478, "Member 'UDownloadOnDemandTabPanel::SelectedProject' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, CommonTileView_ProjectTiles) == 0x000480, "Member 'UDownloadOnDemandTabPanel::CommonTileView_ProjectTiles' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, CommonTileView_ProjectAssetTiles) == 0x000488, "Member 'UDownloadOnDemandTabPanel::CommonTileView_ProjectAssetTiles' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, Switcher_DownloadOnDemandPanels) == 0x000490, "Member 'UDownloadOnDemandTabPanel::Switcher_DownloadOnDemandPanels' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, TextBlock_ProjectTitle) == 0x000498, "Member 'UDownloadOnDemandTabPanel::TextBlock_ProjectTitle' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, TextBlock_LinkCode) == 0x0004A0, "Member 'UDownloadOnDemandTabPanel::TextBlock_LinkCode' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, TextBlock_VersionNumber) == 0x0004A8, "Member 'UDownloadOnDemandTabPanel::TextBlock_VersionNumber' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, TextBlock_Description) == 0x0004B0, "Member 'UDownloadOnDemandTabPanel::TextBlock_Description' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, Button_AddProject) == 0x0004B8, "Member 'UDownloadOnDemandTabPanel::Button_AddProject' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, Button_RemoveProject) == 0x0004C0, "Member 'UDownloadOnDemandTabPanel::Button_RemoveProject' has a wrong offset!");
static_assert(offsetof(UDownloadOnDemandTabPanel, Button_UpdateProject) == 0x0004C8, "Member 'UDownloadOnDemandTabPanel::Button_UpdateProject' has a wrong offset!");

}

