#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VKEditUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function VKEditUI.VKDebugMessagesBase.BP_OnGameStateInitialized
// 0x0008 (0x0008 - 0x0000)
struct VKDebugMessagesBase_BP_OnGameStateInitialized final
{
public:
	class AFortGameState*                         GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VKDebugMessagesBase_BP_OnGameStateInitialized) == 0x000008, "Wrong alignment on VKDebugMessagesBase_BP_OnGameStateInitialized");
static_assert(sizeof(VKDebugMessagesBase_BP_OnGameStateInitialized) == 0x000008, "Wrong size on VKDebugMessagesBase_BP_OnGameStateInitialized");
static_assert(offsetof(VKDebugMessagesBase_BP_OnGameStateInitialized, GameState) == 0x000000, "Member 'VKDebugMessagesBase_BP_OnGameStateInitialized::GameState' has a wrong offset!");

// Function VKEditUI.VKDebugMessagesBase.HandleGameStateInitialized
// 0x0008 (0x0008 - 0x0000)
struct VKDebugMessagesBase_HandleGameStateInitialized final
{
public:
	class AFortGameState*                         GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VKDebugMessagesBase_HandleGameStateInitialized) == 0x000008, "Wrong alignment on VKDebugMessagesBase_HandleGameStateInitialized");
static_assert(sizeof(VKDebugMessagesBase_HandleGameStateInitialized) == 0x000008, "Wrong size on VKDebugMessagesBase_HandleGameStateInitialized");
static_assert(offsetof(VKDebugMessagesBase_HandleGameStateInitialized, GameState) == 0x000000, "Member 'VKDebugMessagesBase_HandleGameStateInitialized::GameState' has a wrong offset!");

}

