#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChannelSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoiceChannelSettings.VoiceChannelSettings_C
// 0x0080 (0x03F8 - 0x0378)
class UVoiceChannelSettings_C final : public UFortVoiceSettingsDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GearHover;                                         // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonActionWidget*                    ActionWidget_InputDisplay;                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AlertIcon;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_NextInputDevice;                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_NextOutputDevice;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_TogglePTT;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GearIcon;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_TitleIcon;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   InputDevice;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OutputDevice;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       PTTKeybindWidget;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   PushToTalk;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LowPowerMode;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VoiceDisabledIcon;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   VoiceDisabledText;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ExecuteUbergraph_VoiceChannelSettings(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceChannelSettings_C">();
	}
	static class UVoiceChannelSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChannelSettings_C>();
	}
};
static_assert(alignof(UVoiceChannelSettings_C) == 0x000008, "Wrong alignment on UVoiceChannelSettings_C");
static_assert(sizeof(UVoiceChannelSettings_C) == 0x0003F8, "Wrong size on UVoiceChannelSettings_C");
static_assert(offsetof(UVoiceChannelSettings_C, UberGraphFrame) == 0x000378, "Member 'UVoiceChannelSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, GearHover) == 0x000380, "Member 'UVoiceChannelSettings_C::GearHover' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, ActionWidget_InputDisplay) == 0x000388, "Member 'UVoiceChannelSettings_C::ActionWidget_InputDisplay' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, AlertIcon) == 0x000390, "Member 'UVoiceChannelSettings_C::AlertIcon' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, Button_NextInputDevice) == 0x000398, "Member 'UVoiceChannelSettings_C::Button_NextInputDevice' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, Button_NextOutputDevice) == 0x0003A0, "Member 'UVoiceChannelSettings_C::Button_NextOutputDevice' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, Button_TogglePTT) == 0x0003A8, "Member 'UVoiceChannelSettings_C::Button_TogglePTT' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, GearIcon) == 0x0003B0, "Member 'UVoiceChannelSettings_C::GearIcon' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, Image_TitleIcon) == 0x0003B8, "Member 'UVoiceChannelSettings_C::Image_TitleIcon' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, InputDevice) == 0x0003C0, "Member 'UVoiceChannelSettings_C::InputDevice' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, OutputDevice) == 0x0003C8, "Member 'UVoiceChannelSettings_C::OutputDevice' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, PTTKeybindWidget) == 0x0003D0, "Member 'UVoiceChannelSettings_C::PTTKeybindWidget' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, PushToTalk) == 0x0003D8, "Member 'UVoiceChannelSettings_C::PushToTalk' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, Text_LowPowerMode) == 0x0003E0, "Member 'UVoiceChannelSettings_C::Text_LowPowerMode' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, VoiceDisabledIcon) == 0x0003E8, "Member 'UVoiceChannelSettings_C::VoiceDisabledIcon' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, VoiceDisabledText) == 0x0003F0, "Member 'UVoiceChannelSettings_C::VoiceDisabledText' has a wrong offset!");

}

