#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChannelHeaderButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function VoiceChannelHeaderButton.VoiceChannelHeaderButton_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct VoiceChannelHeaderButton_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoiceChannelHeaderButton_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on VoiceChannelHeaderButton_C_BP_OnItemExpansionChanged");
static_assert(sizeof(VoiceChannelHeaderButton_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on VoiceChannelHeaderButton_C_BP_OnItemExpansionChanged");
static_assert(offsetof(VoiceChannelHeaderButton_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'VoiceChannelHeaderButton_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function VoiceChannelHeaderButton.VoiceChannelHeaderButton_C.ExecuteUbergraph_VoiceChannelHeaderButton
// 0x00F8 (0x00F8 - 0x0000)
struct VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActiveAndListening;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActiveOrAvailable;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsAvailableAndNotActive;             // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsListening;                         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowingRestriction;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_3;                           // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveChannel_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveChannel_ReturnValue_1;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_8;                              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_9;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanJoinChannel_ReturnValue;               // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanJoinChannel_ReturnValue_1;             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListItemExpanded_ReturnValue;           // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_5;                           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00DC(0x0014)()
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton) == 0x000008, "Wrong alignment on VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton");
static_assert(sizeof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton) == 0x0000F8, "Wrong size on VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, EntryPoint) == 0x000000, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_bool_Variable) == 0x000004, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable) == 0x000005, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable_1) == 0x000006, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_bool_Variable_1) == 0x000007, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_struct_Variable) == 0x000008, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_struct_Variable_1) == 0x000018, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_bool_Variable_2) == 0x000028, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable_2) == 0x000029, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable_3) == 0x00002A, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_bool_Variable_3) == 0x00002B, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable_4) == 0x00002C, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable_5) == 0x00002D, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_bool_Variable_4) == 0x00002E, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable_6) == 0x00002F, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable_7) == 0x000030, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Event_bIsActiveAndListening) == 0x000031, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Event_bIsActiveAndListening' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Event_bIsActiveOrAvailable) == 0x000032, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Event_bIsActiveOrAvailable' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Event_bIsAvailableAndNotActive) == 0x000033, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Event_bIsAvailableAndNotActive' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Event_bIsListening) == 0x000034, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Event_bIsListening' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Event_bShowingRestriction) == 0x000035, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Event_bShowingRestriction' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_SelectInt_ReturnValue) == 0x000038, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Select_Default) == 0x00003C, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Select_Default_1) == 0x00003D, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Select_Default_2) == 0x00003E, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Select_Default_3) == 0x000040, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_SelectFloat_ReturnValue) == 0x000050, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Select_Default_4) == 0x000054, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_SelectFloat_ReturnValue_1) == 0x000058, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000060, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000068, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000070, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000078, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_IsActiveChannel_ReturnValue) == 0x000080, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_IsActiveChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_IsActiveChannel_ReturnValue_1) == 0x000081, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_IsActiveChannel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable_8) == 0x000082, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000088, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable_9) == 0x000090, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_SelectInt_ReturnValue_1) == 0x000094, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_bool_Variable_5) == 0x000098, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable_10) == 0x000099, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_byte_Variable_11) == 0x00009A, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_CanJoinChannel_ReturnValue) == 0x00009B, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_CanJoinChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_CanJoinChannel_ReturnValue_1) == 0x00009C, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_CanJoinChannel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_GetEndTime_ReturnValue) == 0x0000A0, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_IsListItemExpanded_ReturnValue) == 0x0000A4, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_IsListItemExpanded_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Event_ListItemObject) == 0x0000B0, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Event_bIsExpanded) == 0x0000B8, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Select_Default_5) == 0x0000B9, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000C0, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, Temp_bool_Variable_6) == 0x0000C8, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, CallFunc_SelectColor_ReturnValue) == 0x0000CC, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_MakeStruct_SlateColor) == 0x0000DC, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton, K2Node_Select_Default_6) == 0x0000F0, "Member 'VoiceChannelHeaderButton_C_ExecuteUbergraph_VoiceChannelHeaderButton::K2Node_Select_Default_6' has a wrong offset!");

// Function VoiceChannelHeaderButton.VoiceChannelHeaderButton_C.OnListItemObjectSet_1
// 0x0008 (0x0008 - 0x0000)
struct VoiceChannelHeaderButton_C_OnListItemObjectSet_1 final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoiceChannelHeaderButton_C_OnListItemObjectSet_1) == 0x000008, "Wrong alignment on VoiceChannelHeaderButton_C_OnListItemObjectSet_1");
static_assert(sizeof(VoiceChannelHeaderButton_C_OnListItemObjectSet_1) == 0x000008, "Wrong size on VoiceChannelHeaderButton_C_OnListItemObjectSet_1");
static_assert(offsetof(VoiceChannelHeaderButton_C_OnListItemObjectSet_1, ListItemObject) == 0x000000, "Member 'VoiceChannelHeaderButton_C_OnListItemObjectSet_1::ListItemObject' has a wrong offset!");

// Function VoiceChannelHeaderButton.VoiceChannelHeaderButton_C.OnUpdateVisuals
// 0x0005 (0x0005 - 0x0000)
struct VoiceChannelHeaderButton_C_OnUpdateVisuals final
{
public:
	bool                                          bIsActiveAndListening;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsActiveOrAvailable;                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAvailableAndNotActive;                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsListening;                                      // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowingRestriction;                               // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoiceChannelHeaderButton_C_OnUpdateVisuals) == 0x000001, "Wrong alignment on VoiceChannelHeaderButton_C_OnUpdateVisuals");
static_assert(sizeof(VoiceChannelHeaderButton_C_OnUpdateVisuals) == 0x000005, "Wrong size on VoiceChannelHeaderButton_C_OnUpdateVisuals");
static_assert(offsetof(VoiceChannelHeaderButton_C_OnUpdateVisuals, bIsActiveAndListening) == 0x000000, "Member 'VoiceChannelHeaderButton_C_OnUpdateVisuals::bIsActiveAndListening' has a wrong offset!");
static_assert(offsetof(VoiceChannelHeaderButton_C_OnUpdateVisuals, bIsActiveOrAvailable) == 0x000001, "Member 'VoiceChannelHeaderButton_C_OnUpdateVisuals::bIsActiveOrAvailable' has a wrong offset!");
