#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaffleTruck_SlurpBazooka_HealthBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WaffleTruck_SlurpBazooka_HealthBar.WaffleTruck_SlurpBazooka_HealthBar_C
// 0x0020 (0x02D8 - 0x02B8)
class UWaffleTruck_SlurpBazooka_HealthBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           Health;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Shield;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WaffleTruck_SlurpBazooka_HealthBar(int32 EntryPoint);
	void SetHealth(float HealthPercent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WaffleTruck_SlurpBazooka_HealthBar_C">();
	}
	static class UWaffleTruck_SlurpBazooka_HealthBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaffleTruck_SlurpBazooka_HealthBar_C>();
	}
};
static_assert(alignof(UWaffleTruck_SlurpBazooka_HealthBar_C) == 0x000008, "Wrong alignment on UWaffleTruck_SlurpBazooka_HealthBar_C");
static_assert(sizeof(UWaffleTruck_SlurpBazooka_HealthBar_C) == 0x0002D8, "Wrong size on UWaffleTruck_SlurpBazooka_HealthBar_C");
static_assert(offsetof(UWaffleTruck_SlurpBazooka_HealthBar_C, UberGraphFrame) == 0x0002B8, "Member 'UWaffleTruck_SlurpBazooka_HealthBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWaffleTruck_SlurpBazooka_HealthBar_C, Health) == 0x0002C0, "Member 'UWaffleTruck_SlurpBazooka_HealthBar_C::Health' has a wrong offset!");
static_assert(offsetof(UWaffleTruck_SlurpBazooka_HealthBar_C, Shield) == 0x0002C8, "Member 'UWaffleTruck_SlurpBazooka_HealthBar_C::Shield' has a wrong offset!");
static_assert(offsetof(UWaffleTruck_SlurpBazooka_HealthBar_C, Target) == 0x0002D0, "Member 'UWaffleTruck_SlurpBazooka_HealthBar_C::Target' has a wrong offset!");

}

