#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterBody_Landmass_Island

#include "Basic.hpp"

#include "Water_structs.hpp"
#include "Water_classes.hpp"
#include "Landmass_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WaterBody_Landmass_Island.WaterBody_Landmass_Island_C
// 0x00D8 (0x0358 - 0x0280)
class AWaterBody_Landmass_Island_C : public AWaterBodyIsland
{
public:
	class UObject*                                Manager;                                           // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FLandmassBrushEffectsList              Terrain_Effects;                                   // 0x0288(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated, NoDestructor, AdvancedDisplay)
	struct FWaterCurveSettings                    Curve_Settings;                                    // 0x02E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated, NoDestructor, AdvancedDisplay)
	TMap<class FName, struct FWaterBodyWeightmapSettings> Layer_Weightmap_Settings;                          // 0x0308(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated, AdvancedDisplay)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WaterBody_Landmass_Island_C">();
	}
	static class AWaterBody_Landmass_Island_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterBody_Landmass_Island_C>();
	}
};
static_assert(alignof(AWaterBody_Landmass_Island_C) == 0x000008, "Wrong alignment on AWaterBody_Landmass_Island_C");
static_assert(sizeof(AWaterBody_Landmass_Island_C) == 0x000358, "Wrong size on AWaterBody_Landmass_Island_C");
static_assert(offsetof(AWaterBody_Landmass_Island_C, Manager) == 0x000280, "Member 'AWaterBody_Landmass_Island_C::Manager' has a wrong offset!");
static_assert(offsetof(AWaterBody_Landmass_Island_C, Terrain_Effects) == 0x000288, "Member 'AWaterBody_Landmass_Island_C::Terrain_Effects' has a wrong offset!");
static_assert(offsetof(AWaterBody_Landmass_Island_C, Curve_Settings) == 0x0002E8, "Member 'AWaterBody_Landmass_Island_C::Curve_Settings' has a wrong offset!");
static_assert(offsetof(AWaterBody_Landmass_Island_C, Layer_Weightmap_Settings) == 0x000308, "Member 'AWaterBody_Landmass_Island_C::Layer_Weightmap_Settings' has a wrong offset!");

}

