#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AudioAnalysis_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_AudioAnalysis_UI.WB_AudioAnalysis_UI_C
// 0x0020 (0x02D8 - 0x02B8)
class UWB_AudioAnalysis_UI_C final : public UFortAudioAnalysisDebugWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           GraphBox;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_AudioAnalysis_FloatGraph_C*> Widgets;                                           // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddScalarParameter(const struct FAudioAnalysisParameterScalar& Param);
	void AddVectorParameter(const struct FAudioAnalysisParameterVector& Param);
	void ClearParameters();
	void ExecuteUbergraph_WB_AudioAnalysis_UI(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_AudioAnalysis_UI_C">();
	}
	static class UWB_AudioAnalysis_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_AudioAnalysis_UI_C>();
	}
};
static_assert(alignof(UWB_AudioAnalysis_UI_C) == 0x000008, "Wrong alignment on UWB_AudioAnalysis_UI_C");
static_assert(sizeof(UWB_AudioAnalysis_UI_C) == 0x0002D8, "Wrong size on UWB_AudioAnalysis_UI_C");
static_assert(offsetof(UWB_AudioAnalysis_UI_C, UberGraphFrame) == 0x0002B8, "Member 'UWB_AudioAnalysis_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_UI_C, GraphBox) == 0x0002C0, "Member 'UWB_AudioAnalysis_UI_C::GraphBox' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_UI_C, Widgets) == 0x0002C8, "Member 'UWB_AudioAnalysis_UI_C::Widgets' has a wrong offset!");

}

