#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WelcomePartyAudioRoutingComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function WelcomePartyAudioRoutingComponent.WelcomePartyAudioRoutingComponent_C.ExecuteUbergraph_WelcomePartyAudioRoutingComponent
// 0x0010 (0x0010 - 0x0000)
struct WelcomePartyAudioRoutingComponent_C_ExecuteUbergraph_WelcomePartyAudioRoutingComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_FadeOutDuration;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        K2Node_CustomEvent_Audio_Component;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WelcomePartyAudioRoutingComponent_C_ExecuteUbergraph_WelcomePartyAudioRoutingComponent) == 0x000008, "Wrong alignment on WelcomePartyAudioRoutingComponent_C_ExecuteUbergraph_WelcomePartyAudioRoutingComponent");
static_assert(sizeof(WelcomePartyAudioRoutingComponent_C_ExecuteUbergraph_WelcomePartyAudioRoutingComponent) == 0x000010, "Wrong size on WelcomePartyAudioRoutingComponent_C_ExecuteUbergraph_WelcomePartyAudioRoutingComponent");
static_assert(offsetof(WelcomePartyAudioRoutingComponent_C_ExecuteUbergraph_WelcomePartyAudioRoutingComponent, EntryPoint) == 0x000000, "Member 'WelcomePartyAudioRoutingComponent_C_ExecuteUbergraph_WelcomePartyAudioRoutingComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(WelcomePartyAudioRoutingComponent_C_ExecuteUbergraph_WelcomePartyAudioRoutingComponent, K2Node_CustomEvent_FadeOutDuration) == 0x000004, "Member 'WelcomePartyAudioRoutingComponent_C_ExecuteUbergraph_WelcomePartyAudioRoutingComponent::K2Node_CustomEvent_FadeOutDuration' has a wrong offset!");
static_assert(offsetof(WelcomePartyAudioRoutingComponent_C_ExecuteUbergraph_WelcomePartyAudioRoutingComponent, K2Node_CustomEvent_Audio_Component) == 0x000008, "Member 'WelcomePartyAudioRoutingComponent_C_ExecuteUbergraph_WelcomePartyAudioRoutingComponent::K2Node_CustomEvent_Audio_Component' has a wrong offset!");

// Function WelcomePartyAudioRoutingComponent.WelcomePartyAudioRoutingComponent_C.Start
// 0x0008 (0x0008 - 0x0000)
struct WelcomePartyAudioRoutingComponent_C_Start final
{
public:
	class UAudioComponent*                        Audio_Component;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WelcomePartyAudioRoutingComponent_C_Start) == 0x000008, "Wrong alignment on WelcomePartyAudioRoutingComponent_C_Start");
static_assert(sizeof(WelcomePartyAudioRoutingComponent_C_Start) == 0x000008, "Wrong size on WelcomePartyAudioRoutingComponent_C_Start");
static_assert(offsetof(WelcomePartyAudioRoutingComponent_C_Start, Audio_Component) == 0x000000, "Member 'WelcomePartyAudioRoutingComponent_C_Start::Audio_Component' has a wrong offset!");

// Function WelcomePartyAudioRoutingComponent.WelcomePartyAudioRoutingComponent_C.Stop
// 0x0004 (0x0004 - 0x0000)
struct WelcomePartyAudioRoutingComponent_C_Stop final
{
public:
	float                                         FadeOutDuration;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WelcomePartyAudioRoutingComponent_C_Stop) == 0x000004, "Wrong alignment on WelcomePartyAudioRoutingComponent_C_Stop");
static_assert(sizeof(WelcomePartyAudioRoutingComponent_C_Stop) == 0x000004, "Wrong size on WelcomePartyAudioRoutingComponent_C_Stop");
static_assert(offsetof(WelcomePartyAudioRoutingComponent_C_Stop, FadeOutDuration) == 0x000000, "Member 'WelcomePartyAudioRoutingComponent_C_Stop::FadeOutDuration' has a wrong offset!");

}

