#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WelcomePartyAudioRoutingComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WelcomePartyAudioRoutingComponent.WelcomePartyAudioRoutingComponent_C
// 0x0020 (0x00C0 - 0x00A0)
class UWelcomePartyAudioRoutingComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundSourceBus*                        SourceBus;                                         // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SourceBusComponent;                                // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             DestroySound;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WelcomePartyAudioRoutingComponent(int32 EntryPoint);
	void Reset();
	void Start(class UAudioComponent* Audio_Component);
	void Stop(float FadeOutDuration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WelcomePartyAudioRoutingComponent_C">();
	}
	static class UWelcomePartyAudioRoutingComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWelcomePartyAudioRoutingComponent_C>();
	}
};
static_assert(alignof(UWelcomePartyAudioRoutingComponent_C) == 0x000008, "Wrong alignment on UWelcomePartyAudioRoutingComponent_C");
static_assert(sizeof(UWelcomePartyAudioRoutingComponent_C) == 0x0000C0, "Wrong size on UWelcomePartyAudioRoutingComponent_C");
static_assert(offsetof(UWelcomePartyAudioRoutingComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UWelcomePartyAudioRoutingComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWelcomePartyAudioRoutingComponent_C, SourceBus) == 0x0000A8, "Member 'UWelcomePartyAudioRoutingComponent_C::SourceBus' has a wrong offset!");
static_assert(offsetof(UWelcomePartyAudioRoutingComponent_C, SourceBusComponent) == 0x0000B0, "Member 'UWelcomePartyAudioRoutingComponent_C::SourceBusComponent' has a wrong offset!");
static_assert(offsetof(UWelcomePartyAudioRoutingComponent_C, DestroySound) == 0x0000B8, "Member 'UWelcomePartyAudioRoutingComponent_C::DestroySound' has a wrong offset!");

}

