#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WesternTiltedPrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WesternTiltedPrompt.WesternTiltedPrompt_C
// 0x0060 (0x0390 - 0x0330)
class UWesternTiltedPrompt_C final : public UFortHUDTagPromptWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeLeft;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeLeft_Bottom;                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeLeft_Top;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeRight;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeRight_Bottom;                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeRight_Top;                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void CloseWidget();
	void ExecuteUbergraph_WesternTiltedPrompt(int32 EntryPoint);
	void OpenWidget(const struct FFortHUDTagPromptData& PrompData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WesternTiltedPrompt_C">();
	}
	static class UWesternTiltedPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWesternTiltedPrompt_C>();
	}
};
static_assert(alignof(UWesternTiltedPrompt_C) == 0x000008, "Wrong alignment on UWesternTiltedPrompt_C");
static_assert(sizeof(UWesternTiltedPrompt_C) == 0x000390, "Wrong size on UWesternTiltedPrompt_C");
static_assert(offsetof(UWesternTiltedPrompt_C, UberGraphFrame) == 0x000330, "Member 'UWesternTiltedPrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Outro) == 0x000338, "Member 'UWesternTiltedPrompt_C::Outro' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Intro) == 0x000340, "Member 'UWesternTiltedPrompt_C::Intro' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeLeft) == 0x000348, "Member 'UWesternTiltedPrompt_C::Image_FiligreeLeft' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeLeft_Bottom) == 0x000350, "Member 'UWesternTiltedPrompt_C::Image_FiligreeLeft_Bottom' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeLeft_Top) == 0x000358, "Member 'UWesternTiltedPrompt_C::Image_FiligreeLeft_Top' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeRight) == 0x000360, "Member 'UWesternTiltedPrompt_C::Image_FiligreeRight' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeRight_Bottom) == 0x000368, "Member 'UWesternTiltedPrompt_C::Image_FiligreeRight_Bottom' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeRight_Top) == 0x000370, "Member 'UWesternTiltedPrompt_C::Image_FiligreeRight_Top' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_Shadow) == 0x000378, "Member 'UWesternTiltedPrompt_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Text_Description) == 0x000380, "Member 'UWesternTiltedPrompt_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Text_Title) == 0x000388, "Member 'UWesternTiltedPrompt_C::Text_Title' has a wrong offset!");

}

