#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WindManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WindManager.WindManager_C.Add Render To Texture Particle
// 0x0070 (0x0070 - 0x0000)
struct WindManager_C_Add_Render_To_Texture_Particle final
{
public:
	class UParticleSystem*                        EmitterTemplate;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InTransform;                                       // 0x0010(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WindManager_C_Add_Render_To_Texture_Particle) == 0x000010, "Wrong alignment on WindManager_C_Add_Render_To_Texture_Particle");
static_assert(sizeof(WindManager_C_Add_Render_To_Texture_Particle) == 0x000070, "Wrong size on WindManager_C_Add_Render_To_Texture_Particle");
static_assert(offsetof(WindManager_C_Add_Render_To_Texture_Particle, EmitterTemplate) == 0x000000, "Member 'WindManager_C_Add_Render_To_Texture_Particle::EmitterTemplate' has a wrong offset!");
static_assert(offsetof(WindManager_C_Add_Render_To_Texture_Particle, InTransform) == 0x000010, "Member 'WindManager_C_Add_Render_To_Texture_Particle::InTransform' has a wrong offset!");

// Function WindManager.WindManager_C.Add Wind Component
// 0x0008 (0x0008 - 0x0000)
struct WindManager_C_Add_Wind_Component final
{
public:
	class UPrimitiveComponent*                    InComponent;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WindManager_C_Add_Wind_Component) == 0x000008, "Wrong alignment on WindManager_C_Add_Wind_Component");
static_assert(sizeof(WindManager_C_Add_Wind_Component) == 0x000008, "Wrong size on WindManager_C_Add_Wind_Component");
static_assert(offsetof(WindManager_C_Add_Wind_Component, InComponent) == 0x000000, "Member 'WindManager_C_Add_Wind_Component::InComponent' has a wrong offset!");

// Function WindManager.WindManager_C.AddWindParticleSystemComponent
// 0x0008 (0x0008 - 0x0000)
struct WindManager_C_AddWindParticleSystemComponent final
{
public:
	class UParticleSystemComponent*               ParticleSystemComponent;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WindManager_C_AddWindParticleSystemComponent) == 0x000008, "Wrong alignment on WindManager_C_AddWindParticleSystemComponent");
static_assert(sizeof(WindManager_C_AddWindParticleSystemComponent) == 0x000008, "Wrong size on WindManager_C_AddWindParticleSystemComponent");
static_assert(offsetof(WindManager_C_AddWindParticleSystemComponent, ParticleSystemComponent) == 0x000000, "Member 'WindManager_C_AddWindParticleSystemComponent::ParticleSystemComponent' has a wrong offset!");

// Function WindManager.WindManager_C.Calculate Camera Position
// 0x0140 (0x0140 - 0x0000)
struct WindManager_C_Calculate_Camera_Position final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneCaptureComponent2D*               Scene_Capture;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorFloat_ReturnValue;         // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_2;                      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_4;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WindManager_C_Calculate_Camera_Position) == 0x000008, "Wrong alignment on WindManager_C_Calculate_Camera_Position");
static_assert(sizeof(WindManager_C_Calculate_Camera_Position) == 0x000140, "Wrong size on WindManager_C_Calculate_Camera_Position");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, Scale) == 0x000000, "Member 'WindManager_C_Calculate_Camera_Position::Scale' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, Scene_Capture) == 0x000008, "Member 'WindManager_C_Calculate_Camera_Position::Scene_Capture' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, ReturnValue) == 0x000010, "Member 'WindManager_C_Calculate_Camera_Position::ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000028, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_GetCameraLocation_ReturnValue) == 0x000030, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000048, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000060, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_MakeVector_ReturnValue) == 0x000068, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000080, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_MakeVector_ReturnValue_1) == 0x000088, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000A0, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_Divide_VectorVector_ReturnValue) == 0x0000B8, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_Subtract_VectorFloat_ReturnValue) == 0x0000D0, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_Subtract_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_BreakVector_X) == 0x0000E8, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_BreakVector_Y) == 0x0000EC, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_FCeil_ReturnValue) == 0x0000F4, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_FCeil_ReturnValue_1) == 0x0000F8, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_FCeil_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x0000FC, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000100, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_FCeil_ReturnValue_2) == 0x000104, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_FCeil_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_Conv_IntToFloat_ReturnValue_4) == 0x000108, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_Conv_IntToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_MakeVector_ReturnValue_2) == 0x000110, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_Calculate_Camera_Position, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000128, "Member 'WindManager_C_Calculate_Camera_Position::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");

// Function WindManager.WindManager_C.ExecuteUbergraph_WindManager
// 0x0500 (0x0500 - 0x0000)
struct WindManager_C_ExecuteUbergraph_WindManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_CustomEvent_Particle_Transform;             // 0x0020(0x0060)(IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               K2Node_Event_ParticleSystemComponent;              // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_Effect_Water_Interaction_FX;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_Gameplay_Wind_INteraction_Effects; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_InComponent;                    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewMagnitude;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_CustomEvent_EmitterTemplate;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_CustomEvent_InTransform;                    // 0x00D0(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetWindImpulseCylinderMagnitude_ReturnValue; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Radius;                         // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ImpulseMagnitude;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortWindImpulseCylinder               K2Node_Event_WindImpulseCylinder;                  // 0x0148(0x0080)(ConstParm, NoDestructor)
	struct FFortWindImpulseCylinderDelta          K2Node_Event_WindImpulseCylinderDelta;             // 0x01C8(0x00F8)(ConstParm, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortWindImpulseCylinder               CallFunc_MakeWindImpulseCylinder_ReturnValue;      // 0x02C8(0x0080)(NoDestructor)
	struct FFortWindImpulseHandle                 CallFunc_AddWindImpulseCylinder_ReturnValue;       // 0x0348(0x0004)(NoDestructor)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortWindImpulseCylinder               K2Node_Event_WindImpulseCylinder_1;                // 0x0350(0x0080)(ConstParm, NoDestructor)
	struct FVector                                CallFunc_BreakWindImpulseCylinderAdvanced_WindLocation; // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindInnerRadius; // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindOuterRadius; // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldDirection; // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindMagnitude; // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldBounds; // 0x0410(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChanging; // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChangePending; // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44A[0x6];                                      // 0x044A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortWindImpulseCylinder               K2Node_Event_WindImpulseCylinder_2;                // 0x0450(0x0080)(ConstParm, NoDestructor)
	bool                                          CallFunc_Find_Matching_Wind_Mesh_Index_And_Write_Bool_Storm_Cyl_Mesh_Match; // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Find_Matching_Wind_Mesh_Index_And_Write_Bool_Wind_Cyl_Mesh_Array_Match_Index; // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WindManager_C_ExecuteUbergraph_WindManager) == 0x000010, "Wrong alignment on WindManager_C_ExecuteUbergraph_WindManager");
static_assert(sizeof(WindManager_C_ExecuteUbergraph_WindManager) == 0x000500, "Wrong size on WindManager_C_ExecuteUbergraph_WindManager");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, EntryPoint) == 0x000000, "Member 'WindManager_C_ExecuteUbergraph_WindManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_Particle_Transform) == 0x000020, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_Particle_Transform' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_Event_ParticleSystemComponent) == 0x000080, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_Event_ParticleSystemComponent' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_Effect_Water_Interaction_FX) == 0x000088, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_Effect_Water_Interaction_FX' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_Gameplay_Wind_INteraction_Effects) == 0x000090, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_Gameplay_Wind_INteraction_Effects' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000098, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_InComponent) == 0x0000A0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_InComponent' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeVector_ReturnValue_1) == 0x0000A8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_NewMagnitude) == 0x0000C0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_NewMagnitude' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_EmitterTemplate) == 0x0000C8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_EmitterTemplate' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_InTransform) == 0x0000D0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_InTransform' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_SetWindImpulseCylinderMagnitude_ReturnValue) == 0x000130, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_SetWindImpulseCylinderMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeLiteralName_ReturnValue) == 0x000134, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000138, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeLiteralName_ReturnValue_2) == 0x00013C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_Radius) == 0x000140, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_Radius' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_ImpulseMagnitude) == 0x000144, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_ImpulseMagnitude' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_Event_WindImpulseCylinder) == 0x000148, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_Event_WindImpulseCylinder' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_Event_WindImpulseCylinderDelta) == 0x0001C8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_Event_WindImpulseCylinderDelta' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002C0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeWindImpulseCylinder_ReturnValue) == 0x0002C8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeWindImpulseCylinder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_AddWindImpulseCylinder_ReturnValue) == 0x000348, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_AddWindImpulseCylinder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_Event_WindImpulseCylinder_1) == 0x000350, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_Event_WindImpulseCylinder_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakWindImpulseCylinderAdvanced_WindLocation) == 0x0003D0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakWindImpulseCylinderAdvanced_WindLocation' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakWindImpulseCylinderAdvanced_WindInnerRadius) == 0x0003E8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakWindImpulseCylinderAdvanced_WindInnerRadius' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakWindImpulseCylinderAdvanced_WindOuterRadius) == 0x0003EC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakWindImpulseCylinderAdvanced_WindOuterRadius' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldDirection) == 0x0003F0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldDirection' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakWindImpulseCylinderAdvanced_WindMagnitude) == 0x000408, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakWindImpulseCylinderAdvanced_WindMagnitude' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldBounds) == 0x000410, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldBounds' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChanging) == 0x000448, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChanging' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChangePending) == 0x000449, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChangePending' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_Event_WindImpulseCylinder_2) == 0x000450, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_Event_WindImpulseCylinder_2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Find_Matching_Wind_Mesh_Index_And_Write_Bool_Storm_Cyl_Mesh_Match) == 0x0004D0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Find_Matching_Wind_Mesh_Index_And_Write_Bool_Storm_Cyl_Mesh_Match' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Find_Matching_Wind_Mesh_Index_And_Write_Bool_Wind_Cyl_Mesh_Array_Match_Index) == 0x0004D4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Find_Matching_Wind_Mesh_Index_And_Write_Bool_Wind_Cyl_Mesh_Array_Match_Index' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item) == 0x0004D8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_GetMaterial_ReturnValue) == 0x0004E0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x0004E8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_DynamicCast_bSuccess) == 0x0004F0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x0004F4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");

// Function WindManager.WindManager_C.Find Matching Wind Mesh Index And Write Bool
// 0x00A0 (0x00A0 - 0x0000)
struct WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool final
{
public:
	struct FVector                                Wind_location;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Storm_Cyl_Mesh_Match_0;                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Wind_Cyl_Mesh_Array_Match_Index_0;                 // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool) == 0x000008, "Wrong alignment on WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool");
static_assert(sizeof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool) == 0x0000A0, "Wrong size on WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, Wind_location) == 0x000000, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::Wind_location' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, Storm_Cyl_Mesh_Match_0) == 0x000018, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::Storm_Cyl_Mesh_Match_0' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, Wind_Cyl_Mesh_Array_Match_Index_0) == 0x00001C, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::Wind_Cyl_Mesh_Array_Match_Index_0' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000020, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, Temp_bool_True_if_break_was_hit_Variable) == 0x000038, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, CallFunc_Array_Get_Item) == 0x000050, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000060, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, CallFunc_BooleanAND_ReturnValue) == 0x000078, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000080, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000098, "Member 'WindManager_C_Find_Matching_Wind_Mesh_Index_And_Write_Bool::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");

// Function WindManager.WindManager_C.OnWindImpulseCylinderCreation
// 0x0178 (0x0178 - 0x0000)
struct WindManager_C_OnWindImpulseCylinderCreation final
{
public:
	struct FFortWindImpulseCylinder               WindImpulseCylinder;                               // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FFortWindImpulseCylinderDelta          WindImpulseCylinderDelta;                          // 0x0080(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WindManager_C_OnWindImpulseCylinderCreation) == 0x000008, "Wrong alignment on WindManager_C_OnWindImpulseCylinderCreation");
static_assert(sizeof(WindManager_C_OnWindImpulseCylinderCreation) == 0x000178, "Wrong size on WindManager_C_OnWindImpulseCylinderCreation");
static_assert(offsetof(WindManager_C_OnWindImpulseCylinderCreation, WindImpulseCylinder) == 0x000000, "Member 'WindManager_C_OnWindImpulseCylinderCreation::WindImpulseCylinder' has a wrong offset!");
static_assert(offsetof(WindManager_C_OnWindImpulseCylinderCreation, WindImpulseCylinderDelta) == 0x000080, "Member 'WindManager_C_OnWindImpulseCylinderCreation::WindImpulseCylinderDelta' has a wrong offset!");

// Function WindManager.WindManager_C.OnWindImpulseCylinderDeath
// 0x0080 (0x0080 - 0x0000)
struct WindManager_C_OnWindImpulseCylinderDeath final
{
public:
	struct FFortWindImpulseCylinder               WindImpulseCylinder;                               // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WindManager_C_OnWindImpulseCylinderDeath) == 0x000008, "Wrong alignment on WindManager_C_OnWindImpulseCylinderDeath");
static_assert(sizeof(WindManager_C_OnWindImpulseCylinderDeath) == 0x000080, "Wrong size on WindManager_C_OnWindImpulseCylinderDeath");
static_assert(offsetof(WindManager_C_OnWindImpulseCylinderDeath, WindImpulseCylinder) == 0x000000, "Member 'WindManager_C_OnWindImpulseCylinderDeath::WindImpulseCylinder' has a wrong offset!");

// Function WindManager.WindManager_C.OnWindImpulseCylinderDeltaComplete
// 0x0080 (0x0080 - 0x0000)
struct WindManager_C_OnWindImpulseCylinderDeltaComplete final
{
public:
	struct FFortWindImpulseCylinder               WindImpulseCylinder;                               // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WindManager_C_OnWindImpulseCylinderDeltaComplete) == 0x000008, "Wrong alignment on WindManager_C_OnWindImpulseCylinderDeltaComplete");
static_assert(sizeof(WindManager_C_OnWindImpulseCylinderDeltaComplete) == 0x000080, "Wrong size on WindManager_C_OnWindImpulseCylinderDeltaComplete");
static_assert(offsetof(WindManager_C_OnWindImpulseCylinderDeltaComplete, WindImpulseCylinder) == 0x000000, "Member 'WindManager_C_OnWindImpulseCylinderDeltaComplete::WindImpulseCylinder' has a wrong offset!");

// Function WindManager.WindManager_C.Play Water Splash Particle System At Location
// 0x0060 (0x0060 - 0x0000)
struct WindManager_C_Play_Water_Splash_Particle_System_At_Location final
{
public:
	struct FTransform                             Particle_Transform;                                // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WindManager_C_Play_Water_Splash_Particle_System_At_Location) == 0x000010, "Wrong alignment on WindManager_C_Play_Water_Splash_Particle_System_At_Location");
static_assert(sizeof(WindManager_C_Play_Water_Splash_Particle_System_At_Location) == 0x000060, "Wrong size on WindManager_C_Play_Water_Splash_Particle_System_At_Location");
static_assert(offsetof(WindManager_C_Play_Water_Splash_Particle_System_At_Location, Particle_Transform) == 0x000000, "Member 'WindManager_C_Play_Water_Splash_Particle_System_At_Location::Particle_Transform' has a wrong offset!");

// Function WindManager.WindManager_C.Register player for render to texture purposes
// 0x0010 (0x0010 - 0x0000)
struct WindManager_C_Register_player_for_render_to_texture_purposes final
{
public:
	class UPrimitiveComponent*                    Effect_Water_Interaction_FX;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Gameplay_Wind_INteraction_Effects;                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WindManager_C_Register_player_for_render_to_texture_purposes) == 0x000008, "Wrong alignment on WindManager_C_Register_player_for_render_to_texture_purposes");
static_assert(sizeof(WindManager_C_Register_player_for_render_to_texture_purposes) == 0x000010, "Wrong size on WindManager_C_Register_player_for_render_to_texture_purposes");
static_assert(offsetof(WindManager_C_Register_player_for_render_to_texture_purposes, Effect_Water_Interaction_FX) == 0x000000, "Member 'WindManager_C_Register_player_for_render_to_texture_purposes::Effect_Water_Interaction_FX' has a wrong offset!");
static_assert(offsetof(WindManager_C_Register_player_for_render_to_texture_purposes, Gameplay_Wind_INteraction_Effects) == 0x000008, "Member 'WindManager_C_Register_player_for_render_to_texture_purposes::Gameplay_Wind_INteraction_Effects' has a wrong offset!");

// Function WindManager.WindManager_C.RemoveWindCylinder
// 0x0180 (0x0180 - 0x0000)
struct WindManager_C_RemoveWindCylinder final
{
public:
	struct FFortWindImpulseCylinder               WindImpulseCylinder;                               // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UStaticMeshComponent*                   CurrentStormCylinder;                              // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakWindImpulseCylinderAdvanced_WindLocation; // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindInnerRadius; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindOuterRadius; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldDirection; // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindMagnitude; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldBounds; // 0x00D0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChanging; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChangePending; // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WindManager_C_RemoveWindCylinder) == 0x000008, "Wrong alignment on WindManager_C_RemoveWindCylinder");
static_assert(sizeof(WindManager_C_RemoveWindCylinder) == 0x000180, "Wrong size on WindManager_C_RemoveWindCylinder");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, WindImpulseCylinder) == 0x000000, "Member 'WindManager_C_RemoveWindCylinder::WindImpulseCylinder' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CurrentStormCylinder) == 0x000080, "Member 'WindManager_C_RemoveWindCylinder::CurrentStormCylinder' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, Temp_bool_True_if_break_was_hit_Variable) == 0x000088, "Member 'WindManager_C_RemoveWindCylinder::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_BreakWindImpulseCylinderAdvanced_WindLocation) == 0x000090, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_BreakWindImpulseCylinderAdvanced_WindLocation' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_BreakWindImpulseCylinderAdvanced_WindInnerRadius) == 0x0000A8, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_BreakWindImpulseCylinderAdvanced_WindInnerRadius' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_BreakWindImpulseCylinderAdvanced_WindOuterRadius) == 0x0000AC, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_BreakWindImpulseCylinderAdvanced_WindOuterRadius' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldDirection) == 0x0000B0, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldDirection' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_BreakWindImpulseCylinderAdvanced_WindMagnitude) == 0x0000C8, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_BreakWindImpulseCylinderAdvanced_WindMagnitude' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldBounds) == 0x0000D0, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldBounds' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChanging) == 0x000108, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChanging' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChangePending) == 0x000109, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChangePending' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000110, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_Not_PreBool_ReturnValue) == 0x000128, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, Temp_int_Array_Index_Variable) == 0x00012C, "Member 'WindManager_C_RemoveWindCylinder::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, Temp_int_Loop_Counter_Variable) == 0x000130, "Member 'WindManager_C_RemoveWindCylinder::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_Add_IntInt_ReturnValue) == 0x000134, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_Array_Get_Item) == 0x000138, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_Array_Length_ReturnValue) == 0x000140, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_Less_IntInt_ReturnValue) == 0x000144, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_Array_RemoveItem_ReturnValue) == 0x000145, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_BooleanAND_ReturnValue) == 0x000146, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000148, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000160, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WindManager_C_RemoveWindCylinder, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000178, "Member 'WindManager_C_RemoveWindCylinder::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");

// Function WindManager.WindManager_C.SetWindMatVariables
// 0x0128 (0x0128 - 0x0000)
struct WindManager_C_SetWindMatVariables final
{
public:
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Set_AnimatedCylinderCenter;                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AnimatedCylinderCenter;                            // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Set_Animating_Wind_Magnitude;                      // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
