#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinnerOverlay_v2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WinnerOverlay_v2.WinnerOverlay_v2_C.ExecuteUbergraph_WinnerOverlay_v2
// 0x0090 (0x0090 - 0x0000)
struct WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldVictoryUIPushEmoteInput_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLanguage_ReturnValue;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2) == 0x000008, "Wrong alignment on WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2");
static_assert(sizeof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2) == 0x000090, "Wrong size on WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, EntryPoint) == 0x000000, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_GetContext_ReturnValue_1) == 0x000010, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_ShouldVictoryUIPushEmoteInput_ReturnValue) == 0x000018, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_ShouldVictoryUIPushEmoteInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, Temp_float_Variable) == 0x00001C, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_GetCurrentLanguage_ReturnValue) == 0x000020, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_GetCurrentLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_Contains_ReturnValue) == 0x000030, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_Contains_ReturnValue_1) == 0x000031, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_BooleanOR_ReturnValue) == 0x000032, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_BooleanOR_ReturnValue_1) == 0x000033, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000038, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_GetEndTime_ReturnValue) == 0x000048, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, Temp_float_Variable_1) == 0x00004C, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, K2Node_Event_IsDesignTime) == 0x000058, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1) == 0x000060, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_PlayAnimation_ReturnValue_2) == 0x000068, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, Temp_bool_Variable) == 0x000070, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, K2Node_Select_Default) == 0x000074, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, CallFunc_Add_FloatFloat_ReturnValue) == 0x000078, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2, K2Node_MakeStruct_Margin) == 0x00007C, "Member 'WinnerOverlay_v2_C_ExecuteUbergraph_WinnerOverlay_v2::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function WinnerOverlay_v2.WinnerOverlay_v2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WinnerOverlay_v2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinnerOverlay_v2_C_PreConstruct) == 0x000001, "Wrong alignment on WinnerOverlay_v2_C_PreConstruct");
static_assert(sizeof(WinnerOverlay_v2_C_PreConstruct) == 0x000001, "Wrong size on WinnerOverlay_v2_C_PreConstruct");
static_assert(offsetof(WinnerOverlay_v2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WinnerOverlay_v2_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

