#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinnerOverlay_v2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinnerOverlay_v2.WinnerOverlay_v2_C
// 0x0070 (0x0390 - 0x0320)
class UWinnerOverlay_v2_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Victory_v2_b2;                                     // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpinningSpikeball;                                 // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Victory_v2_b;                                      // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Victory_v2;                                        // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaWinnerList_C*                    AthenaWinnerList;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_winanim;                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SpecialEndingSocket;                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayVictoryText;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Royale;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_RoyaleShadow;                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Victory;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_VictoryShadow;                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DEVTestLocSpace;                                   // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated_1();
	void Construct();
	void ExecuteUbergraph_WinnerOverlay_v2(int32 EntryPoint);
	void PlayVictoryAnim();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinnerOverlay_v2_C">();
	}
	static class UWinnerOverlay_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinnerOverlay_v2_C>();
	}
};
static_assert(alignof(UWinnerOverlay_v2_C) == 0x000008, "Wrong alignment on UWinnerOverlay_v2_C");
static_assert(sizeof(UWinnerOverlay_v2_C) == 0x000390, "Wrong size on UWinnerOverlay_v2_C");
static_assert(offsetof(UWinnerOverlay_v2_C, UberGraphFrame) == 0x000320, "Member 'UWinnerOverlay_v2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, Victory_v2_b2) == 0x000328, "Member 'UWinnerOverlay_v2_C::Victory_v2_b2' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, SpinningSpikeball) == 0x000330, "Member 'UWinnerOverlay_v2_C::SpinningSpikeball' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, Victory_v2_b) == 0x000338, "Member 'UWinnerOverlay_v2_C::Victory_v2_b' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, Victory_v2) == 0x000340, "Member 'UWinnerOverlay_v2_C::Victory_v2' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, AthenaWinnerList) == 0x000348, "Member 'UWinnerOverlay_v2_C::AthenaWinnerList' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, CommonWidgetSwitcher_winanim) == 0x000350, "Member 'UWinnerOverlay_v2_C::CommonWidgetSwitcher_winanim' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, Overlay_SpecialEndingSocket) == 0x000358, "Member 'UWinnerOverlay_v2_C::Overlay_SpecialEndingSocket' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, OverlayVictoryText) == 0x000360, "Member 'UWinnerOverlay_v2_C::OverlayVictoryText' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, RichTextBlock_Royale) == 0x000368, "Member 'UWinnerOverlay_v2_C::RichTextBlock_Royale' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, RichTextBlock_RoyaleShadow) == 0x000370, "Member 'UWinnerOverlay_v2_C::RichTextBlock_RoyaleShadow' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, RichTextBlock_Victory) == 0x000378, "Member 'UWinnerOverlay_v2_C::RichTextBlock_Victory' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, RichTextBlock_VictoryShadow) == 0x000380, "Member 'UWinnerOverlay_v2_C::RichTextBlock_VictoryShadow' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, DEVTestLocSpace) == 0x000388, "Member 'UWinnerOverlay_v2_C::DEVTestLocSpace' has a wrong offset!");

}

