#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WolfRidableComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WolfRidableComponent.WolfRidableComponent_C.GetRunSpeed
// 0x0010 (0x0010 - 0x0000)
struct WolfRidableComponent_C_GetRunSpeed final
{
public:
	float                                         RunSpeed;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WolfRidableComponent_C_GetRunSpeed) == 0x000004, "Wrong alignment on WolfRidableComponent_C_GetRunSpeed");
static_assert(sizeof(WolfRidableComponent_C_GetRunSpeed) == 0x000010, "Wrong size on WolfRidableComponent_C_GetRunSpeed");
static_assert(offsetof(WolfRidableComponent_C_GetRunSpeed, RunSpeed) == 0x000000, "Member 'WolfRidableComponent_C_GetRunSpeed::RunSpeed' has a wrong offset!");
static_assert(offsetof(WolfRidableComponent_C_GetRunSpeed, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000004, "Member 'WolfRidableComponent_C_GetRunSpeed::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(WolfRidableComponent_C_GetRunSpeed, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000008, "Member 'WolfRidableComponent_C_GetRunSpeed::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(WolfRidableComponent_C_GetRunSpeed, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'WolfRidableComponent_C_GetRunSpeed::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

