#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZipLine_Pole_Capsules

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ZipLine_Pole_Capsules.ZipLine_Pole_Capsules_C
// 0x0028 (0x0E98 - 0x0E70)
class AZipLine_Pole_Capsules_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      CapsuleFittedTop;                                  // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleSmall;                                      // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleLarge;                                      // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AZipLine_Pole_Apollo_C*                 ZiplinePole;                                       // 0x0E90(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Set_Small_Overlap_Collision_Enabled(bool SetTo);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_ZipLine_Pole_Capsules(int32 EntryPoint);
	void EndLargeCapsuleOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BindLargeCapsuleOverlapEvents();
	void BeginLargeCapsuleOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ZipLine_Pole_Capsules_C">();
	}
	static class AZipLine_Pole_Capsules_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZipLine_Pole_Capsules_C>();
	}
};
static_assert(alignof(AZipLine_Pole_Capsules_C) == 0x000008, "Wrong alignment on AZipLine_Pole_Capsules_C");
static_assert(sizeof(AZipLine_Pole_Capsules_C) == 0x000E98, "Wrong size on AZipLine_Pole_Capsules_C");
static_assert(offsetof(AZipLine_Pole_Capsules_C, UberGraphFrame) == 0x000E70, "Member 'AZipLine_Pole_Capsules_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AZipLine_Pole_Capsules_C, CapsuleFittedTop) == 0x000E78, "Member 'AZipLine_Pole_Capsules_C::CapsuleFittedTop' has a wrong offset!");
static_assert(offsetof(AZipLine_Pole_Capsules_C, CapsuleSmall) == 0x000E80, "Member 'AZipLine_Pole_Capsules_C::CapsuleSmall' has a wrong offset!");
static_assert(offsetof(AZipLine_Pole_Capsules_C, CapsuleLarge) == 0x000E88, "Member 'AZipLine_Pole_Capsules_C::CapsuleLarge' has a wrong offset!");
static_assert(offsetof(AZipLine_Pole_Capsules_C, ZiplinePole) == 0x000E90, "Member 'AZipLine_Pole_Capsules_C::ZiplinePole' has a wrong offset!");

}

